--[=========[
1-生命
2-物攻
3-法攻
4-物防
5-法防
6-攻击
7-防御
8-生命%
9-物攻%
10-法攻%
11-物防%
12-法防%
13-攻击%
14-防御%
15-命中率%
16-闪避率%
17-暴击率%
18-抗暴率%
19-伤害增加%
20-伤害减免%
21-最终命中率%
22-最终闪避率%
23-最终暴击率%
24-最终抗暴率%
25-最终伤害增加%
26-最终伤害减免%
27-抗魏%
28-抗蜀%
29-抗吴%
30-抗群%
31-灭魏%
32-灭蜀%
33-灭吴%
34-灭群%
35-攻击吸血%
36-反弹物理伤害%
37-反弹法术伤害%
38-暴击伤害增加%
39-异常状态抗性%
40-怒气降低抗性%
41-治愈量加成%
42-被治愈量%
43-每次行动概率恢复1点怒气%
44-攻击无视防御%
45-初始合击值
46-合击值上限
47-合击值回复
48-受到伤害时概率恢复1点怒气
49-基础怒气值
50-每次行动恢复%的生命%
51-PVP增伤%
52-PVP减伤%
]=========]

local PropConst = {
	HP = 1,
	ATK = 2,
	MTK = 3,
	DEF = 4,
	MEF = 5,
	
}

return PropConst