---@classdef record_activity_problems_info
local record_activity_problems_info = {}


record_activity_problems_info.bank_id = 0--题库编号
record_activity_problems_info.question_id = 0--题库序列
record_activity_problems_info.title =  ""--题目
record_activity_problems_info.key_1 =  ""--答案1
record_activity_problems_info.key_2 =  ""--答案2
record_activity_problems_info.key_3 =  ""--答案3
record_activity_problems_info.right_id = 0--正确答案序号

local activity_problems_info = {
   _data = {   
    [1] = {1,1,"谁借的东风？","300300","300320","500180",1,},  
    [2] = {1,2,"诸葛亮的妻子是谁？","300500","500130","510080",1,},  
    [3] = {1,3,"献连环计火烧赤壁的是谁？","500070","300300","510010",1,},  
    [4] = {1,4,"没有参加“三英战吕布”的武将是谁?","510040","510030","300310",1,},  
    [5] = {1,5,"谁孤身一人救阿斗于千军万马之中?","510040","500080","300310",1,},  
    [6] = {1,6,"孔明借东风后是由谁接应而免遭周瑜陷害?","510040","500080","500090",1,},  
    [7] = {1,7,"曹植的“洛神赋”指的是谁的妻子?","300320","300330","400020",3,},  
    [8] = {1,8,"关公坐骑赤兔马原本是谁的?","500230","300310","300340",3,},  
    [9] = {1,9,"关羽在曹营时，先斩杀了哪一位袁绍军的大将?","400150","500240","400140",3,},  
    [10] = {1,10,"刮骨疗伤的故事里面出现的主角是谁?","500080","510040","300310",3,},  
    [11] = {1,11,"汜水关应战群雄，并斩落上将潘凤的是谁?","300310","400150","500220",3,},  
    [12] = {1,12,"“以逸待劳”是定军山之战时谁出的计谋?","500090","300300","400080",3,},  
    [13] = {1,13,"吕布听了王允的话，之后杀了谁?","300350","500200","500230",3,},  
    [14] = {1,14,"桃园三结义在谁的家里举行的?","300310","510030","500080",3,},  
    [15] = {1,15,"号称小霸王的三国名人是谁?","500140","500150","300330",3,},  
    [16] = {1,16,"三国中被称为“飞将”的武将是?","300340","510040","500080",1,},  
    [17] = {1,17,"东汉时期的“黄巾之乱”中的黄巾军首领是谁?","300350","500060","500080",1,},  
    [18] = {1,18,"曹操煮酒论英雄指的是谁?","510030","500140","300340",1,},  
    [19] = {1,19,"三国时期蜀国五虎上将谁先去世的?","300310","500090","500110",1,},  
    [20] = {1,20,"三国时期蜀国五虎上将谁最后去世的?","510040","500110","500080",1,},  
    [21] = {1,21,"打仗时眼睛被流箭射中，勇悍的把眼睛吃掉的将领是?","500040","500080","500050",1,},  
    [22] = {1,22,"赤壁之战中，谁献策诈降曹操?","400110","510030","300320",1,},  
    [23] = {1,23,"博望坡上用计火烧曹军的是?","300300","500070","400080",1,},  
    [24] = {1,24,"火烧连营，大败刘备的吴国年轻将领是?","510050","300320","500180",1,},  
    [25] = {1,25,"大乔嫁给了谁?","300330","500140","500150",1,},  
    [26] = {1,26,"定军山时谁是蜀国的老将?","500090","300310","500080",1,},  
    [27] = {1,27,"最后被诸葛亮给活活气死的是谁?","300320","500180","510050",1,},  
    [28] = {1,28,"三国中\"凤雏\"是谁的称号?","500070","300300","400080",1,},  
    [29] = {1,29,"三国里谁是古代四大美女之一?","510080","510060","500130",1,},  
    [30] = {1,30,"的卢是谁的坐骑?","510030","510040","500110",1,},  
    [31] = {1,31,"成为反董卓联军盟主的是谁?","500200","300340","300280",1,},  
    [32] = {1,32,"汜水关之战中成为反董卓军前锋的是?","500150","300280","510030",1,},  
    [33] = {1,33,"蜀军猛将之中成为老当益壮的代名词的老将是?","500090","300310","510040",1,},  
    [34] = {1,34,"嘲笑吕布是“三姓家奴”的是谁？","510030","500080","300310",2,},  
    [35] = {1,35,"三国鬼才是谁？","300530","510010","510070",2,},  
    [36] = {1,36,"谁进言何进应该先立君位？","500200","300280","500230",2,},  
    [37] = {1,37,"“乱天下者，必何进也”是谁的断言？","500200","300280","300350",2,},  
    [38] = {1,38,"赵云最初是谁的手下？","300340","500200","500240",2,},  
    [39] = {1,39,"被羌人称为“白马将军”的是谁？","510040","500240","500110",2,},  
    [40] = {1,40,"董卓被谁杀死？","510080","300340","300280",2,},  
    [41] = {1,41,"家住楼桑村的是谁？","300310","510030","500080",2,},  
    [42] = {1,42,"以下谁为丹凤眼？","510040","300310","510030",2,},  
    [43] = {1,43,"其中是三国“三杰”之一的是谁？","510030","300280","300310",2,},  
    [44] = {1,44,"合肥之战中，谁放箭射中乐进面门而救了凌统？","400110","600100","500160",2,},  
    [45] = {1,45,"东吴的谁率军智取荆州？","300320","510050","500180",2,},  
    [46] = {1,46,"替关羽刮骨疗毒的是谁？","510030","500190","500080",2,},  
    [47] = {1,47,"成语“一个愿打一个愿挨”，谁被打？","500090","400110","300320",2,},  
    [48] = {1,48,"成语“一个愿打一个愿挨”，谁打人？","400110","300320","500080",2,},  
    [49] = {1,49,"孔明是谁的字？","500070","510030","300300",3,},  
    [50] = {1,50,"翼德是谁的字？","510030","300310","500080",3,},  
    [51] = {1,51,"伯符是谁的字？","500150","300330","500140",2,},  
    [52] = {1,52,"文台是谁的字？","500150","300330","500140",1,},  
    [53] = {1,53,"仲谋是谁的字？","500150","300330","500140",3,},  
    [54] = {1,54,"公瑾是谁的字？","300320","400130","510060",1,},  
    [55] = {1,55,"刘备的“常胜将军”是谁？","300310","500080","510040",3,},  
    [56] = {1,56,"“宁教我负天下人，不教天下人负我。”是谁说的？","500230","300280","300340",2,},  
    [57] = {1,57,"“温酒斩华雄”的主人公是谁？","500020","300290","300310",3,},  
    [58] = {1,58,"“天公将军”是谁？","500230","500240","300350",3,},  
    [59] = {1,59,"吕布喜欢谁？","500130","510080","500010",2,},
    }
}

local __index_bank_id_question_id = {   
    ["1_1"] = 1,  
    ["1_2"] = 2,  
    ["1_3"] = 3,  
    ["1_4"] = 4,  
    ["1_5"] = 5,  
    ["1_6"] = 6,  
    ["1_7"] = 7,  
    ["1_8"] = 8,  
    ["1_9"] = 9,  
    ["1_10"] = 10,  
    ["1_11"] = 11,  
    ["1_12"] = 12,  
    ["1_13"] = 13,  
    ["1_14"] = 14,  
    ["1_15"] = 15,  
    ["1_16"] = 16,  
    ["1_17"] = 17,  
    ["1_18"] = 18,  
    ["1_19"] = 19,  
    ["1_20"] = 20,  
    ["1_21"] = 21,  
    ["1_22"] = 22,  
    ["1_23"] = 23,  
    ["1_24"] = 24,  
    ["1_25"] = 25,  
    ["1_26"] = 26,  
    ["1_27"] = 27,  
    ["1_28"] = 28,  
    ["1_29"] = 29,  
    ["1_30"] = 30,  
    ["1_31"] = 31,  
    ["1_32"] = 32,  
    ["1_33"] = 33,  
    ["1_34"] = 34,  
    ["1_35"] = 35,  
    ["1_36"] = 36,  
    ["1_37"] = 37,  
    ["1_38"] = 38,  
    ["1_39"] = 39,  
    ["1_40"] = 40,  
    ["1_41"] = 41,  
    ["1_42"] = 42,  
    ["1_43"] = 43,  
    ["1_44"] = 44,  
    ["1_45"] = 45,  
    ["1_46"] = 46,  
    ["1_47"] = 47,  
    ["1_48"] = 48,  
    ["1_49"] = 49,  
    ["1_50"] = 50,  
    ["1_51"] = 51,  
    ["1_52"] = 52,  
    ["1_53"] = 53,  
    ["1_54"] = 54,  
    ["1_55"] = 55,  
    ["1_56"] = 56,  
    ["1_57"] = 57,  
    ["1_58"] = 58,  
    ["1_59"] = 59,
}

local __key_map = { 
    bank_id = 1,
    question_id = 2,
    title = 3,
    key_1 = 4,
    key_2 = 5,
    key_3 = 6,
    right_id = 7,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_activity_problems_info")

        return t._raw[__key_map[k]]
    end
}


function activity_problems_info.getLength()
    return #activity_problems_info._data
end



function activity_problems_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_activity_problems_info
function activity_problems_info.indexOf(index)
    if index == nil or not activity_problems_info._data[index] then
        return nil
    end
    return setmetatable({_raw = activity_problems_info._data[index]}, m)
end



---
--@return @class record_activity_problems_info
function activity_problems_info.get(bank_id,question_id)
    
    local k = bank_id .. '_' .. question_id
    return activity_problems_info.indexOf(__index_bank_id_question_id[k])
     
end



function activity_problems_info.set(bank_id,question_id, key, value)
    local record = activity_problems_info.get(bank_id,question_id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function activity_problems_info.get_index_data()
    return __index_bank_id_question_id 
end

return  activity_problems_info 