---@classdef record_activity_shop_info
local record_activity_shop_info = {}


record_activity_shop_info.shop_group = 0--商店组
record_activity_shop_info.id = 0--id
record_activity_shop_info.sign_1 = 0--左侧页签
record_activity_shop_info.sign_1_name =  ""--左侧页签名称
record_activity_shop_info.sign_2 = 0--右侧页签
record_activity_shop_info.sign_2_name =  ""--右侧页签名称
record_activity_shop_info.shop_type = 0--关联的shop类型
record_activity_shop_info.shop_value = 0--关联的页签

local activity_shop_info = {
   _data = {   
    [1] = {901,1,1,"横扫商店",1,"装备",9,1,},  
    [2] = {902,1,1,"横扫商店",1,"装备",9,2,},  
    [3] = {903,1,1,"装备商店",1,"装备",9,3,},  
    [4] = {903,2,2,"神兵商店",1,"神兵",9,4,},  
    [5] = {903,3,3,"神兽装备",1,"神兽",9,5,},  
    [6] = {904,1,1,"装备商店",1,"装备",9,3,},  
    [7] = {904,2,2,"神兵商店",1,"神兵",9,6,},  
    [8] = {904,3,3,"神兽装备",1,"神兽",9,7,},  
    [9] = {905,1,1,"装备商店",1,"装备",9,3,},  
    [10] = {905,2,2,"神兵商店",1,"神兵",9,8,},  
    [11] = {905,3,3,"神兽装备",1,"神兽",9,9,},  
    [12] = {906,1,1,"装备商店",1,"装备",9,3,},  
    [13] = {907,1,1,"装备商店",1,"装备",9,10,},  
    [14] = {907,2,2,"神兵商店",1,"神兵",9,11,},  
    [15] = {907,3,3,"神兽装备",1,"神兽",9,12,},  
    [16] = {1101,1,1,"化身商店",1,"魏国",11,1,},  
    [17] = {1101,2,1,"化身商店",2,"蜀国",11,2,},  
    [18] = {1101,3,1,"化身商店",3,"吴国",11,3,},  
    [19] = {1101,4,1,"化身商店",4,"群雄",11,4,},  
    [20] = {1102,1,1,"化身商店",1,"魏国",11,1,},  
    [21] = {1102,2,1,"化身商店",2,"蜀国",11,2,},  
    [22] = {1102,3,1,"化身商店",3,"吴国",11,3,},  
    [23] = {1102,4,1,"化身商店",4,"群雄",11,4,},  
    [24] = {1102,5,2,"时装商店",1,"时装",11,5,},  
    [25] = {1102,6,3,"变装商店",1,"变装",11,6,},  
    [26] = {1103,1,1,"化身商店",1,"魏国",11,7,},  
    [27] = {1103,2,1,"化身商店",2,"蜀国",11,8,},  
    [28] = {1103,3,1,"化身商店",3,"吴国",11,9,},  
    [29] = {1103,4,1,"化身商店",4,"群雄",11,10,},  
    [30] = {1103,5,2,"时装商店",1,"时装",11,5,},  
    [31] = {1103,6,3,"变装商店",1,"变装",11,6,},  
    [32] = {1104,1,1,"化身商店",1,"魏国",11,11,},  
    [33] = {1104,2,1,"化身商店",2,"蜀国",11,12,},  
    [34] = {1104,3,1,"化身商店",3,"吴国",11,13,},  
    [35] = {1104,4,1,"化身商店",4,"群雄",11,14,},  
    [36] = {1104,5,2,"时装商店",1,"时装",11,5,},  
    [37] = {1104,6,3,"变装商店",1,"变装",11,6,},  
    [38] = {1105,1,1,"化身商店",1,"魏国",11,15,},  
    [39] = {1105,2,1,"化身商店",2,"蜀国",11,16,},  
    [40] = {1105,3,1,"化身商店",3,"吴国",11,17,},  
    [41] = {1105,4,1,"化身商店",4,"群雄",11,18,},  
    [42] = {1105,5,2,"时装商店",1,"时装",11,5,},  
    [43] = {1105,6,3,"变装商店",1,"变装",11,19,},  
    [44] = {1105,7,4,"命星商店",1,"命星",11,20,},  
    [45] = {1106,1,1,"化身商店",1,"魏国",11,15,},  
    [46] = {1106,2,1,"化身商店",2,"蜀国",11,16,},  
    [47] = {1106,3,1,"化身商店",3,"吴国",11,17,},  
    [48] = {1106,4,1,"化身商店",4,"群雄",11,18,},  
    [49] = {1106,5,2,"时装商店",1,"时装",11,5,},  
    [50] = {1106,6,3,"变装商店",1,"变装",11,21,},  
    [51] = {1106,7,4,"命星商店",1,"命星",11,22,},  
    [52] = {1107,2,2,"化身商店",1,"魏国",11,23,},  
    [53] = {1107,3,2,"化身商店",2,"蜀国",11,24,},  
    [54] = {1107,4,2,"化身商店",3,"吴国",11,25,},  
    [55] = {1107,5,2,"化身商店",4,"群雄",11,26,},  
    [56] = {1107,6,3,"时装商店",1,"时装",11,5,},  
    [57] = {1107,7,4,"变装商店",1,"变装",11,21,},  
    [58] = {1107,8,5,"命星商店",1,"命星",11,22,},  
    [59] = {1107,1,1,"通用商店",1,"通用",11,27,},  
    [60] = {1108,2,2,"化身商店",1,"魏国",11,23,},  
    [61] = {1108,3,2,"化身商店",2,"蜀国",11,24,},  
    [62] = {1108,4,2,"化身商店",3,"吴国",11,25,},  
    [63] = {1108,5,2,"化身商店",4,"群雄",11,26,},  
    [64] = {1108,6,3,"时装商店",1,"时装",11,5,},  
    [65] = {1108,7,4,"变装商店",1,"变装",11,29,},  
    [66] = {1108,8,5,"命星商店",1,"命星",11,30,},  
    [67] = {1108,1,1,"通用商店",1,"通用",11,28,},  
    [68] = {1801,1,1,"神兽商店",1,"金色",18,1,},  
    [69] = {1801,2,1,"神兽商店",2,"红色",18,2,},  
    [70] = {1801,3,2,"神兽装备",1,"装备",18,3,},  
    [71] = {1802,1,1,"神兽商店",1,"金色",18,7,},  
    [72] = {1802,2,1,"神兽商店",2,"红色",18,8,},  
    [73] = {1802,3,2,"神兽装备",1,"装备",18,9,},  
    [74] = {1803,1,1,"神兽商店",1,"金色",18,10,},  
    [75] = {1803,2,1,"神兽商店",2,"红色",18,11,},  
    [76] = {1803,3,2,"神兽装备",1,"装备",18,12,},  
    [77] = {1804,1,1,"神兽商店",1,"金色",18,10,},  
    [78] = {1804,2,1,"神兽商店",2,"红色",18,11,},  
    [79] = {1804,3,2,"神兽装备",1,"装备",18,13,},  
    [80] = {1805,1,1,"神兽商店",1,"金色紫金",18,14,},  
    [81] = {1805,2,1,"神兽商店",2,"红色",18,15,},  
    [82] = {1805,3,2,"神兽装备",1,"装备",18,16,},
    }
}

local __index_shop_group_id = {   
    ["901_1"] = 1,  
    ["902_1"] = 2,  
    ["903_1"] = 3,  
    ["903_2"] = 4,  
    ["903_3"] = 5,  
    ["904_1"] = 6,  
    ["904_2"] = 7,  
    ["904_3"] = 8,  
    ["905_1"] = 9,  
    ["905_2"] = 10,  
    ["905_3"] = 11,  
    ["906_1"] = 12,  
    ["907_1"] = 13,  
    ["907_2"] = 14,  
    ["907_3"] = 15,  
    ["1101_1"] = 16,  
    ["1101_2"] = 17,  
    ["1101_3"] = 18,  
    ["1101_4"] = 19,  
    ["1102_1"] = 20,  
    ["1102_2"] = 21,  
    ["1102_3"] = 22,  
    ["1102_4"] = 23,  
    ["1102_5"] = 24,  
    ["1102_6"] = 25,  
    ["1103_1"] = 26,  
    ["1103_2"] = 27,  
    ["1103_3"] = 28,  
    ["1103_4"] = 29,  
    ["1103_5"] = 30,  
    ["1103_6"] = 31,  
    ["1104_1"] = 32,  
    ["1104_2"] = 33,  
    ["1104_3"] = 34,  
    ["1104_4"] = 35,  
    ["1104_5"] = 36,  
    ["1104_6"] = 37,  
    ["1105_1"] = 38,  
    ["1105_2"] = 39,  
    ["1105_3"] = 40,  
    ["1105_4"] = 41,  
    ["1105_5"] = 42,  
    ["1105_6"] = 43,  
    ["1105_7"] = 44,  
    ["1106_1"] = 45,  
    ["1106_2"] = 46,  
    ["1106_3"] = 47,  
    ["1106_4"] = 48,  
    ["1106_5"] = 49,  
    ["1106_6"] = 50,  
    ["1106_7"] = 51,  
    ["1107_2"] = 52,  
    ["1107_3"] = 53,  
    ["1107_4"] = 54,  
    ["1107_5"] = 55,  
    ["1107_6"] = 56,  
    ["1107_7"] = 57,  
    ["1107_8"] = 58,  
    ["1107_1"] = 59,  
    ["1108_2"] = 60,  
    ["1108_3"] = 61,  
    ["1108_4"] = 62,  
    ["1108_5"] = 63,  
    ["1108_6"] = 64,  
    ["1108_7"] = 65,  
    ["1108_8"] = 66,  
    ["1108_1"] = 67,  
    ["1801_1"] = 68,  
    ["1801_2"] = 69,  
    ["1801_3"] = 70,  
    ["1802_1"] = 71,  
    ["1802_2"] = 72,  
    ["1802_3"] = 73,  
    ["1803_1"] = 74,  
    ["1803_2"] = 75,  
    ["1803_3"] = 76,  
    ["1804_1"] = 77,  
    ["1804_2"] = 78,  
    ["1804_3"] = 79,  
    ["1805_1"] = 80,  
    ["1805_2"] = 81,  
    ["1805_3"] = 82,
}

local __key_map = { 
    shop_group = 1,
    id = 2,
    sign_1 = 3,
    sign_1_name = 4,
    sign_2 = 5,
    sign_2_name = 6,
    shop_type = 7,
    shop_value = 8,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_activity_shop_info")

        return t._raw[__key_map[k]]
    end
}


function activity_shop_info.getLength()
    return #activity_shop_info._data
end



function activity_shop_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_activity_shop_info
function activity_shop_info.indexOf(index)
    if index == nil or not activity_shop_info._data[index] then
        return nil
    end
    return setmetatable({_raw = activity_shop_info._data[index]}, m)
end



---
--@return @class record_activity_shop_info
function activity_shop_info.get(shop_group,id)
    
    local k = shop_group .. '_' .. id
    return activity_shop_info.indexOf(__index_shop_group_id[k])
     
end



function activity_shop_info.set(shop_group,id, key, value)
    local record = activity_shop_info.get(shop_group,id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function activity_shop_info.get_index_data()
    return __index_shop_group_id 
end

return  activity_shop_info 