---@classdef record_artifact_info
local record_artifact_info = {}


record_artifact_info.id = 0--ID
record_artifact_info.name =  ""--神器名称
record_artifact_info.quality = 0--品质
record_artifact_info.rare = 0--品质
record_artifact_info.res_id = 0--资源ID
record_artifact_info.advance_code = 0--升阶码
record_artifact_info.fragment_id = 0--碎片id
record_artifact_info.casting_id = 0--铸灵id
record_artifact_info.description =  ""--神器描述
record_artifact_info.star = 0--星级
record_artifact_info.nextstar = 0--下一星级
record_artifact_info.affect_type_1 = 0--属性1
record_artifact_info.affect_value_1 = 0--属性1数值
record_artifact_info.develop_1 = 0--属性1成长
record_artifact_info.affect_type_2 = 0--属性2
record_artifact_info.affect_value_2 = 0--属性2数值
record_artifact_info.develop_2 = 0--属性2成长
record_artifact_info.affect_type_3 = 0--属性3
record_artifact_info.affect_value_3 = 0--属性3数值
record_artifact_info.develop_3 = 0--属性3成长
record_artifact_info.affect_type_4 = 0--属性4
record_artifact_info.affect_value_4 = 0--属性4数值
record_artifact_info.develop_4 = 0--属性4成长
record_artifact_info.affect_type_5 = 0--属性5
record_artifact_info.affect_value_5 = 0--属性5数值
record_artifact_info.develop_5 = 0--属性5成长
record_artifact_info.affect_type_6 = 0--属性6
record_artifact_info.affect_value_6 = 0--属性6数值
record_artifact_info.develop_6 = 0--属性6成长
record_artifact_info.passive_skill_1 = 0--被动技能1
record_artifact_info.passive_skill_2 = 0--被动技能2
record_artifact_info.skill_type = 0--技能类型
record_artifact_info.skill_icon_1 = 0--技能图标1
record_artifact_info.skill_icon_2 = 0--技能图标2
record_artifact_info.talent_skill_1 = 0--天赋技能1
record_artifact_info.talent_skill_2 = 0--天赋技能2
record_artifact_info.talent_skill_3 = 0--天赋技能3
record_artifact_info.talent_skill_4 = 0--天赋技能4
record_artifact_info.talent_skill_5 = 0--天赋技能5
record_artifact_info.talent_skill_6 = 0--天赋技能6
record_artifact_info.talent_skill_7 = 0--天赋技能7
record_artifact_info.put = 0--是否投放
record_artifact_info.skill_description_1 =  ""--技能描述1
record_artifact_info.skill_description_2 =  ""--技能描述2
record_artifact_info.star_description =  ""--天赋描述
record_artifact_info.gm = 0--GM后台是否可发
record_artifact_info.remind_size = 0--GM后台数量提示

local artifact_info = {
   _data = {   
    [1] = {1010,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",0,1011,1,60000,504,2,3000,26,3,3000,26,4,3000,26,0,0,0,0,0,0,100009,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",1,10,},  
    [2] = {1011,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",1,1012,1,100000,811,2,5000,42,3,5000,42,4,5000,42,0,0,0,0,0,0,100010,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [3] = {1012,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",2,1013,1,170000,1458,2,9000,76,3,9000,76,4,9000,76,0,0,0,0,0,0,100011,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [4] = {1013,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",3,1014,1,250000,2107,2,13000,110,3,13000,110,4,13000,110,0,0,0,0,0,0,100012,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [5] = {1014,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",4,1015,1,350000,2948,2,19000,155,3,19000,155,4,19000,155,0,0,0,0,0,0,100013,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [6] = {1015,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",5,1016,1,490000,4057,2,26000,213,3,26000,213,4,26000,213,0,0,0,0,0,0,100014,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [7] = {1016,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",6,1017,1,680000,5656,2,36000,297,3,36000,297,4,36000,297,0,0,0,0,0,0,100015,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [8] = {1017,"定军刀",5,0,1010,1010,21010,0,"名刀定军，刀如其名，军旅中先登将军佩定军刀，每战必身先士卒，冲锋在前，无往而不胜。定军刀后来成为先锋的神兵，在三国时代，猛将黄盖，陈到等人皆有佩定军刀的传统。",7,0,1,950000,7908,2,50000,416,3,50000,416,4,50000,416,0,0,0,0,0,0,100016,0,1,1,0,140108,140109,140110,140111,140112,140113,140114,1,"1","2","1",0,10,},  
    [9] = {1020,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",0,1021,1,30000,231,2,2000,16,3,1000,12,4,1000,12,0,0,0,0,0,0,100001,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",1,10,},  
    [10] = {1021,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",1,1022,1,50000,426,2,4000,30,3,3000,22,4,3000,22,0,0,0,0,0,0,100002,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [11] = {1022,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",2,1023,1,110000,893,2,8000,63,3,6000,47,4,6000,47,0,0,0,0,0,0,100003,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [12] = {1023,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",3,1024,1,170000,1435,2,12000,101,3,9000,75,4,9000,75,0,0,0,0,0,0,100004,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [13] = {1024,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",4,1025,1,250000,2048,2,17000,145,3,13000,107,4,13000,107,0,0,0,0,0,0,100005,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [14] = {1025,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",5,1026,1,350000,2919,2,25000,207,3,18000,153,4,18000,153,0,0,0,0,0,0,100006,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [15] = {1026,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",6,1027,1,500000,4161,2,35000,295,3,26000,219,4,26000,219,0,0,0,0,0,0,100007,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [16] = {1027,"曲燕",4,0,1020,1020,21020,0,"天下十大名弓之一，弓身由坚硬但质量极轻的黑檀木所制，弓弦采用鹿筋结成。古之用弓高手曾以此弓射落飞燕，因此而得名。三国时长沙太守孙坚平叛时得到，赠与其女孙尚香。",7,0,1,710000,3536,2,50000,251,3,37000,186,4,37000,186,0,0,0,0,0,0,100008,0,1,2,0,140101,140102,140103,140104,140105,140106,140107,1,"1","2","1",0,10,},  
    [17] = {2010,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",0,2011,1,270000,2217,2,14000,116,3,14000,116,4,14000,116,0,0,0,0,0,0,100017,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",1,10,},  
    [18] = {2011,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",1,2012,1,340000,2805,2,18000,147,3,18000,147,4,18000,147,0,0,0,0,0,0,100018,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [19] = {2012,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",2,2013,1,440000,3635,2,23000,191,3,23000,191,4,23000,191,0,0,0,0,0,0,100019,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [20] = {2013,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",3,2014,1,560000,4635,2,29000,243,3,29000,243,4,29000,243,0,0,0,0,0,0,100020,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [21] = {2014,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",4,2015,1,710000,5909,2,37000,311,3,37000,311,4,37000,311,0,0,0,0,0,0,100021,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [22] = {2015,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",5,2016,1,920000,7632,2,48000,401,3,48000,401,4,48000,401,0,0,0,0,0,0,100022,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [23] = {2016,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",6,2017,1,1180000,9837,2,62000,517,3,62000,517,4,62000,517,0,0,0,0,0,0,100023,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [24] = {2017,"霸王手戟",6,0,2010,2010,22010,0,"霸王手戟原为古时天子戎器越棘，秦末时落于西楚霸王项羽之手，随项羽征战八方而得名霸王戟。垓下一战，项羽战败，霸王戟折断，刘邦不忍神兵蒙尘，令人将其改为手戟。东汉末年，此戟为曹操麾下猛将典韦的武器，典韦曾以霸王手戟五步之内尽诛敌军，扬名天下",7,0,1,1540000,12850,2,81000,676,3,81000,676,4,81000,676,0,0,0,0,0,0,100024,0,1,3,0,140115,140116,140117,140118,140119,140120,140121,1,"1","2","1",0,10,},  
    [25] = {2020,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",0,2021,1,240000,2039,2,17000,144,3,13000,107,4,13000,107,0,0,0,0,0,0,100025,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",1,10,},  
    [26] = {2021,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",1,2022,1,310000,2579,2,22000,183,3,16000,135,4,16000,135,0,0,0,0,0,0,100026,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [27] = {2022,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",2,2023,1,400000,3342,2,29000,237,3,21000,175,4,21000,175,0,0,0,0,0,0,100027,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [28] = {2023,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",3,2024,1,510000,4262,2,36000,302,3,27000,224,4,27000,224,0,0,0,0,0,0,100028,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [29] = {2024,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",4,2025,1,650000,5434,2,46000,386,3,34000,286,4,34000,286,0,0,0,0,0,0,100029,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [30] = {2025,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",5,2026,1,840000,7018,2,60000,498,3,44000,369,4,44000,369,0,0,0,0,0,0,100030,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [31] = {2026,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",6,2027,1,1090000,9046,2,77000,642,3,57000,476,4,57000,476,0,0,0,0,0,0,100031,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [32] = {2027,"松纹古锭刀",6,0,2020,2020,22020,0,"松纹古锭刀，相传刀身淬火时发生异变，通体血红色而得名。刀头以猛虎作为装饰。在三国时代是江东猛虎孙坚的佩刀。孙坚曾以此刀讨虏荡寇。孙坚战死后，名刀流落民间，机缘巧合下被关羽所得。关羽败走麦城后，这把神兵重归江东所有。",7,0,1,1420000,11816,2,101000,839,3,75000,621,4,75000,621,0,0,0,0,0,0,100032,0,1,4,0,140122,140123,140124,140125,140126,140127,140128,1,"1","2","1",0,10,},  
    [33] = {2030,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",0,2031,1,270000,2217,2,14000,116,3,14000,116,4,14000,116,0,0,0,0,0,0,100033,100041,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",1,10,},  
    [34] = {2031,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",1,2032,1,340000,2805,2,18000,147,3,18000,147,4,18000,147,0,0,0,0,0,0,100034,100042,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [35] = {2032,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",2,2033,1,440000,3635,2,23000,191,3,23000,191,4,23000,191,0,0,0,0,0,0,100035,100043,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [36] = {2033,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",3,2034,1,560000,4635,2,29000,243,3,29000,243,4,29000,243,0,0,0,0,0,0,100036,100044,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [37] = {2034,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",4,2035,1,710000,5909,2,37000,311,3,37000,311,4,37000,311,0,0,0,0,0,0,100037,100045,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [38] = {2035,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",5,2036,1,920000,7632,2,48000,401,3,48000,401,4,48000,401,0,0,0,0,0,0,100038,100046,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [39] = {2036,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",6,2037,1,1180000,9837,2,62000,517,3,62000,517,4,62000,517,0,0,0,0,0,0,100039,100047,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [40] = {2037,"雌雄双股剑",6,0,2030,2030,22030,0,"天下神兵之一，通体玄铁打造，相传打造此对宝剑时，天地生变，九霄之上有真龙下凡附于剑中。此宝剑蕴含天地玄妙，身具帝王之姿之人拥有此剑，出鞘即有龙鸣之音。三国时代是蜀汉开国皇帝刘备的配剑，陪他征战一生。",7,0,1,1540000,12850,2,81000,676,3,81000,676,4,81000,676,0,0,0,0,0,0,100040,100048,2,5,0,140143,140144,140145,140146,140147,140148,140149,1,"1","2","1",0,10,},  
    [41] = {2040,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",0,2041,1,240000,2039,2,17000,144,3,13000,107,4,13000,107,0,0,0,0,0,0,100049,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",1,10,},  
    [42] = {2041,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",1,2042,1,310000,2579,2,22000,183,3,16000,135,4,16000,135,0,0,0,0,0,0,100050,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [43] = {2042,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",2,2043,1,400000,3342,2,29000,237,3,21000,175,4,21000,175,0,0,0,0,0,0,100051,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [44] = {2043,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",3,2044,1,510000,4262,2,36000,302,3,27000,224,4,27000,224,0,0,0,0,0,0,100052,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [45] = {2044,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",4,2045,1,650000,5434,2,46000,386,3,34000,286,4,34000,286,0,0,0,0,0,0,100053,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [46] = {2045,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",5,2046,1,840000,7018,2,60000,498,3,44000,369,4,44000,369,0,0,0,0,0,0,100054,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [47] = {2046,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",6,2047,1,1090000,9046,2,77000,642,3,57000,476,4,57000,476,0,0,0,0,0,0,100055,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [48] = {2047,"诸葛连弩",6,0,2040,2040,22040,0,"天下神兵之一，又称元戎弩，为蜀汉丞相诸葛亮发明的机关强弩。诸葛连弩以铁为矢，矢长八寸，可以一次发射十支弩箭，因此而得名。有膂力过人的强者按诸葛连弩之法，制作了重弩，以此神兵，横行天下。",7,0,1,1420000,11816,2,101000,839,3,75000,621,4,75000,621,0,0,0,0,0,0,100056,0,1,6,0,140136,140137,140138,140139,140140,140141,140142,1,"1","2","1",0,10,},  
    [49] = {2050,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",0,2051,1,270000,2217,2,14000,116,3,14000,116,4,14000,116,0,0,0,0,0,0,100057,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",1,10,},  
    [50] = {2051,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",1,2052,1,340000,2805,2,18000,147,3,18000,147,4,18000,147,0,0,0,0,0,0,100058,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [51] = {2052,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",2,2053,1,440000,3635,2,23000,191,3,23000,191,4,23000,191,0,0,0,0,0,0,100059,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [52] = {2053,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",3,2054,1,560000,4635,2,29000,243,3,29000,243,4,29000,243,0,0,0,0,0,0,100060,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [53] = {2054,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",4,2055,1,710000,5909,2,37000,311,3,37000,311,4,37000,311,0,0,0,0,0,0,100061,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [54] = {2055,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",5,2056,1,920000,7632,2,48000,401,3,48000,401,4,48000,401,0,0,0,0,0,0,100062,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [55] = {2056,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",6,2057,1,1180000,9837,2,62000,517,3,62000,517,4,62000,517,0,0,0,0,0,0,100063,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [56] = {2057,"墨羽扇",6,0,2050,2050,22050,0,"墨羽扇，道家仙人曾以道法改造此扇，使其内含八卦之力，周易之理，乾坤阴阳之道，挥动间可呼风唤雨，令风云为之变色。因其威胁过大，南华老仙有意将其带离世间，但他的小徒弟于吉偷偷将墨羽扇盗走，并把消息透露给三国的英豪，企图引发一场腥风血雨。",7,0,1,1540000,12850,2,81000,676,3,81000,676,4,81000,676,0,0,0,0,0,0,100064,0,1,7,0,140129,140130,140131,140132,140133,140134,140135,1,"1","2","1",0,10,},  
    [57] = {2060,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",0,2061,1,240000,2039,2,17000,144,3,13000,107,4,13000,107,0,0,0,0,0,0,100065,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",1,10,},  
    [58] = {2061,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",1,2062,1,310000,2579,2,22000,183,3,16000,135,4,16000,135,0,0,0,0,0,0,100066,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [59] = {2062,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",2,2063,1,400000,3342,2,29000,237,3,21000,175,4,21000,175,0,0,0,0,0,0,100067,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [60] = {2063,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",3,2064,1,510000,4262,2,36000,302,3,27000,224,4,27000,224,0,0,0,0,0,0,100068,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [61] = {2064,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",4,2065,1,650000,5434,2,46000,386,3,34000,286,4,34000,286,0,0,0,0,0,0,100069,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [62] = {2065,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",5,2066,1,840000,7018,2,60000,498,3,44000,369,4,44000,369,0,0,0,0,0,0,100070,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [63] = {2066,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",6,2067,1,1090000,9046,2,77000,642,3,57000,476,4,57000,476,0,0,0,0,0,0,100071,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [64] = {2067,"火云剑",6,0,2060,2060,22060,0,"天下神兵之一，凝练天地精华，内藏火云之力。火云剑并非常规兵刃，其通体赤红，隐约可见火焰环绕。火云剑挥舞间可生出火焰千重，席卷敌人。相传三国时为东吴陆逊的佩剑，陆逊以此剑在夷陵火烧刘备七百里连营，拯救了东吴。",7,0,1,1420000,11816,2,101000,839,3,75000,621,4,75000,621,0,0,0,0,0,0,100072,0,1,8,0,140150,140151,140152,140153,140154,140155,140156,1,"1","2","1",0,10,},  
    [65] = {3010,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",0,3011,1,560000,4634,2,40000,329,3,29000,243,4,29000,243,0,0,0,0,0,0,100089,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",1,10,},  
    [66] = {3011,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",1,3012,1,670000,5542,2,47000,393,3,35000,291,4,35000,291,0,0,0,0,0,0,100090,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [67] = {3012,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",2,3013,1,820000,6792,2,58000,482,3,43000,357,4,43000,357,0,0,0,0,0,0,100091,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [68] = {3013,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",3,3014,1,1000000,8324,2,71000,591,3,53000,438,4,53000,438,0,0,0,0,0,0,100092,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [69] = {3014,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",4,3015,1,1240000,10362,2,88000,736,3,65000,545,4,65000,545,0,0,0,0,0,0,100093,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [70] = {3015,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",5,3016,1,1580000,13192,2,112000,937,3,83000,694,4,83000,694,0,0,0,0,0,0,100094,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [71] = {3016,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",6,3017,1,2020000,16843,2,144000,1196,3,106000,886,4,106000,886,0,0,0,0,0,0,100095,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [72] = {3017,"丈八蛇矛",7,0,3010,3010,23010,2001,"天下神兵之一，通体由镔铁点钢打造而成，矛杆长一丈，矛尖长八寸，刃开双锋，作游蛇吐信状，故号丈八蛇矛。在古代，丈八蛇矛一向是冲锋陷阵的猛将手中的利器，挑敌破甲，披荆斩棘，无往而不利。拥有此神兵者，必将成为战场上的万人敌，所向披靡。",7,0,1,2620000,21865,2,186000,1553,3,138000,1150,4,138000,1150,0,0,0,0,0,0,100096,0,1,9,0,140171,140172,140173,140174,140175,140176,140177,1,"1","2","1",0,10,},  
    [73] = {3020,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",0,3021,1,560000,4634,2,40000,329,3,29000,243,4,29000,243,0,0,0,0,0,0,100081,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",1,10,},  
    [74] = {3021,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",1,3022,1,670000,5542,2,47000,393,3,35000,291,4,35000,291,0,0,0,0,0,0,100082,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [75] = {3022,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",2,3023,1,820000,6792,2,58000,482,3,43000,357,4,43000,357,0,0,0,0,0,0,100083,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [76] = {3023,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",3,3024,1,1000000,8324,2,71000,591,3,53000,438,4,53000,438,0,0,0,0,0,0,100084,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [77] = {3024,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",4,3025,1,1240000,10362,2,88000,736,3,65000,545,4,65000,545,0,0,0,0,0,0,100085,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [78] = {3025,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",5,3026,1,1580000,13192,2,112000,937,3,83000,694,4,83000,694,0,0,0,0,0,0,100086,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [79] = {3026,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",6,3027,1,2020000,16843,2,144000,1196,3,106000,886,4,106000,886,0,0,0,0,0,0,100087,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [80] = {3027,"龙胆亮银枪",7,0,3020,3020,23020,2002,"天下十大名枪之首，又名涯角枪，取天涯海角之意。通体由镔铁打造。相传打造此枪时，蛟龙出海，用力士擒蛟龙取其胆，淬炼入枪中，号曰龙胆枪。三国时代为名将赵云的武器。赵子龙凭此一杆龙胆亮银枪单枪匹马，创造出无数的神话。",7,0,1,2620000,21865,2,186000,1553,3,138000,1150,4,138000,1150,0,0,0,0,0,0,100088,0,1,10,0,140164,140165,140166,140167,140168,140169,140170,1,"1","2","1",0,10,},  
    [81] = {3030,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",0,3031,1,560000,4634,2,40000,329,3,29000,243,4,29000,243,0,0,0,0,0,0,100113,100121,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",1,10,},  
    [82] = {3031,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",1,3032,1,670000,5542,2,47000,393,3,35000,291,4,35000,291,0,0,0,0,0,0,100114,100122,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [83] = {3032,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",2,3033,1,820000,6792,2,58000,482,3,43000,357,4,43000,357,0,0,0,0,0,0,100115,100123,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [84] = {3033,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",3,3034,1,1000000,8324,2,71000,591,3,53000,438,4,53000,438,0,0,0,0,0,0,100116,100124,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [85] = {3034,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",4,3035,1,1240000,10362,2,88000,736,3,65000,545,4,65000,545,0,0,0,0,0,0,100117,100125,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [86] = {3035,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",5,3036,1,1580000,13192,2,112000,937,3,83000,694,4,83000,694,0,0,0,0,0,0,100118,100126,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [87] = {3036,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",6,3037,1,2020000,16843,2,144000,1196,3,106000,886,4,106000,886,0,0,0,0,0,0,100119,100127,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [88] = {3037,"青釭剑",7,0,3030,3030,23030,2003,"天下神兵之一，相传由春秋时期的大铸剑师打造，与倚天并称绝世双剑，刃如秋霜，削铁如泥。出鞘时总有青芒闪过，因此而得名。青釭剑在天下太平时总是不知所踪，每逢乱世，便出现在乱世枭雄手中，得青釭剑者，势必在乱世兴起风浪。",7,0,1,2620000,21865,2,186000,1553,3,138000,1150,4,138000,1150,0,0,0,0,0,0,100120,100128,2,23,0,140185,140186,140187,140188,140189,140190,140191,1,"1","2","1",0,10,},  
    [89] = {3040,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",0,3041,1,960000,10080,2,52000,530,3,52000,530,4,52000,530,0,0,0,0,0,0,100129,100137,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",1,10,},  
    [90] = {3041,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",1,3042,1,1160000,12054,2,61000,634,3,61000,634,4,61000,634,0,0,0,0,0,0,100130,100138,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [91] = {3042,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",2,3043,1,1430000,14774,2,76000,776,3,76000,776,4,76000,776,0,0,0,0,0,0,100131,100139,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [92] = {3043,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",3,3044,1,1750000,18104,2,92000,952,3,92000,952,4,92000,952,0,0,0,0,0,0,100132,100140,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [93] = {3044,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",4,3045,1,2160000,22538,2,114000,1186,3,114000,1186,4,114000,1186,0,0,0,0,0,0,100133,100141,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [94] = {3045,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",5,3046,1,2760000,28694,2,146000,1510,3,146000,1510,4,146000,1510,0,0,0,0,0,0,100134,100142,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [95] = {3046,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",6,3047,1,3520000,36634,2,186000,1928,3,186000,1928,4,186000,1928,0,0,0,0,0,0,100135,100143,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [96] = {3047,"七星宝刀",7,1,3040,3040,23040,2004,"天下神兵之一，由天外陨铁打造，刀身上自然形成七颗烙印，就像是在凝聚北斗七星之力。刀出鞘时，伴随夺目之光，心神不正之人会掩面而倒。故而此刀也被称为诛邪之刀，身负天下大义者持之，诛邪讨逆，匡扶社稷。",7,0,1,4560000,47556,2,240000,2502,3,240000,2502,4,240000,2502,0,0,0,0,0,0,100136,100144,2,1135,0,140192,140193,140194,140195,140196,140197,140198,1,"1","2","1",0,10,},  
    [97] = {3050,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",0,3051,1,600000,5040,2,32000,265,3,32000,265,4,32000,265,0,0,0,0,0,0,100097,100105,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",1,10,},  
    [98] = {3051,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",1,3052,1,720000,6027,2,38000,317,3,38000,317,4,38000,317,0,0,0,0,0,0,100098,100106,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [99] = {3052,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",2,3053,1,890000,7387,2,47000,388,3,47000,388,4,47000,388,0,0,0,0,0,0,100099,100107,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [100] = {3053,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",3,3054,1,1090000,9052,2,57000,476,3,57000,476,4,57000,476,0,0,0,0,0,0,100100,100108,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [101] = {3054,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",4,3055,1,1350000,11269,2,71000,593,3,71000,593,4,71000,593,0,0,0,0,0,0,100101,100109,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [102] = {3055,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",5,3056,1,1720000,14347,2,91000,755,3,91000,755,4,91000,755,0,0,0,0,0,0,100102,100110,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [103] = {3056,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",6,3057,1,2200000,18317,2,116000,964,3,116000,964,4,116000,964,0,0,0,0,0,0,100103,100111,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [104] = {3057,"闭月团扇",7,0,3050,3050,23050,2005,"天下神兵之一，团扇由蜀锦所制，而闭月团扇所用蜀锦集天地之精华，传说可以千年不腐。团扇本不是武器，但传说中的闭月团扇若在闭月羞花的美人之手，便可让天地黯淡，更可迷惑人的心智，让人做出不是出自本心之举。",7,0,1,2850000,23778,2,150000,1251,3,150000,1251,4,150000,1251,0,0,0,0,0,0,100104,100112,2,13,0,140178,140179,140180,140181,140182,140183,140184,1,"1","2","1",0,10,},  
    [105] = {3060,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",0,3061,1,600000,5040,2,32000,265,3,32000,265,4,32000,265,0,0,0,0,0,0,100073,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",1,10,},  
    [106] = {3061,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",1,3062,1,720000,6027,2,38000,317,3,38000,317,4,38000,317,0,0,0,0,0,0,100074,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},  
    [107] = {3062,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",2,3063,1,890000,7387,2,47000,388,3,47000,388,4,47000,388,0,0,0,0,0,0,100075,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},  
    [108] = {3063,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",3,3064,1,1090000,9052,2,57000,476,3,57000,476,4,57000,476,0,0,0,0,0,0,100076,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},  
    [109] = {3064,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",4,3065,1,1350000,11269,2,71000,593,3,71000,593,4,71000,593,0,0,0,0,0,0,100077,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},  
    [110] = {3065,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",5,3066,1,1720000,14347,2,91000,755,3,91000,755,4,91000,755,0,0,0,0,0,0,100078,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},  
    [111] = {3066,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",6,3067,1,2200000,18317,2,116000,964,3,116000,964,4,116000,964,0,0,0,0,0,0,100079,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},  
    [112] = {3067,"苍叶绿绮琴",7,0,3060,3060,23060,2006,"古时的名琴，相传绿绮通体黑色，隐隐泛着幽绿，有如绿色藤蔓缠绕于古木之上，因而名为绿绮。最初由汉代的名士司马相如所有，司马相如精湛的琴艺与绿绮相得益彰，演奏的音乐竟有摄人心魄的能力。",7,0,1,2850000,23778,2,150000,1251,3,150000,1251,4,150000,1251,0,0,0,0,0,0,100080,0,1,14,0,140157,140158,140159,140160,140161,140162,140163,1,"1","2","1",0,10,},
    }
}

local __index_id = {   
    [1010] = 1,  
    [1011] = 2,  
    [1012] = 3,  
    [1013] = 4,  
    [1014] = 5,  
    [1015] = 6,  
    [1016] = 7,  
    [1017] = 8,  
    [1020] = 9,  
    [1021] = 10,  
    [1022] = 11,  
    [1023] = 12,  
    [1024] = 13,  
    [1025] = 14,  
    [1026] = 15,  
    [1027] = 16,  
    [2010] = 17,  
    [2011] = 18,  
    [2012] = 19,  
    [2013] = 20,  
    [2014] = 21,  
    [2015] = 22,  
    [2016] = 23,  
    [2017] = 24,  
    [2020] = 25,  
    [2021] = 26,  
    [2022] = 27,  
    [2023] = 28,  
    [2024] = 29,  
    [2025] = 30,  
    [2026] = 31,  
    [2027] = 32,  
    [2030] = 33,  
    [2031] = 34,  
    [2032] = 35,  
    [2033] = 36,  
    [2034] = 37,  
    [2035] = 38,  
    [2036] = 39,  
    [2037] = 40,  
    [2040] = 41,  
    [2041] = 42,  
    [2042] = 43,  
    [2043] = 44,  
    [2044] = 45,  
    [2045] = 46,  
    [2046] = 47,  
    [2047] = 48,  
    [2050] = 49,  
    [2051] = 50,  
    [2052] = 51,  
    [2053] = 52,  
    [2054] = 53,  
    [2055] = 54,  
    [2056] = 55,  
    [2057] = 56,  
    [2060] = 57,  
    [2061] = 58,  
    [2062] = 59,  
    [2063] = 60,  
    [2064] = 61,  
    [2065] = 62,  
    [2066] = 63,  
    [2067] = 64,  
    [3010] = 65,  
    [3011] = 66,  
    [3012] = 67,  
    [3013] = 68,  
    [3014] = 69,  
    [3015] = 70,  
    [3016] = 71,  
    [3017] = 72,  
    [3020] = 73,  
    [3021] = 74,  
    [3022] = 75,  
    [3023] = 76,  
    [3024] = 77,  
    [3025] = 78,  
    [3026] = 79,  
    [3027] = 80,  
    [3030] = 81,  
    [3031] = 82,  
    [3032] = 83,  
    [3033] = 84,  
    [3034] = 85,  
    [3035] = 86,  
    [3036] = 87,  
    [3037] = 88,  
    [3040] = 89,  
    [3041] = 90,  
    [3042] = 91,  
    [3043] = 92,  
    [3044] = 93,  
    [3045] = 94,  
    [3046] = 95,  
    [3047] = 96,  
    [3050] = 97,  
    [3051] = 98,  
    [3052] = 99,  
    [3053] = 100,  
    [3054] = 101,  
    [3055] = 102,  
    [3056] = 103,  
    [3057] = 104,  
    [3060] = 105,  
    [3061] = 106,  
    [3062] = 107,  
    [3063] = 108,  
    [3064] = 109,  
    [3065] = 110,  
    [3066] = 111,  
    [3067] = 112,
}

local __key_map = { 
    id = 1,
    name = 2,
    quality = 3,
    rare = 4,
    res_id = 5,
    advance_code = 6,
    fragment_id = 7,
    casting_id = 8,
    description = 9,
    star = 10,
    nextstar = 11,
    affect_type_1 = 12,
    affect_value_1 = 13,
    develop_1 = 14,
    affect_type_2 = 15,
    affect_value_2 = 16,
    develop_2 = 17,
    affect_type_3 = 18,
    affect_value_3 = 19,
    develop_3 = 20,
    affect_type_4 = 21,
    affect_value_4 = 22,
    develop_4 = 23,
    affect_type_5 = 24,
    affect_value_5 = 25,
    develop_5 = 26,
    affect_type_6 = 27,
    affect_value_6 = 28,
    develop_6 = 29,
    passive_skill_1 = 30,
    passive_skill_2 = 31,
    skill_type = 32,
    skill_icon_1 = 33,
    skill_icon_2 = 34,
    talent_skill_1 = 35,
    talent_skill_2 = 36,
    talent_skill_3 = 37,
    talent_skill_4 = 38,
    talent_skill_5 = 39,
    talent_skill_6 = 40,
    talent_skill_7 = 41,
    put = 42,
    skill_description_1 = 43,
    skill_description_2 = 44,
    star_description = 45,
    gm = 46,
    remind_size = 47,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_artifact_info")

        return t._raw[__key_map[k]]
    end
}


function artifact_info.getLength()
    return #artifact_info._data
end



function artifact_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_artifact_info
function artifact_info.indexOf(index)
    if index == nil or not artifact_info._data[index] then
        return nil
    end
    return setmetatable({_raw = artifact_info._data[index]}, m)
end



---
--@return @class record_artifact_info
function artifact_info.get(id)
    
    return artifact_info.indexOf(__index_id[ id ])
     
end



function artifact_info.set(id, key, value)
    local record = artifact_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function artifact_info.get_index_data()
    return __index_id 
end

return  artifact_info 