---@classdef record_awake_task_info
local record_awake_task_info = {}


record_awake_task_info.id = 0--id
record_awake_task_info.task_order = 0--任务顺序
record_awake_task_info.task_name =  ""--任务名称
record_awake_task_info.task_desc =  ""--任务描述
record_awake_task_info.task_type = 0--任务类型
record_awake_task_info.task_value = 0--任务类型值
record_awake_task_info.task_process = 0--任务进度值
record_awake_task_info.route_id = 0--跳转
record_awake_task_info.process_type = 0--进度类型

local awake_task_info = {
   _data = {   
    [1] = {1001,1,"觉醒任务一","【觉醒1/3】挑战主线第80章第10关一次",1113,25640,1,10632,1,},  
    [2] = {1001,2,"觉醒任务二","【觉醒2/3】无双试炼挑战220次",1027,220,220,17,0,},  
    [3] = {1001,3,"觉醒任务三","【觉醒3/3】高级招将10次",1041,10,10,3,0,},  
    [4] = {1002,1,"觉醒任务一","【觉醒1/3】挑战马超传-功亏一篑1次",1112,21006,1,80065,1,},  
    [5] = {1002,2,"觉醒任务二","【觉醒2/3】挑战秘境神兽4次",1106,4,4,214,0,},  
    [6] = {1002,3,"觉醒任务三","【觉醒3/3】讨伐巨兽消耗次数20次",1030,20,20,20,0,},  
    [7] = {1003,1,"觉醒任务一","【觉醒1/3】挑战郭嘉传-破城1次",1112,7006,1,80022,1,},  
    [8] = {1003,2,"觉醒任务二","【觉醒2/3】激斗神将中挑战5次",1098,5,5,171,0,},  
    [9] = {1003,3,"觉醒任务三","【觉醒3/3】竞技场挑战100次",1001,100,100,10,0,},  
    [10] = {1004,1,"觉醒任务一","【觉醒1/3】挑战典韦传-击败张绣1次",1112,18005,1,80055,1,},  
    [11] = {1004,2,"觉醒任务二","【觉醒2/3】挑战秘境神兽4次",1106,4,4,214,0,},  
    [12] = {1004,3,"觉醒任务三","【觉醒3/3】讨伐巨兽消耗次数20次",1030,20,20,20,0,},  
    [13] = {1005,1,"觉醒任务一","【觉醒1/3】挑战刘备传-不打不相识1次",1112,1004,1,80001,1,},  
    [14] = {1005,2,"觉醒任务二","【觉醒2/3】激斗神将中挑战5次",1098,5,5,171,0,},  
    [15] = {1005,3,"觉醒任务三","【觉醒3/3】竞技场挑战100次",1001,100,100,10,0,},  
    [16] = {1006,1,"觉醒任务一","【觉醒1/3】挑战陆逊传-扬名天下1次",1112,24008,1,80076,1,},  
    [17] = {1006,2,"觉醒任务二","【觉醒2/3】激斗神将中挑战5次",1098,5,5,171,0,},  
    [18] = {1006,3,"觉醒任务三","【觉醒3/3】竞技场挑战100次",1001,100,100,10,0,},  
    [19] = {1007,1,"觉醒任务一","【觉醒1/3】挑战周瑜传-打败刘勋1次",1112,6007,1,80019,1,},  
    [20] = {1007,2,"觉醒任务二","【觉醒2/3】挑战秘境神兽4次",1106,4,4,214,0,},  
    [21] = {1007,3,"觉醒任务三","【觉醒3/3】讨伐巨兽消耗次数20次",1030,20,20,20,0,},  
    [22] = {1008,1,"觉醒任务一","【觉醒1/3】挑战贾诩传-王允落幕1次",1112,32006,1,80101,1,},  
    [23] = {1008,2,"觉醒任务二","【觉醒2/3】激斗神将中挑战5次",1098,5,5,171,0,},  
    [24] = {1008,3,"觉醒任务三","【觉醒3/3】竞技场挑战100次",1001,100,100,10,0,},  
    [25] = {1009,1,"觉醒任务一","【觉醒1/3】挑战貂蝉传-对酒1次",1112,12006,1,80038,1,},  
    [26] = {1009,2,"觉醒任务二","【觉醒2/3】挑战秘境神兽4次",1106,4,4,214,0,},  
    [27] = {1009,3,"觉醒任务三","【觉醒3/3】讨伐巨兽消耗次数20次",1075,20,20,20,0,},  
    [28] = {1010,1,"觉醒任务一","【觉醒1/3】挑战司马懿传-事端多生1次",1112,46005,1,80144,1,},  
    [29] = {1010,2,"觉醒任务二","【觉醒2/3】决战定军山中战斗8次",1108,8,8,223,0,},  
    [30] = {1010,3,"觉醒任务三","【觉醒3/3】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [31] = {1011,1,"觉醒任务一","【觉醒1/3】挑战诸葛亮传-打退曹军1次",1112,27007,1,80086,1,},  
    [32] = {1011,2,"觉醒任务二","【觉醒2/3】列传战役战斗8次",1024,8,8,12,0,},  
    [33] = {1011,3,"觉醒任务三","【觉醒3/3】过关斩将战斗50次",1093,50,50,162,0,},  
    [34] = {1012,1,"觉醒任务一","【觉醒1/3】挑战孙策传-为父报仇1次",1112,5006,1,80015,1,},  
    [35] = {1012,2,"觉醒任务二","【觉醒2/3】列传战役战斗8次",1024,8,8,12,0,},  
    [36] = {1012,3,"觉醒任务三","【觉醒3/3】过关斩将战斗50次",1093,50,50,162,0,},  
    [37] = {1013,1,"觉醒任务一","【觉醒1/3】挑战张角传-草莽英雄1次",1112,28006,1,80089,1,},  
    [38] = {1013,2,"觉醒任务二","【觉醒2/3】决战定军山中战斗8次",1108,8,8,223,0,},  
    [39] = {1013,3,"觉醒任务三","【觉醒3/3】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [40] = {1014,1,"觉醒任务一","【觉醒1/2】决战定军山中战斗8次",1108,8,8,223,0,},  
    [41] = {1014,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [42] = {1015,1,"觉醒任务一","【觉醒1/2】决战定军山中战斗8次",1108,8,8,223,0,},  
    [43] = {1015,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [44] = {1016,1,"觉醒任务一","【觉醒1/2】列传战役战斗8次",1024,8,8,12,0,},  
    [45] = {1016,2,"觉醒任务二","【觉醒2/2】过关斩将战斗50次",1093,50,50,162,0,},  
    [46] = {1017,1,"觉醒任务一","【觉醒1/2】列传战役战斗8次",1024,8,8,12,0,},  
    [47] = {1017,2,"觉醒任务二","【觉醒2/2】过关斩将战斗50次",1093,50,50,162,0,},  
    [48] = {1018,1,"觉醒任务一","【觉醒1/3】挑战曹操传-刺杀1次",1112,13006,1,80040,1,},  
    [49] = {1018,2,"觉醒任务二","【觉醒2/3】无双试炼挑战220次",1027,220,220,17,0,},  
    [50] = {1018,3,"觉醒任务三","【觉醒3/3】军团副本挑战30次",1012,30,30,16,0,},  
    [51] = {1019,1,"觉醒任务一","【觉醒1/3】挑战关羽传-大战夏侯惇1次",1112,42007,1,80132,1,},  
    [52] = {1019,2,"觉醒任务二","【觉醒2/3】无双试炼挑战220次",1027,220,220,17,0,},  
    [53] = {1019,3,"觉醒任务三","【觉醒3/3】军团副本挑战30次",1012,30,30,16,0,},  
    [54] = {1020,1,"觉醒任务一","【觉醒1/3】挑战周瑜传-新老之争1次",1112,6002,1,80016,1,},  
    [55] = {1020,2,"觉醒任务二","【觉醒2/3】无双试炼挑战220次",1027,220,220,17,0,},  
    [56] = {1020,3,"觉醒任务三","【觉醒3/3】军团副本挑战30次",1012,30,30,16,0,},  
    [57] = {1021,1,"觉醒任务一","【觉醒1/3】挑战吕布传-战三英1次",1112,17007,1,80052,1,},  
    [58] = {1021,2,"觉醒任务二","【觉醒2/3】无双试炼挑战220次",1027,220,220,17,0,},  
    [59] = {1021,3,"觉醒任务三","【觉醒3/3】军团副本挑战30次",1012,30,30,16,0,},  
    [60] = {1022,1,"觉醒任务一","【觉醒1/2】挑战秘境神兽4次",1106,4,4,214,0,},  
    [61] = {1022,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [62] = {1023,1,"觉醒任务一","【觉醒1/2】挑战秘境神兽4次",1106,4,4,214,0,},  
    [63] = {1023,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [64] = {1024,1,"觉醒任务一","【觉醒1/2】挑战秘境神兽4次",1106,4,4,214,0,},  
    [65] = {1024,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [66] = {1025,1,"觉醒任务一","【觉醒1/2】挑战秘境神兽4次",1106,4,4,214,0,},  
    [67] = {1025,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},  
    [68] = {1026,1,"觉醒任务一","【觉醒1/3】挑战周瑜传-打败刘勋1次",1112,6007,1,80019,1,},  
    [69] = {1026,2,"觉醒任务二","【觉醒2/3】挑战秘境神兽4次",1106,4,4,214,0,},  
    [70] = {1026,3,"觉醒任务三","【觉醒3/3】讨伐巨兽消耗次数20次",1030,20,20,20,0,},  
    [71] = {1027,1,"觉醒任务一","【觉醒1/2】决战定军山中战斗8次",1108,8,8,223,0,},  
    [72] = {1027,2,"觉醒任务二","【觉醒2/2】秘境寻宝中抢夺100次",1005,100,100,19,0,},
    }
}

local __index_id_task_order = {   
    ["1001_1"] = 1,  
    ["1001_2"] = 2,  
    ["1001_3"] = 3,  
    ["1002_1"] = 4,  
    ["1002_2"] = 5,  
    ["1002_3"] = 6,  
    ["1003_1"] = 7,  
    ["1003_2"] = 8,  
    ["1003_3"] = 9,  
    ["1004_1"] = 10,  
    ["1004_2"] = 11,  
    ["1004_3"] = 12,  
    ["1005_1"] = 13,  
    ["1005_2"] = 14,  
    ["1005_3"] = 15,  
    ["1006_1"] = 16,  
    ["1006_2"] = 17,  
    ["1006_3"] = 18,  
    ["1007_1"] = 19,  
    ["1007_2"] = 20,  
    ["1007_3"] = 21,  
    ["1008_1"] = 22,  
    ["1008_2"] = 23,  
    ["1008_3"] = 24,  
    ["1009_1"] = 25,  
    ["1009_2"] = 26,  
    ["1009_3"] = 27,  
    ["1010_1"] = 28,  
    ["1010_2"] = 29,  
    ["1010_3"] = 30,  
    ["1011_1"] = 31,  
    ["1011_2"] = 32,  
    ["1011_3"] = 33,  
    ["1012_1"] = 34,  
    ["1012_2"] = 35,  
    ["1012_3"] = 36,  
    ["1013_1"] = 37,  
    ["1013_2"] = 38,  
    ["1013_3"] = 39,  
    ["1014_1"] = 40,  
    ["1014_2"] = 41,  
    ["1015_1"] = 42,  
    ["1015_2"] = 43,  
    ["1016_1"] = 44,  
    ["1016_2"] = 45,  
    ["1017_1"] = 46,  
    ["1017_2"] = 47,  
    ["1018_1"] = 48,  
    ["1018_2"] = 49,  
    ["1018_3"] = 50,  
    ["1019_1"] = 51,  
    ["1019_2"] = 52,  
    ["1019_3"] = 53,  
    ["1020_1"] = 54,  
    ["1020_2"] = 55,  
    ["1020_3"] = 56,  
    ["1021_1"] = 57,  
    ["1021_2"] = 58,  
    ["1021_3"] = 59,  
    ["1022_1"] = 60,  
    ["1022_2"] = 61,  
    ["1023_1"] = 62,  
    ["1023_2"] = 63,  
    ["1024_1"] = 64,  
    ["1024_2"] = 65,  
    ["1025_1"] = 66,  
    ["1025_2"] = 67,  
    ["1026_1"] = 68,  
    ["1026_2"] = 69,  
    ["1026_3"] = 70,  
    ["1027_1"] = 71,  
    ["1027_2"] = 72,
}

local __key_map = { 
    id = 1,
    task_order = 2,
    task_name = 3,
    task_desc = 4,
    task_type = 5,
    task_value = 6,
    task_process = 7,
    route_id = 8,
    process_type = 9,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_awake_task_info")

        return t._raw[__key_map[k]]
    end
}


function awake_task_info.getLength()
    return #awake_task_info._data
end



function awake_task_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_awake_task_info
function awake_task_info.indexOf(index)
    if index == nil or not awake_task_info._data[index] then
        return nil
    end
    return setmetatable({_raw = awake_task_info._data[index]}, m)
end



---
--@return @class record_awake_task_info
function awake_task_info.get(id,task_order)
    
    local k = id .. '_' .. task_order
    return awake_task_info.indexOf(__index_id_task_order[k])
     
end



function awake_task_info.set(id,task_order, key, value)
    local record = awake_task_info.get(id,task_order)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function awake_task_info.get_index_data()
    return __index_id_task_order 
end

return  awake_task_info 