---@classdef record_biography_item_info
local record_biography_item_info = {}


record_biography_item_info.id = 0--id
record_biography_item_info.name =  ""--名称
record_biography_item_info.quality = 0--品质
record_biography_item_info.num = 0--次数
record_biography_item_info.icon =  ""--图标
record_biography_item_info.description =  ""--描述
record_biography_item_info.success_popup =  ""--使用成功的提示
record_biography_item_info.failure_talk =  ""--使用失败的提示

local biography_item_info = {
   _data = {   
    [1] = {1,"酒",5,1,"100007","从店小二处可购买的上好的女儿红，最适合结拜使用！","使用成功","使用失败",},  
    [2] = {2,"猪头",5,1,"100008","野猪的猪头，可通过杀死野猪获得，适合用作下酒菜！","使用成功","使用失败",},  
    [3] = {3,"精铁",5,1,"100000","赶走木牛获得的精铁，是修复宝刀重要的材料之一！","使用成功","使用失败",},  
    [4] = {4,"紫铜",5,1,"100001","强盗掠夺得到的紫铜，是修复宝刀重要的材料之一！","使用成功","使用失败",},  
    [5] = {5,"七星宝刀",5,1,"100009","刀长尺余，七宝嵌饰，极其锋利！","使用成功","使用失败",},  
    [6] = {6,"太平经上卷",5,1,"100010","太平经上卷，于吉所书，丢失于曹操传某处！","使用成功","使用失败",},  
    [7] = {7,"太平经下卷",5,1,"100010","太平卷下卷，于吉所书，丢失于董卓传某处！","使用成功","使用失败",},  
    [8] = {8,"毒草",5,1,"100011","毒草，制作迷魂药的成分！","使用成功","使用失败",},  
    [9] = {9,"迷魂药",5,1,"100012","迷魂药，食用后一段时间内失去自我意识！","使用成功","使用失败",},  
    [10] = {10,"玉镯",5,1,"10010","貂蝉的玉镯，上好的翡翠制作而成！","使用成功","使用失败",},  
    [11] = {11,"树枝",5,1,"100011","砍树获得的树枝，可以用来扬起沙尘！","使用成功","使用失败",},  
    [12] = {12,"盾牌",5,1,"100029","伤兵求助帮忙寻找的盾牌，在关羽传中找到的大哥的信物。","使用成功","使用失败",},  
    [13] = {13,"弓箭",5,1,"100014","伤兵求助帮忙寻找的弓箭，在华雄传中找到的二哥的信物。","使用成功","使用失败",},  
    [14] = {14,"头巾",5,1,"100013","伤兵求助帮忙寻找的头巾，在吕布传中找到的三哥的信物。","使用成功","使用失败",},  
    [15] = {15,"化妆包",5,1,"5001","化妆包，可用来伪装自己，击败傀儡可获得。","使用成功","使用失败",},  
    [16] = {16,"木材",5,1,"100002","砍树获得的木材，可以用来做大盾。","使用成功","使用失败",},  
    [17] = {17,"大盾",5,1,"29","用木材制作的大盾，防御弓箭有不错的效果！","使用成功","使用失败",},  
    [18] = {18,"铁皮石斛",5,1,"100015","华佗急需的药物，可以拯救大量百姓的生命。","使用成功","使用失败",},  
    [19] = {19,"通泉草",5,1,"100016","华佗急需的药物，可以拯救大量百姓的生命。","使用成功","使用失败",},  
    [20] = {20,"苍耳子",5,1,"100017","华佗急需的药物，可以拯救大量百姓的生命。","使用成功","使用失败",},  
    [21] = {21,"蓝花参",5,1,"100018","华佗急需的药物，可以拯救大量百姓的生命。","使用成功","使用失败",},  
    [22] = {22,"鱼钩",5,1,"100019","鱼钩，钓鱼的必备品","使用成功","使用失败",},  
    [23] = {23,"酒",5,1,"100007","美酒","使用成功","使用失败",},  
    [24] = {24,"肉",5,1,"100008","美味佳肴","使用成功","使用失败",},  
    [25] = {25,"玄铁",5,1,"100000","打造宝剑必备材料","使用成功","使用失败",},  
    [26] = {26,"赤铜",5,1,"100001","打造宝剑必备材料","使用成功","使用失败",},  
    [27] = {27,"乌木",5,1,"100002","打造宝剑必备材料","使用成功","使用失败",},  
    [28] = {28,"狼尾",5,1,"100003","打造宝剑必备材料","使用成功","使用失败",},  
    [29] = {29,"雌雄双股剑",5,1,"100020","绝世好剑","使用成功","使用失败",},  
    [30] = {30,"线索1",5,1,"100021","神秘线索","使用成功","使用失败",},  
    [31] = {31,"西凉密信",5,1,"100010","找到奸细的线索","使用成功","使用失败",},  
    [32] = {32,"西凉军刀",5,1,"100009","找到奸细的线索","使用成功","使用失败",},  
    [33] = {33,"西凉服装",5,1,"100022","找到奸细的线索","使用成功","使用失败",},  
    [34] = {34,"西凉食物",5,1,"100008","找到奸细的线索","使用成功","使用失败",},  
    [35] = {35,"玉佩",5,1,"10011","百姓的玉佩，一看就不是凡品","使用成功","使用失败",},  
    [36] = {36,"美酒",5,1,"100007","百姓的美酒，多年陈酿","使用成功","使用失败",},  
    [37] = {37,"如意",5,1,"10010","百姓的如意，价值连城","使用成功","使用失败",},  
    [38] = {38,"宝剑",5,1,"100009","百姓的宝剑，家传宝物","使用成功","使用失败",},  
    [39] = {101,"肉",5,1,"100008","上好的肉，用于名将传主线任务","使用成功","使用失败",},  
    [40] = {102,"马鞍",5,1,"100004","马鞍，为赤兔马量身定做的马鞍","使用成功","使用失败",},  
    [41] = {103,"马镫",5,1,"100006","马镫，为赤兔马量身定做的马镫","使用成功","使用失败",},  
    [42] = {104,"马鞭",5,1,"100005","马鞭，为赤兔马量身定做的马鞭","使用成功","使用失败",},  
    [43] = {105,"玉佩(废弃）",5,1,"10010","百姓的玉佩，一看就不是凡品","使用成功","使用失败",},  
    [44] = {106,"美酒(废弃）",5,1,"10","百姓的美酒，多年陈酿","使用成功","使用失败",},  
    [45] = {107,"如意(废弃）",5,1,"10010","百姓的如意，价值连城","使用成功","使用失败",},  
    [46] = {108,"宝剑(废弃）",5,1,"10009","百姓的宝剑，家传宝物","使用成功","使用失败",},  
    [47] = {109,"刘禅",5,1,"10009","刘禅","使用成功","使用失败",},  
    [48] = {110,"精美如意",5,1,"100024","精美如意","使用成功","使用失败",},  
    [49] = {111,"宠物兔子",5,1,"100023","宠物兔子","使用成功","使用失败",},  
    [50] = {112,"名贵玉佩",5,1,"10010","名贵玉佩","使用成功","使用失败",},  
    [51] = {113,"踢翻的罐子",5,1,"100007","精美如意","使用成功","使用失败",},  
    [52] = {114,"马踏的草地",5,1,"100016","宠物兔子","使用成功","使用失败",},  
    [53] = {115,"吃过的苹果",5,1,"10009","名贵玉佩","使用成功","使用失败",},  
    [54] = {116,"散落的石子",5,1,"100000","精美如意","使用成功","使用失败",},  
    [55] = {117,"盘缠",5,1,"804","拿好盘缠","使用成功","使用失败",},  
    [56] = {118,"信物",5,1,"11004","纪念信物","使用成功","使用失败",},  
    [57] = {119,"短剑",5,1,"100009","短剑防身","使用成功","使用失败",},  
    [58] = {120,"通行令牌",5,1,"29","通行令牌","使用成功","使用失败",},  
    [59] = {121,"东军令牌",5,1,"29","东军令牌","使用成功","使用失败",},  
    [60] = {122,"西军令牌",5,1,"29","西军令牌","使用成功","使用失败",},  
    [61] = {123,"南军令牌",5,1,"29","南军令牌","使用成功","使用失败",},  
    [62] = {124,"北军令牌",5,1,"29","北军令牌","使用成功","使用失败",},  
    [63] = {125,"僭越的服装",5,1,"100022","僭越的服装","使用成功","使用失败",},  
    [64] = {126,"谋反的信件",5,1,"11004","谋反的信件","使用成功","使用失败",},  
    [65] = {127,"调兵的令牌",5,1,"29","调兵的令牌","使用成功","使用失败",},  
    [66] = {128,"伪造的玉玺",5,1,"100025","伪造的玉玺","使用成功","使用失败",},  
    [67] = {129,"装军饷的箱子",5,1,"804","装军饷的箱子","使用成功","使用失败",},  
    [68] = {130,"散落的玉器",5,1,"10020","散落的玉器","使用成功","使用失败",},  
    [69] = {131,"粗糙的军备",5,1,"100019","粗糙的军备","使用成功","使用失败",},  
    [70] = {132,"酿造的美酒",5,1,"100007","酿造的美酒","使用成功","使用失败",},  
    [71] = {133,"耳坠",5,1,"100025","耳坠","使用成功","使用失败",},  
    [72] = {134,"松鼠",5,1,"100023","松鼠","使用成功","使用失败",},  
    [73] = {135,"小兔子",5,1,"100023","小兔子","使用成功","使用失败",},  
    [74] = {136,"小黄花",5,1,"100026","小黄花","使用成功","使用失败",},  
    [75] = {137,"粮草·一",5,1,"100028","粮草·一","使用成功","使用失败",},  
    [76] = {138,"粮草·二",5,1,"100028","粮草·二","使用成功","使用失败",},  
    [77] = {139,"粮草·三",5,1,"100028","粮草·三","使用成功","使用失败",},  
    [78] = {140,"粮草·四",5,1,"10009","粮草·四","使用成功","使用失败",},  
    [79] = {141,"军号",5,1,"10008","军号","使用成功","使用失败",},  
    [80] = {142,"短剑",5,1,"100009","短剑","使用成功","使用失败",},  
    [81] = {143,"令牌",5,1,"29","令牌","使用成功","使用失败",},  
    [82] = {144,"家书",5,1,"100010","家书","使用成功","使用失败",},  
    [83] = {145,"密信·一",5,1,"100010","密信·一","使用成功","使用失败",},  
    [84] = {146,"密信·二",5,1,"100010","密信·二","使用成功","使用失败",},  
    [85] = {147,"密信·三",5,1,"100010","密信·三","使用成功","使用失败",},  
    [86] = {148,"密信·四",5,1,"100010","密信·四","使用成功","使用失败",},  
    [87] = {149,"财宝",5,1,"804","财宝","使用成功","使用失败",},  
    [88] = {150,"玉器",5,1,"10011","玉器","使用成功","使用失败",},  
    [89] = {151,"木箱",5,1,"5021","木箱","使用成功","使用失败",},  
    [90] = {152,"美酒",5,1,"100007","美酒","使用成功","使用失败",},  
    [91] = {153,"粮草",5,1,"100028","粮草","使用成功","使用失败",},  
    [92] = {154,"军饷",5,1,"804","军饷","使用成功","使用失败",},  
    [93] = {155,"武器",5,1,"100009","武器","使用成功","使用失败",},  
    [94] = {156,"草药",5,1,"100011","草药","使用成功","使用失败",},  
    [95] = {157,"石块",5,1,"100001","石块","使用成功","使用失败",},  
    [96] = {158,"石块2",5,1,"100001","石块2","使用成功","使用失败",},  
    [97] = {159,"石块3",5,1,"100001","石块3","使用成功","使用失败",},  
    [98] = {160,"入药的酒",5,1,"100007","入药的酒","使用成功","使用失败",},  
    [99] = {161,"入药的小蛇",5,1,"10011","入药的小蛇","使用成功","使用失败",},  
    [100] = {162,"箱子",5,1,"804","箱子","使用成功","使用失败",},  
    [101] = {163,"铠甲",5,1,"100022","铠甲","使用成功","使用失败",},  
    [102] = {164,"兔子",5,1,"100023","兔子","使用成功","使用失败",},  
    [103] = {165,"书信·一",5,1,"100010","书信·一","使用成功","使用失败",},  
    [104] = {166,"书信·二",5,1,"100010","书信·二","使用成功","使用失败",},  
    [105] = {167,"书信·三",5,1,"100010","书信·三","使用成功","使用失败",},  
    [106] = {168,"军中威信·一",5,1,"100010","军中威信·一","使用成功","使用失败",},  
    [107] = {169,"军中威信·二",5,1,"100010","军中威信·二","使用成功","使用失败",},  
    [108] = {170,"军中威信·三",5,1,"100010","军中威信·三","使用成功","使用失败",},  
    [109] = {171,"丈八蛇矛",5,1,"100019","丈八蛇矛","使用成功","使用失败",},  
    [110] = {172,"青龙偃月刀",5,1,"100009","青龙偃月刀","使用成功","使用失败",},  
    [111] = {173,"违法证据·一",5,1,"11001","违法证据·一","使用成功","使用失败",},  
    [112] = {174,"违法证据·二",5,1,"11001","违法证据·二","使用成功","使用失败",},  
    [113] = {175,"违法证据·三",5,1,"11001","违法证据·三","使用成功","使用失败",},  
    [114] = {176,"玉器·一",5,1,"10009","玉器·一","使用成功","使用失败",},  
    [115] = {177,"玉器·二",5,1,"10010","玉器·二","使用成功","使用失败",},  
    [116] = {178,"玉器·三",5,1,"10011","玉器·三","使用成功","使用失败",},  
    [117] = {179,"病情·一",5,1,"100018","病情·一","使用成功","使用失败",},  
    [118] = {180,"病情·二",5,1,"100018","病情·二","使用成功","使用失败",},  
    [119] = {181,"病情·三",5,1,"100018","病情·三","使用成功","使用失败",},  
    [120] = {182,"除草",5,1,"100016","除草","使用成功","使用失败",},  
    [121] = {183,"草药",5,1,"100011","草药","使用成功","使用失败",},  
    [122] = {184,"草鞋",5,1,"100022","草鞋","使用成功","使用失败",},  
    [123] = {185,"浮萍",5,1,"100027","浮萍","使用成功","使用失败",},  
    [124] = {186,"苏叶",5,1,"100017","苏叶","使用成功","使用失败",},  
    [125] = {187,"芫荽",5,1,"100015","芫荽","使用成功","使用失败",},  
    [126] = {188,"弓箭",5,1,"100014","弓箭","使用成功","使用失败",},  
    [127] = {189,"赤兔",5,1,"100004","赤兔","使用成功","使用失败",},  
    [128] = {190,"火盆",5,1,"100002","火盆","使用成功","使用失败",},  
    [129] = {191,"梯子",5,1,"100006","梯子","使用成功","使用失败",},  
    [130] = {192,"木桥",5,1,"100002","木桥","使用成功","使用失败",},  
    [131] = {193,"铁索",5,1,"100005","铁索","使用成功","使用失败",},  
    [132] = {194,"船",5,1,"200001","船","使用成功","使用失败",},  
    [133] = {195,"通敌的信",5,1,"100010","通敌的信","使用成功","使用失败",},  
    [134] = {196,"通敌的信",5,1,"58","通敌的信","使用成功","使用失败",},  
    [135] = {197,"通敌的信",5,1,"63","通敌的信","使用成功","使用失败",},  
    [136] = {198,"三石之弓",5,1,"100014","三石之弓","使用成功","使用失败",},  
    [137] = {199,"烤肉",5,1,"100008","烤肉","使用成功","使用失败",},  
    [138] = {200,"美酒",5,1,"100007","美酒","使用成功","使用失败",},  
    [139] = {201,"木牛机关",5,1,"100004","木牛机关","使用成功","使用失败",},  
    [140] = {202,"蔬菜",5,1,"100018","蔬菜","使用成功","使用失败",},  
    [141] = {203,"猪",5,1,"100008","猪","使用成功","使用失败",},  
    [142] = {204,"鸡蛋",5,1,"100026","鸡蛋","使用成功","使用失败",},  
    [143] = {205,"美酒",5,1,"10","美酒","使用成功","使用失败",},  
    [144] = {206,"蜀地紫姜",5,1,"100011","蜀地紫姜","使用成功","使用失败",},  
    [145] = {207,"千年寿酒",5,1,"7","千年寿酒","使用成功","使用失败",},  
    [146] = {208,"染血的短戟",5,1,"100009","染血的短戟","使用成功","使用失败",},  
    [147] = {209,"狮盔兽带",5,1,"10021","狮盔兽带","使用成功","使用失败",},  
    [148] = {210,"银甲白袍",5,1,"100022","银甲白袍","使用成功","使用失败",},  
    [149] = {211,"虎头湛金枪",5,1,"100019","虎头湛金枪","使用成功","使用失败",},  
    [150] = {212,"玉辇",5,1,"100004","玉辇","使用成功","使用失败",},  
    [151] = {213,"金鞍",5,1,"100006","金鞍","使用成功","使用失败",},  
    [152] = {214,"宝马",5,1,"100004","宝马","使用成功","使用失败",},  
    [153] = {215,"《孙子》",5,1,"100010","《孙子》","使用成功","使用失败",},  
    [154] = {216,"《左传》",5,1,"100010","《左传》","使用成功","使用失败",},  
    [155] = {217,"《国语》",5,1,"100010","《国语》","使用成功","使用失败",},  
    [156] = {218,"石料",5,1,"100000","石料","使用成功","使用失败",},  
    [157] = {219,"木材",5,1,"100002","木材","使用成功","使用失败",},  
    [158] = {220,"绳索",5,1,"100005","绳索","使用成功","使用失败",},  
    [159] = {221,"粮草",5,1,"100028","粮草","使用成功","使用失败",},  
    [160] = {222,"粮草",5,1,"100028","粮草","使用成功","使用失败",},  
    [161] = {223,"粮草",5,1,"100028","粮草","使用成功","使用失败",},  
    [162] = {224,"信件",5,1,"100010","信件","使用成功","使用失败",},  
    [163] = {225,"信件",5,1,"100010","信件","使用成功","使用失败",},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [101] = 39,  
    [102] = 40,  
    [103] = 41,  
    [104] = 42,  
    [105] = 43,  
    [106] = 44,  
    [107] = 45,  
    [108] = 46,  
    [109] = 47,  
    [110] = 48,  
    [111] = 49,  
    [112] = 50,  
    [113] = 51,  
    [114] = 52,  
    [115] = 53,  
    [116] = 54,  
    [117] = 55,  
    [118] = 56,  
    [119] = 57,  
    [120] = 58,  
    [121] = 59,  
    [122] = 60,  
    [123] = 61,  
    [124] = 62,  
    [125] = 63,  
    [126] = 64,  
    [127] = 65,  
    [128] = 66,  
    [129] = 67,  
    [130] = 68,  
    [131] = 69,  
    [132] = 70,  
    [133] = 71,  
    [134] = 72,  
    [135] = 73,  
    [136] = 74,  
    [137] = 75,  
    [138] = 76,  
    [139] = 77,  
    [140] = 78,  
    [141] = 79,  
    [142] = 80,  
    [143] = 81,  
    [144] = 82,  
    [145] = 83,  
    [146] = 84,  
    [147] = 85,  
    [148] = 86,  
    [149] = 87,  
    [150] = 88,  
    [151] = 89,  
    [152] = 90,  
    [153] = 91,  
    [154] = 92,  
    [155] = 93,  
    [156] = 94,  
    [157] = 95,  
    [158] = 96,  
    [159] = 97,  
    [160] = 98,  
    [161] = 99,  
    [162] = 100,  
    [163] = 101,  
    [164] = 102,  
    [165] = 103,  
    [166] = 104,  
    [167] = 105,  
    [168] = 106,  
    [169] = 107,  
    [170] = 108,  
    [171] = 109,  
    [172] = 110,  
    [173] = 111,  
    [174] = 112,  
    [175] = 113,  
    [176] = 114,  
    [177] = 115,  
    [178] = 116,  
    [179] = 117,  
    [180] = 118,  
    [181] = 119,  
    [182] = 120,  
    [183] = 121,  
    [184] = 122,  
    [185] = 123,  
    [186] = 124,  
    [187] = 125,  
    [188] = 126,  
    [189] = 127,  
    [190] = 128,  
    [191] = 129,  
    [192] = 130,  
    [193] = 131,  
    [194] = 132,  
    [195] = 133,  
    [196] = 134,  
    [197] = 135,  
    [198] = 136,  
    [199] = 137,  
    [200] = 138,  
    [201] = 139,  
    [202] = 140,  
    [203] = 141,  
    [204] = 142,  
    [205] = 143,  
    [206] = 144,  
    [207] = 145,  
    [208] = 146,  
    [209] = 147,  
    [210] = 148,  
    [211] = 149,  
    [212] = 150,  
    [213] = 151,  
    [214] = 152,  
    [215] = 153,  
    [216] = 154,  
    [217] = 155,  
    [218] = 156,  
    [219] = 157,  
    [220] = 158,  
    [221] = 159,  
    [222] = 160,  
    [223] = 161,  
    [224] = 162,  
    [225] = 163,
}

local __key_map = { 
    id = 1,
    name = 2,
    quality = 3,
    num = 4,
    icon = 5,
    description = 6,
    success_popup = 7,
    failure_talk = 8,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_biography_item_info")

        return t._raw[__key_map[k]]
    end
}


function biography_item_info.getLength()
    return #biography_item_info._data
end



function biography_item_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_biography_item_info
function biography_item_info.indexOf(index)
    if index == nil or not biography_item_info._data[index] then
        return nil
    end
    return setmetatable({_raw = biography_item_info._data[index]}, m)
end



---
--@return @class record_biography_item_info
function biography_item_info.get(id)
    
    return biography_item_info.indexOf(__index_id[ id ])
     
end



function biography_item_info.set(id, key, value)
    local record = biography_item_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function biography_item_info.get_index_data()
    return __index_id 
end

return  biography_item_info 