---@classdef record_biography_boss_info
local record_biography_boss_info = {}


record_biography_boss_info.id = 0--id
record_biography_boss_info.name =  ""--BOSS名称
record_biography_boss_info.land = 0--所在版块
record_biography_boss_info.res = 0--BOSS形象
record_biography_boss_info.quality = 0--BOSS品质
record_biography_boss_info.talk =  ""--BOSS气泡文字
record_biography_boss_info.cost = 0--攻打消耗体力
record_biography_boss_info.monster_team_id = 0--怪物组id
record_biography_boss_info.reward = 0--击杀奖励(普通）
record_biography_boss_info.reward_rare = 0--击杀奖励（稀有）
record_biography_boss_info.group = 0--组

local biography_boss_info = {
   _data = {   
    [1] = {1,"名将·张辽",1,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120001,180001,190001,5,},  
    [2] = {2,"名将·于吉",1,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120002,180002,190002,6,},  
    [3] = {3,"名将·赵云",1,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120003,180003,190003,7,},  
    [4] = {4,"名将·太史慈",1,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120004,180004,190004,8,},  
    [5] = {5,"名将·张辽",2,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120005,180005,190005,5,},  
    [6] = {6,"名将·于吉",2,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120006,180006,190006,6,},  
    [7] = {7,"名将·赵云",2,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120007,180007,190007,7,},  
    [8] = {8,"名将·太史慈",2,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120008,180008,190008,8,},  
    [9] = {9,"名将·典韦",3,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120009,180009,190009,3,},  
    [10] = {10,"名将·陆逊",3,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120010,180010,190010,4,},  
    [11] = {11,"名将·张辽",3,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120011,180011,190011,5,},  
    [12] = {12,"名将·于吉",3,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120012,180012,190012,6,},  
    [13] = {13,"名将·赵云",3,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120013,180013,190013,7,},  
    [14] = {14,"名将·太史慈",3,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120014,180014,190014,8,},  
    [15] = {15,"名将·典韦",4,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120015,180015,190015,3,},  
    [16] = {16,"名将·陆逊",4,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120016,180016,190016,4,},  
    [17] = {17,"名将·张辽",4,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120017,180017,190017,5,},  
    [18] = {18,"名将·于吉",4,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120018,180018,190018,6,},  
    [19] = {19,"名将·赵云",4,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120019,180019,190019,7,},  
    [20] = {20,"名将·太史慈",4,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120020,180020,190020,8,},  
    [21] = {21,"名将·吕布",5,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120021,180021,190021,1,},  
    [22] = {22,"名将·关羽",5,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120022,180022,190022,2,},  
    [23] = {23,"名将·典韦",5,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120023,180023,190023,3,},  
    [24] = {24,"名将·陆逊",5,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120024,180024,190024,4,},  
    [25] = {25,"名将·张辽",5,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120025,180025,190025,5,},  
    [26] = {26,"名将·于吉",5,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120026,180026,190026,6,},  
    [27] = {27,"名将·赵云",5,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120027,180027,190027,7,},  
    [28] = {28,"名将·太史慈",5,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120028,180028,190028,8,},  
    [29] = {29,"名将·吕布",6,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120029,180029,190029,1,},  
    [30] = {30,"名将·关羽",6,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120030,180030,190030,2,},  
    [31] = {31,"名将·典韦",6,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120031,180031,190031,3,},  
    [32] = {32,"名将·陆逊",6,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120032,180032,190032,4,},  
    [33] = {33,"名将·张辽",6,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120033,180033,190033,5,},  
    [34] = {34,"名将·于吉",6,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120034,180034,190034,6,},  
    [35] = {35,"名将·赵云",6,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120035,180035,190035,7,},  
    [36] = {36,"名将·太史慈",6,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120036,180036,190036,8,},  
    [37] = {37,"名将·吕布",7,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120037,180037,190037,1,},  
    [38] = {38,"名将·关羽",7,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120038,180038,190038,2,},  
    [39] = {39,"名将·典韦",7,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120039,180039,190039,3,},  
    [40] = {40,"名将·陆逊",7,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120040,180040,190040,4,},  
    [41] = {41,"名将·张辽",7,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120041,180041,190041,5,},  
    [42] = {42,"名将·于吉",7,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120042,180042,190042,6,},  
    [43] = {43,"名将·赵云",7,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120043,180043,190043,7,},  
    [44] = {44,"名将·太史慈",7,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120044,180044,190044,8,},  
    [45] = {45,"名将·吕布",8,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120045,180045,190045,1,},  
    [46] = {46,"名将·关羽",8,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120046,180046,190046,2,},  
    [47] = {47,"名将·典韦",8,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120047,180047,190047,3,},  
    [48] = {48,"名将·陆逊",8,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120048,180048,190048,4,},  
    [49] = {49,"名将·张辽",8,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120049,180049,190049,5,},  
    [50] = {50,"名将·于吉",8,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120050,180050,190050,6,},  
    [51] = {51,"名将·赵云",8,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120051,180051,190051,7,},  
    [52] = {52,"名将·太史慈",8,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120052,180052,190052,8,},  
    [53] = {53,"名将·吕布",9,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120053,180053,190053,1,},  
    [54] = {54,"名将·关羽",9,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120054,180054,190054,2,},  
    [55] = {55,"名将·典韦",9,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120055,180055,190055,3,},  
    [56] = {56,"名将·陆逊",9,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120056,180056,190056,4,},  
    [57] = {57,"名将·张辽",9,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120057,180057,190057,5,},  
    [58] = {58,"名将·于吉",9,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120058,180058,190058,6,},  
    [59] = {59,"名将·赵云",9,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120059,180059,190059,7,},  
    [60] = {60,"名将·太史慈",9,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120060,180060,190060,8,},  
    [61] = {61,"名将·吕布",10,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120061,180061,190061,1,},  
    [62] = {62,"名将·关羽",10,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120062,180062,190062,2,},  
    [63] = {63,"名将·典韦",10,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120063,180063,190063,3,},  
    [64] = {64,"名将·陆逊",10,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120064,180064,190064,4,},  
    [65] = {65,"名将·张辽",10,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120065,180065,190065,5,},  
    [66] = {66,"名将·于吉",10,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120066,180066,190066,6,},  
    [67] = {67,"名将·赵云",10,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120067,180067,190067,7,},  
    [68] = {68,"名将·太史慈",10,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120068,180068,190068,8,},  
    [69] = {69,"名将·吕布",11,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120069,180069,190069,1,},  
    [70] = {70,"名将·关羽",11,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120070,180070,190070,2,},  
    [71] = {71,"名将·典韦",11,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120071,180071,190071,3,},  
    [72] = {72,"名将·陆逊",11,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120072,180072,190072,4,},  
    [73] = {73,"名将·张辽",11,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120073,180073,190073,5,},  
    [74] = {74,"名将·于吉",11,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120074,180074,190074,6,},  
    [75] = {75,"名将·赵云",11,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120075,180075,190075,7,},  
    [76] = {76,"名将·太史慈",11,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120076,180076,190076,8,},  
    [77] = {77,"名将·吕布",12,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120077,180077,190077,1,},  
    [78] = {78,"名将·关羽",12,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120078,180078,190078,2,},  
    [79] = {79,"名将·典韦",12,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120079,180079,190079,3,},  
    [80] = {80,"名将·陆逊",12,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120080,180080,190080,4,},  
    [81] = {81,"名将·张辽",12,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120081,180081,190081,5,},  
    [82] = {82,"名将·于吉",12,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120082,180082,190082,6,},  
    [83] = {83,"名将·赵云",12,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120083,180083,190083,7,},  
    [84] = {84,"名将·太史慈",12,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120084,180084,190084,8,},  
    [85] = {85,"名将·吕布",13,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120085,180085,190085,1,},  
    [86] = {86,"名将·关羽",13,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120086,180086,190086,2,},  
    [87] = {87,"名将·典韦",13,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120087,180087,190087,3,},  
    [88] = {88,"名将·陆逊",13,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120088,180088,190088,4,},  
    [89] = {89,"名将·张辽",13,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120089,180089,190089,5,},  
    [90] = {90,"名将·于吉",13,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120090,180090,190090,6,},  
    [91] = {91,"名将·赵云",13,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120091,180091,190091,7,},  
    [92] = {92,"名将·太史慈",13,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120092,180092,190092,8,},  
    [93] = {93,"名将·吕布",14,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120093,180093,190093,1,},  
    [94] = {94,"名将·关羽",14,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120094,180094,190094,2,},  
    [95] = {95,"名将·典韦",14,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120095,180095,190095,3,},  
    [96] = {96,"名将·陆逊",14,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120096,180096,190096,4,},  
    [97] = {97,"名将·张辽",14,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120097,180097,190097,5,},  
    [98] = {98,"名将·于吉",14,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120098,180098,190098,6,},  
    [99] = {99,"名将·赵云",14,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120099,180099,190099,7,},  
    [100] = {100,"名将·太史慈",14,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120100,180100,190100,8,},  
    [101] = {101,"名将·吕布",15,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120101,180101,190101,1,},  
    [102] = {102,"名将·关羽",15,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120102,180102,190102,2,},  
    [103] = {103,"名将·典韦",15,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120103,180103,190103,3,},  
    [104] = {104,"名将·陆逊",15,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120104,180104,190104,4,},  
    [105] = {105,"名将·张辽",15,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120105,180105,190105,5,},  
    [106] = {106,"名将·于吉",15,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120106,180106,190106,6,},  
    [107] = {107,"名将·赵云",15,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120107,180107,190107,7,},  
    [108] = {108,"名将·太史慈",15,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120108,180108,190108,8,},  
    [109] = {109,"名将·吕布",16,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120109,180109,190109,1,},  
    [110] = {110,"名将·关羽",16,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120110,180110,190110,2,},  
    [111] = {111,"名将·典韦",16,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120111,180111,190111,3,},  
    [112] = {112,"名将·陆逊",16,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120112,180112,190112,4,},  
    [113] = {113,"名将·张辽",16,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120113,180113,190113,5,},  
    [114] = {114,"名将·于吉",16,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120114,180114,190114,6,},  
    [115] = {115,"名将·赵云",16,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120115,180115,190115,7,},  
    [116] = {116,"名将·太史慈",16,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120116,180116,190116,8,},  
    [117] = {117,"名将·吕布",17,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120117,180117,190117,1,},  
    [118] = {118,"名将·关羽",17,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120118,180118,190118,2,},  
    [119] = {119,"名将·典韦",17,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120119,180119,190119,3,},  
    [120] = {120,"名将·陆逊",17,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120120,180120,190120,4,},  
    [121] = {121,"名将·张辽",17,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120121,180121,190121,5,},  
    [122] = {122,"名将·于吉",17,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120122,180122,190122,6,},  
    [123] = {123,"名将·赵云",17,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120123,180123,190123,7,},  
    [124] = {124,"名将·太史慈",17,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120124,180124,190124,8,},  
    [125] = {125,"名将·吕布",18,300340,7,"良驹赤兔添虎翼\n方天画戟丧敌胆",5,120125,180125,190125,1,},  
    [126] = {126,"名将·关羽",18,300310,7,"马骑赤兔行千里\n刀偃青龙出五关",5,120126,180126,190126,2,},  
    [127] = {127,"名将·典韦",18,510020,6,"典韦救主传天下\n勇猛当先第一人",5,120127,180127,190127,3,},  
    [128] = {128,"名将·陆逊",18,510050,6,"三分自是多英俊\n又显江南陆逊高",5,120128,180128,190128,4,},  
    [129] = {129,"名将·张辽",18,500020,5,"金戈铁马扫袁氏\n怒斩蹋顿平辽东",5,120129,180129,190129,5,},  
    [130] = {130,"名将·于吉",18,500210,5,"琅邪于吉撰太平\n制符传经惑苍生",5,120130,180130,190130,6,},  
    [131] = {131,"名将·赵云",18,510040,5,"子龙一身都是胆\n更有仁心并义肝",5,120131,180131,190131,7,},  
    [132] = {132,"名将·太史慈",18,500170,5,"北海施恩有义名\n神亭酣战惜雏英",5,120132,180132,190132,8,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,  
    [56] = 56,  
    [57] = 57,  
    [58] = 58,  
    [59] = 59,  
    [60] = 60,  
    [61] = 61,  
    [62] = 62,  
    [63] = 63,  
    [64] = 64,  
    [65] = 65,  
    [66] = 66,  
    [67] = 67,  
    [68] = 68,  
    [69] = 69,  
    [70] = 70,  
    [71] = 71,  
    [72] = 72,  
    [73] = 73,  
    [74] = 74,  
    [75] = 75,  
    [76] = 76,  
    [77] = 77,  
    [78] = 78,  
    [79] = 79,  
    [80] = 80,  
    [81] = 81,  
    [82] = 82,  
    [83] = 83,  
    [84] = 84,  
    [85] = 85,  
    [86] = 86,  
    [87] = 87,  
    [88] = 88,  
    [89] = 89,  
    [90] = 90,  
    [91] = 91,  
    [92] = 92,  
    [93] = 93,  
    [94] = 94,  
    [95] = 95,  
    [96] = 96,  
    [97] = 97,  
    [98] = 98,  
    [99] = 99,  
    [100] = 100,  
    [101] = 101,  
    [102] = 102,  
    [103] = 103,  
    [104] = 104,  
    [105] = 105,  
    [106] = 106,  
    [107] = 107,  
    [108] = 108,  
    [109] = 109,  
    [110] = 110,  
    [111] = 111,  
    [112] = 112,  
    [113] = 113,  
    [114] = 114,  
    [115] = 115,  
    [116] = 116,  
    [117] = 117,  
    [118] = 118,  
    [119] = 119,  
    [120] = 120,  
    [121] = 121,  
    [122] = 122,  
    [123] = 123,  
    [124] = 124,  
    [125] = 125,  
    [126] = 126,  
    [127] = 127,  
    [128] = 128,  
    [129] = 129,  
    [130] = 130,  
    [131] = 131,  
    [132] = 132,
}

local __key_map = { 
    id = 1,
    name = 2,
    land = 3,
    res = 4,
    quality = 5,
    talk = 6,
    cost = 7,
    monster_team_id = 8,
    reward = 9,
    reward_rare = 10,
    group = 11,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_biography_boss_info")

        return t._raw[__key_map[k]]
    end
}


function biography_boss_info.getLength()
    return #biography_boss_info._data
end



function biography_boss_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_biography_boss_info
function biography_boss_info.indexOf(index)
    if index == nil or not biography_boss_info._data[index] then
        return nil
    end
    return setmetatable({_raw = biography_boss_info._data[index]}, m)
end



---
--@return @class record_biography_boss_info
function biography_boss_info.get(id)
    
    return biography_boss_info.indexOf(__index_id[ id ])
     
end



function biography_boss_info.set(id, key, value)
    local record = biography_boss_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function biography_boss_info.get_index_data()
    return __index_id 
end

return  biography_boss_info 