---@classdef record_bubble_chat_npc_info
local record_bubble_chat_npc_info = {}


record_bubble_chat_npc_info.id = 0--ID
record_bubble_chat_npc_info.type = 0--玩法类型
record_bubble_chat_npc_info.rank_min = 0--出现排名最小值
record_bubble_chat_npc_info.rank_max = 0--出现排名最大值
record_bubble_chat_npc_info.bubble_type = 0--文字类型值
record_bubble_chat_npc_info.chat =  ""--气泡文字

local bubble_chat_npc_info = {
   _data = {   
    [1] = {1,1,1,1,3,"呵~真是高手寂寞啊！",},  
    [2] = {2,1,1,1,3,"站在巅峰的感觉，你们永远不懂。",},  
    [3] = {3,1,1,1,3,"你们快去名人堂膜拜我吧！",},  
    [4] = {4,1,1,1,3,"绝顶之巅，一览众山小！",},  
    [5] = {5,1,1,1,3,"三国的王座，刚好配我！",},  
    [6] = {6,1,1,1,3,"我头角峥嵘，称霸三国时代。",},  
    [7] = {7,1,2,5,2,"巅峰之位暂时由你保管。",},  
    [8] = {8,1,2,5,3,"巅峰王座，我想取便取！",},  
    [9] = {9,1,2,5,3,"天下九州，何人能敌我？",},  
    [10] = {10,1,2,5,3,"你们快去名人堂膜拜我吧！",},  
    [11] = {11,1,2,5,3,"对不起，这场战斗我要赢。",},  
    [12] = {12,1,6,10,1,"以你的资质，永远到不了我的位置。",},  
    [13] = {13,1,6,10,1,"我天生奇才，万中无一！",},  
    [14] = {14,1,6,10,1,"名人堂将有我一席之位！",},  
    [15] = {15,1,6,10,1,"你瞅啥？信不信我弄你呢。",},  
    [16] = {16,1,6,10,1,"什么五虎上将，不过我手下败将！",},  
    [17] = {17,1,6,10,1,"世间英雄谁敌手？",},  
    [18] = {18,1,6,10,3,"一吕二赵三典韦，这个排名该换换了！",},  
    [19] = {19,1,6,10,3,"竞技场上不留无名之将！",},  
    [20] = {20,1,11,100,1,"谁能胜我？谁敢胜我？",},  
    [21] = {21,1,11,100,1,"我刀下不斩无名之辈！",},  
    [22] = {22,1,11,100,1,"我打不过三国名将，还打不过你吗？",},  
    [23] = {23,1,11,100,1,"我要成为乱世的弄潮儿！",},  
    [24] = {24,1,11,100,3,"排名座次，还要手底下见真章！",},  
    [25] = {25,1,11,100,3,"百尺竿头更进一步！",},  
    [26] = {26,1,11,100,3,"这里没有对错，只有输赢！",},  
    [27] = {27,1,11,100,3,"万军中取上将首级如探囊取物！",},  
    [28] = {28,1,101,999999,1,"我好不容易到这里，怎能轻易认输！",},  
    [29] = {29,1,101,999999,1,"上面有金闪闪的元宝等着我去拿呢！",},  
    [30] = {30,1,101,999999,1,"想要往上走，从我身体上踏过去！",},  
    [31] = {31,1,101,999999,1,"胜者王侯败者寇！",},  
    [32] = {32,1,101,999999,1,"打赢我你才有资格往上走！",},  
    [33] = {33,1,101,999999,1,"三国英雄梦，碰到我该醒醒了！",},  
    [34] = {34,1,101,999999,1,"关张赵马黄，一个不好惹！",},  
    [35] = {35,1,101,999999,1,"别说吕布了，你连潘凤都打不过！",},  
    [36] = {36,1,101,999999,2,"你等着，我不会成为你的垫脚石的！",},  
    [37] = {37,1,101,999999,2,"我一时失手，让你讨了便宜！",},  
    [38] = {38,1,101,999999,2,"胜败乃兵家常事！",},  
    [39] = {39,1,101,999999,2,"小心你的位子，明天我就能超越你！",},  
    [40] = {40,1,101,999999,2,"前方强敌林立，祝你一路顺风！",},  
    [41] = {41,1,101,999999,1,"竞技场如逆水行舟，不进则退。",},  
    [42] = {42,1,101,999999,3,"三国英雄事，尽在酒一盅！",},  
    [43] = {1001,2,1,1,3,"普天之下，莫非王土，率土之滨，莫非王臣。",},  
    [44] = {1002,2,1,1,3,"这天下，是我的天下！",},  
    [45] = {1003,2,2,3,1,"下次争霸，我会卷土重来！",},  
    [46] = {1004,2,2,3,1,"霸主之位，就让你暂坐几日罢了。",},  
    [47] = {1005,2,4,9999,3,"过关斩将，为的就是封侯拜相！",},  
    [48] = {1006,2,4,9999,3,"天下名城，强者居之！",},  
    [49] = {1007,2,4,9999,3,"沙场征战，搏个落脚之处。",},  
    [50] = {1008,2,4,9999,3,"南征北战，未遇敌手！",},  
    [51] = {1009,2,4,9999,3,"排位座次，手底下见真章！",},  
    [52] = {1010,2,4,9999,3,"再捞点军功，我也能往上面走走。",},  
    [53] = {1011,2,4,9999,3,"百战名将，也会败于我手！",},  
    [54] = {1012,2,4,9999,3,"我好不容易到这里，怎能轻易认输！",},  
    [55] = {1013,2,4,9999,3,"打赢我你才有资格往上走！",},  
    [56] = {1014,2,4,9999,3,"我弓马娴熟，足以当大任！",},  
    [57] = {1015,2,4,9999,3,"雄关名城，我终将拥有！",},  
    [58] = {1016,2,4,9999,3,"万里征途，这才是第一步！",},  
    [59] = {1017,2,4,9999,3,"城池争霸，拼的是实力！",},  
    [60] = {1018,2,4,9999,3,"封侯拜相是我一辈子的梦想！",},  
    [61] = {1019,2,4,9999,3,"三国名城，易守难攻。",},  
    [62] = {1020,2,4,9999,3,"这就是传说中的三国名城吗？",},  
    [63] = {1021,2,4,9999,3,"想不到这里的竞争如此激烈！",},  
    [64] = {1022,2,4,9999,3,"城池争霸，算我一个！",},  
    [65] = {1023,2,4,9999,3,"委身此处，我不甘心啊！",},  
    [66] = {1024,2,4,9999,3,"险关高城，我要一一征服！",},  
    [67] = {1025,2,4,9999,3,"出征数载，就为了城主之名！",},  
    [68] = {1026,2,4,9999,3,"坐拥名城可号令天下！",},  
    [69] = {1027,2,4,9999,3,"三国九州，名城屈指可数。",},  
    [70] = {1028,2,4,9999,3,"沙场过招，可不止点到为止。",},  
    [71] = {1029,2,4,9999,3,"来来来，有什么本事亮出来吧！",},  
    [72] = {1030,2,4,9999,3,"大江东去，淘不尽的英雄梦。",},  
    [73] = {1031,2,4,9999,3,"坐了城主宝座，享不尽的荣华富贵！",},  
    [74] = {1032,2,4,9999,3,"技不如人更要卧薪尝胆！",},  
    [75] = {1033,2,4,9999,3,"听说城主的俸禄远超一般人。",},  
    [76] = {1034,2,4,9999,3,"当上城主，名声传遍海内！",},  
    [77] = {1035,2,4,9999,3,"做了城主，好似一方帝王。",},  
    [78] = {1036,2,4,9999,3,"千秋功业，就在脚下！",},  
    [79] = {2001,3,1,10,1,"我不是针对你，我是说在场的各位都不堪一击！",},  
    [80] = {2002,3,1,10,2,"别看着我，我只是路过打酱油的！",},  
    [81] = {2003,3,11,20,1,"本将军挂帅亲征，必定所向披靡！",},  
    [82] = {2004,3,11,20,2,"欺负我算什么好汉？有本事找我们老大去！",},  
    [83] = {2005,3,21,30,1,"见到我还不乖乖投降？",},  
    [84] = {2006,3,21,30,2,"这里强者太多了，找到机会立马开溜！",},  
    [85] = {2007,3,31,50,1,"想拿积分？先问问我手中的剑！",},  
    [86] = {2008,3,31,50,2,"积分给你，我只想回家……",},  
    [87] = {2011,4,1,2,1,"山野匹夫，一个能打的都没有！",},  
    [88] = {2012,4,1,2,2,"别看着我，我只是路过打酱油的！",},  
    [89] = {2013,4,3,4,1,"今天正是吾辈扬名立万之时！",},  
    [90] = {2014,4,3,4,2,"欺负我算什么好汉？有本事找我们老大去！",},  
    [91] = {2015,4,5,6,1,"弱小的人不配与我交手！",},  
    [92] = {2016,4,5,6,2,"这里强者太多了，找到机会立马开溜！",},  
    [93] = {2017,4,7,8,1,"横刀立马方显英雄本色！",},  
    [94] = {2018,4,7,8,2,"积分给你，我只想回家……",},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [1001] = 43,  
    [1002] = 44,  
    [1003] = 45,  
    [1004] = 46,  
    [1005] = 47,  
    [1006] = 48,  
    [1007] = 49,  
    [1008] = 50,  
    [1009] = 51,  
    [1010] = 52,  
    [1011] = 53,  
    [1012] = 54,  
    [1013] = 55,  
    [1014] = 56,  
    [1015] = 57,  
    [1016] = 58,  
    [1017] = 59,  
    [1018] = 60,  
    [1019] = 61,  
    [1020] = 62,  
    [1021] = 63,  
    [1022] = 64,  
    [1023] = 65,  
    [1024] = 66,  
    [1025] = 67,  
    [1026] = 68,  
    [1027] = 69,  
    [1028] = 70,  
    [1029] = 71,  
    [1030] = 72,  
    [1031] = 73,  
    [1032] = 74,  
    [1033] = 75,  
    [1034] = 76,  
    [1035] = 77,  
    [1036] = 78,  
    [2001] = 79,  
    [2002] = 80,  
    [2003] = 81,  
    [2004] = 82,  
    [2005] = 83,  
    [2006] = 84,  
    [2007] = 85,  
    [2008] = 86,  
    [2011] = 87,  
    [2012] = 88,  
    [2013] = 89,  
    [2014] = 90,  
    [2015] = 91,  
    [2016] = 92,  
    [2017] = 93,  
    [2018] = 94,
}

local __key_map = { 
    id = 1,
    type = 2,
    rank_min = 3,
    rank_max = 4,
    bubble_type = 5,
    chat = 6,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_bubble_chat_npc_info")

        return t._raw[__key_map[k]]
    end
}


function bubble_chat_npc_info.getLength()
    return #bubble_chat_npc_info._data
end



function bubble_chat_npc_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_bubble_chat_npc_info
function bubble_chat_npc_info.indexOf(index)
    if index == nil or not bubble_chat_npc_info._data[index] then
        return nil
    end
    return setmetatable({_raw = bubble_chat_npc_info._data[index]}, m)
end



---
--@return @class record_bubble_chat_npc_info
function bubble_chat_npc_info.get(id)
    
    return bubble_chat_npc_info.indexOf(__index_id[ id ])
     
end



function bubble_chat_npc_info.set(id, key, value)
    local record = bubble_chat_npc_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function bubble_chat_npc_info.get_index_data()
    return __index_id 
end

return  bubble_chat_npc_info 