---@classdef record_city_dialogue_info
local record_city_dialogue_info = {}


record_city_dialogue_info.id = 0--ID
record_city_dialogue_info.advance_id = 0--封地类型
record_city_dialogue_info.dialogue_group_target = 0--对话对象
record_city_dialogue_info.dialogue_group = 0--对话组ID
record_city_dialogue_info.intra_group_order = 0--组内顺序
record_city_dialogue_info.res_id = 0--说话武将
record_city_dialogue_info.dialogue_txt =  ""--对话文本
record_city_dialogue_info.emoji_pic =  ""--表情图片
record_city_dialogue_info.duration_time = 0--持续时间（毫秒）
record_city_dialogue_info.next_time = 0--下个开始时间（毫秒）
record_city_dialogue_info.interval_time_min = 0--间隔时间下限
record_city_dialogue_info.interval_time_max = 0--间隔时间上限

local city_dialogue_info = {
   _data = {   
    [1] = {1,10,1,1001,1,0,"蒋姑娘，昨天一起喝茶的那位公子可喜欢？","1",2000,2000,0,0,},  
    [2] = {2,10,1,1001,2,500130,"唔，小女子不好意思说，怕不得体……","2",2000,2000,0,0,},  
    [3] = {3,10,1,1001,3,0,"哈哈哈，蒋姑娘若不说，就当做不喜欢了。","3",2000,2000,0,0,},  
    [4] = {4,10,1,1001,4,0,"既然不喜欢，那明日介绍其他公子给姑娘。","",2000,2000,0,0,},  
    [5] = {5,10,1,1001,5,500130,"将军好讨厌。我，嗯，那个公子，喜欢的……","",2000,2000,0,0,},  
    [6] = {6,10,1,1001,6,500130,"爹爹请将军，今晚来家里吃饭。请将军赏光。","",2000,2000,0,0,},  
    [7] = {7,10,1,1001,7,0,"多谢姑娘，待我巡逻完就到府上拜访。","",2000,2000,2000,5000,},  
    [8] = {8,10,2,1003,1,500060,"明明看见一只小猫跑过来了。","4",2000,0,1000,4000,},  
    [9] = {9,10,2,1004,1,500060,"小猫快出来，来吃小鱼干。","5",2000,0,1000,4000,},  
    [10] = {10,10,3,1005,1,500010,"小猫别躲了，看见你的尾巴了。","",2000,0,1000,4000,},  
    [11] = {11,20,1,2001,1,500010,"将军，最近来了一个陌生道人，常在市集走动。","1",2000,2000,0,0,},  
    [12] = {12,20,1,2001,2,0,"黄姑娘所说那人，可是星眉朗目,器宇不凡。","2",2000,2000,0,0,},  
    [13] = {13,20,1,2001,3,500010,"嗯，正是这般模样。","3",1000,2000,0,0,},  
    [14] = {14,20,1,2001,4,0,"那就无须担心了，此人身份已探明。","",2000,2000,0,0,},  
    [15] = {15,20,1,2001,5,0,"正是天下第一奇人，左慈。","",2000,2000,0,0,},  
    [16] = {16,20,1,2001,6,500010,"那太好了，我还担心又是一个妖道。","",2000,2000,0,0,},  
    [17] = {17,20,1,2001,7,0,"姑娘有这等警觉，是好事。","",2000,2000,2000,5000,},  
    [18] = {18,20,1,2001,8,500010,"将军谬赞。小女子不打扰将军巡逻了，先告辞。","4",2000,0,1000,4000,},  
    [19] = {19,20,1,2001,9,0,"好，黄姑娘慢走。","5",2000,0,1000,4000,},  
    [20] = {20,20,2,2002,1,500180,"听说城后山挖出了银矿。","",2000,0,1000,4000,},  
    [21] = {21,20,2,2003,1,500180,"可惜呀，那银矿差点就是我的。","",2000,0,1000,4000,},  
    [22] = {22,30,1,3001,1,0,"张老板，明天还要借你的马车用一用。","1",2000,2000,0,0,},  
    [23] = {23,30,1,3001,2,400160,"将军尽管拿去用。","2",2000,2000,0,0,},  
    [24] = {24,30,1,3001,3,400160,"前线急需兵器，铁匠们连夜赶工，我只是尽薄力。","3",1000,2000,0,0,},  
    [25] = {25,30,1,3001,4,0,"多谢张老板，明日上午我会来取车。","",2000,2000,0,0,},  
    [26] = {26,30,1,3001,5,400160,"五十辆马车均已备齐，随时来取。","",2000,2000,0,0,},  
    [27] = {27,30,1,3001,6,0,"好！我现在去看下铁匠们的进度，咱明早再见。","",2000,2000,2000,5000,},  
    [28] = {28,30,2,3001,1,500030,"今日运来的炼铁材料真不错。","5",2000,0,1000,4000,},  
    [29] = {29,30,2,3002,1,500030,"真为师父的身体担忧。","",2000,0,1000,4000,},  
    [30] = {30,30,2,3003,1,500030,"看来今晚又要开夜工。","",2000,0,1000,4000,},  
    [31] = {31,40,1,4001,1,500230,"将军啊，多亏你昨天修好了藏宝阁机关。","1",2000,1000,0,0,},  
    [32] = {32,40,1,4001,2,500230,"昨天夜里，有盗贼试图入阁，被挡住了。","2",2000,2000,0,0,},  
    [33] = {33,40,1,4001,3,0,"保护百姓财产，是我们的责任。","3",2000,2000,0,0,},  
    [34] = {34,40,1,4001,4,0,"昨晚的盗贼真是太狡猾了，被他溜走了。","",2000,2000,0,0,},  
    [35] = {35,40,1,4001,5,500230,"夜明珠还在阁中，这贼定会再来。","",2000,2000,0,0,},  
    [36] = {36,40,1,4001,6,0,"汪老板放心，今晚我会去藏宝阁守夜。","",2000,2000,0,0,},  
    [37] = {37,40,1,4001,7,500230,"将军亲力亲为，不胜感激。","",2000,2000,2000,5000,},  
    [38] = {38,40,2,4001,1,500160,"没想到藏宝阁的机关如此严密。","4",2000,0,1000,4000,},  
    [39] = {39,40,2,4002,1,500160,"今晚定要拿到那颗夜明珠。","5",2000,0,1000,4000,},  
    [40] = {40,50,1,5001,1,510060,"这位将军，请问城里最好的药店怎么走？","1",2000,2000,0,0,},  
    [41] = {41,50,1,5001,2,0,"沿着这条路走到底左转就能到。","2",2000,2000,0,0,},  
    [42] = {42,50,1,5001,3,0,"小妹妹，你是外乡来的吧。","3",1000,2000,0,0,},  
    [43] = {43,50,1,5001,4,510060,"嗯，我今早刚到的许昌。","",2000,2000,0,0,},  
    [44] = {44,50,1,5001,5,0,"最近城中突发疫情，要多注意。","",2000,2000,0,0,},  
    [45] = {45,50,1,5001,6,510060,"多谢将军提醒，我从小随义父学习医术，不碍事。","",2000,2000,0,0,},  
    [46] = {46,50,1,5001,7,510060,"如果将军不怕小女子医术未精，可带我去看看病人。","",2000,2000,0,0,},  
    [47] = {47,50,1,5001,8,0,"难得小妹妹这么热心，请随我来。","",2000,2000,2000,5000,},  
    [48] = {48,50,2,1003,1,500210,"听说城里来了医术了得的女娃娃。","4",2000,0,1000,4000,},  
    [49] = {49,50,2,1004,1,500210,"说不定我的病有治了。","5",2000,0,1000,4000,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,
}

local __key_map = { 
    id = 1,
    advance_id = 2,
    dialogue_group_target = 3,
    dialogue_group = 4,
    intra_group_order = 5,
    res_id = 6,
    dialogue_txt = 7,
    emoji_pic = 8,
    duration_time = 9,
    next_time = 10,
    interval_time_min = 11,
    interval_time_max = 12,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_city_dialogue_info")

        return t._raw[__key_map[k]]
    end
}


function city_dialogue_info.getLength()
    return #city_dialogue_info._data
end



function city_dialogue_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_city_dialogue_info
function city_dialogue_info.indexOf(index)
    if index == nil or not city_dialogue_info._data[index] then
        return nil
    end
    return setmetatable({_raw = city_dialogue_info._data[index]}, m)
end



---
--@return @class record_city_dialogue_info
function city_dialogue_info.get(id)
    
    return city_dialogue_info.indexOf(__index_id[ id ])
     
end



function city_dialogue_info.set(id, key, value)
    local record = city_dialogue_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function city_dialogue_info.get_index_data()
    return __index_id 
end

return  city_dialogue_info 