---@classdef record_city_process_event_info
local record_city_process_event_info = {}


record_city_process_event_info.id = 0--事件描述库
record_city_process_event_info.num = 0--子句
record_city_process_event_info.event_type = 0--事件类型
record_city_process_event_info.direction_type = 0--表述类型
record_city_process_event_info.reward_type = 0--收益类型
record_city_process_event_info.reward_value = 0--收益类型
record_city_process_event_info.description =  ""--事件描述

local city_process_event_info = {
   _data = {   
    [1] = {101,1,1,1,999,0,"镖局总镖头庆祝六十大寿，【#knight#】路过府邸时获赠#reward#。",},  
    [2] = {101,2,1,1,3,1,"太平道庸医用药不当，导致病人死去，【#knight#】押送其入狱，从他身上搜出#reward#。",},  
    [3] = {101,3,1,1,1,4,"【#knight#】今日出门巡逻时间早，路过食摊时买肉包吃，补充了#reward#。",},  
    [4] = {101,4,1,1,1,3,"汉中太守张鲁发放军饷，激励将士抵抗曹操，【#knight#】得到#reward#。",},  
    [5] = {101,5,1,1,3,7,"城南书店的蒋老板请【#knight#】阅读珍藏，拿出了孤本#reward#。",},  
    [6] = {101,6,1,1,3,8,"暮春时节，多年未见的好友来到汉中拜访【#knight#】，赠送了#reward#。",},  
    [7] = {101,7,1,1,3,9,"书店蒋老板对【#knight#】诗兴大发，登门拜访，共同鉴赏#reward#。",},  
    [8] = {101,8,1,1,3,10,"书店蒋老板联系【#knight#】，赠以#reward#，以全知己之情。",},  
    [9] = {101,9,1,2,0,0,"【#knight#】帮芙蓉楼的王老板找回走丢的儿子，获赠#reward#。",},  
    [10] = {101,10,2,1,999,0,"葭萌关大胜，太守张鲁给【#knight#】#reward#，表彰作战英勇。",},  
    [11] = {101,11,2,1,1,3,"【#knight#】找到太平道的财宝，在城郊断桥得到#reward#。",},  
    [12] = {101,12,2,1,4,500120,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [13] = {101,13,2,1,4,500080,"【#knight#】巡逻经过一处桃园，正想进入讨碗茶喝，#reward#迎了出来。",},  
    [14] = {101,14,2,1,4,500070,"【#knight#】在城南遇一其貌不扬的青年男子，自报家门为#reward#，欲跟随主公。",},  
    [15] = {101,15,2,1,4,500090,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [16] = {101,16,2,2,0,0,"陇西商贩入城，【#knight#】收缴关中的商税，获得#reward#。",},  
    [17] = {201,1,1,1,999,0,"长安都尉病重，【#knight#】请来神医为其医治，都尉病愈后感激，赠送#reward#。",},  
    [18] = {201,2,1,1,1,3,"【#knight#】扫荡西凉劫匪，得到一个钱袋子，里面装着#reward#。",},  
    [19] = {201,3,1,1,1,17,"【#knight#】发现一个道人仙风道骨，认出是奇人左慈，上前拜见，获其赠送#reward#。",},  
    [20] = {201,4,1,1,3,2,"几个小孩打弹珠，【#knight#】发现做弹珠的石子光泽异常，买来一看，居然是#reward#。",},  
    [21] = {201,5,1,1,3,11,"长安城北有一枯井，常有怪声从井底发出，【#knight#】下井探察，竟发现有#reward#。",},  
    [22] = {201,6,1,1,1,3,"两地主为争夺一个山头爆发斗殴，【#knight#】接到命令维护秩序，发现山头有银矿，获得#reward#。",},  
    [23] = {201,7,1,1,6,73,"西凉残党肆虐，劫掠百姓，【#knight#】前往镇压，从乱军营帐中获得#reward#。",},  
    [24] = {201,8,1,2,0,0,"【#knight#】在码头出发现一些无人认领的箱子，打开发现是#reward#。",},  
    [25] = {201,9,2,1,999,0,"城中地震，古宅倒塌，【#knight#】救出受伤老人，竟是汉室宗亲，受赏#reward#",},  
    [26] = {201,10,2,1,1,3,"江洋大盗燕飞天被【#knight#】在长安抓捕，从他身上搜出了#reward#。",},  
    [27] = {201,11,2,1,4,500220,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [28] = {201,12,2,1,4,500230,"前几日有塞外美姬进了城，【#knight#】便接到#reward#来信，说要来长安游玩。",},  
    [29] = {201,13,2,1,4,500240,"【#knight#】巡逻至城北凉亭，见一青年俊美不凡且声音洪亮，原来是白马将军#reward#。",},  
    [30] = {201,14,2,1,4,500010,"前线士兵连月苦战士气低落，才貌绝伦的#reward#来找【#knight#】，请命去前线鼓舞士气。",},  
    [31] = {201,15,2,1,4,500200,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [32] = {201,16,2,2,0,0,"一队商贩入城，【#knight#】收缴商税，获得#reward#。",},  
    [33] = {301,1,1,1,999,0,"路上有马车失控，差点撞上一个青衫女子，幸得【#knight#】出手相救，女子赠其#reward#，并留下芳名。",},  
    [34] = {301,2,1,1,1,3,"【#knight#】误入荒村，在一处断桥捡到一个小袋子，里面竟装着#reward#。",},  
    [35] = {301,3,1,1,3,2004,"【#knight#】在码头发现一仓无人认领的货品，打开发现是一些#reward#。",},  
    [36] = {301,4,1,1,3,2003,"刚到城中没几日的商队匆匆离去，【#knight#】在其居住过的客栈找到一些#reward#。",},  
    [37] = {301,5,1,1,3,2002,"月黑风高夜，【#knight#】遇到两名黑衣蒙面人，一番打斗后，黑衣人逃离，拉下#reward#。",},  
    [38] = {301,6,1,1,3,12,"成都城郊堆积了一些炼铁废渣，【#knight#】遣人淘洗，获得若干#reward#。",},  
    [39] = {301,7,1,1,3,13,"【#knight#】帮助铁匠运送炼铁原材料，铁匠十分感激，赠以#reward#。",},  
    [40] = {301,8,1,1,3,14,"铁匠爱徒对帮师傅工作的【#knight#】暗生情愫，为表心意，赠以#reward#。",},  
    [41] = {301,9,1,1,3,15,"前线兵器奇缺，【#knight#】帮铁匠锻造武器，铁匠感激万分，赠以#reward#。",},  
    [42] = {301,10,1,2,0,0,"【#knight#】在码头出发现一些无人认领的箱子，打开发现是#reward#。",},  
    [43] = {301,11,2,1,999,0,"郡守特别想吃川菜，【#knight#】为其买了口水鸡，郡守大喜，奖赏#reward#。",},  
    [44] = {301,12,2,1,1,3,"城中集市召开，无数商队蜂拥入城，【#knight#】收缴商税，获得#reward#。",},  
    [45] = {301,13,2,1,4,500130,"城内举行祭奠，【#knight#】张榜招募祭祀舞蹈之人，明艳少女#reward#前来揭榜。",},  
    [46] = {301,14,2,1,4,500150,"前线战事告急，名将#reward#连夜来找【#knight#】，愿率部前往支援。",},  
    [47] = {301,15,2,1,4,500170,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [48] = {301,16,2,1,4,500180,"【#knight#】在城中开稷坛，邀天下名士来自辩论，名士#reward#慕名而来。",},  
    [49] = {301,17,2,1,4,500140,"近日城郊有老虎出没，未等【#knight#】张榜招贤驱虎，名将#reward#就毛遂自荐。",},  
    [50] = {301,18,2,2,0,0,"【#knight#】今天运气真好，在城郊断桥捡到一个小袋子，里面装着#reward#。",},  
    [51] = {401,1,1,1,999,0,"连着守了几天几夜，【#knight#】终于捕获越狱流亡在此的江洋大盗燕飞天，得赏#reward#。",},  
    [52] = {401,2,1,1,1,3,"曹操为庆祝平定汉中，犒赏许昌的守城士兵，【#knight#】得到#reward#。",},  
    [53] = {401,3,1,1,3,2009,"曹操得到藏宝图，派【#knight#】带摸金校尉前往探寻，获得#reward#。",},  
    [54] = {401,4,1,1,3,2008,"【#knight#】按图索骥挖掘宝藏，获得#reward#。",},  
    [55] = {401,5,1,1,3,2007,"【#knight#】在藏宝地附近又发现了一处小宝藏，获得#reward#。",},  
    [56] = {401,6,1,1,3,17,"为提升宝物威力，【#knight#】前往后山挖掘，挖了一天一夜后，终于挖出#reward#。",},  
    [57] = {401,7,1,1,8,13010,"城中藏宝阁失火，【#knight#】率部扑灭大火，获赠#reward#。",},  
    [58] = {401,8,1,1,8,13020,"藏宝阁阁主让【#knight#】在随意挑选阁内珍宝，【#knight#】并不贪心，只取了一些#reward#。",},  
    [59] = {401,9,1,1,1,3,"【#knight#】与许昌守备大将许褚比拼武艺，许褚输了#reward#。",},  
    [60] = {401,10,1,2,0,0,"【#knight#】在码头出发现一些无人认领的箱子，打开发现是#reward#。",},  
    [61] = {401,11,2,1,999,0,"因为帮助荀彧修缮大门机关，【#knight#】获得感激，赠送其#reward#。",},  
    [62] = {401,12,2,1,1,3,"一个小商人入城，【#knight#】收缴商税，获得#reward#。",},  
    [63] = {401,13,2,1,4,500020,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [64] = {401,14,2,1,4,500040,"雷雨之夜，【#knight#】在城门空遇到一位戴着赤色眼罩的青年，乃名将#reward#来投诚。",},  
    [65] = {401,15,2,1,4,500030,"贼寇入城，【#knight#】在城中广场召集青壮年以抵御，勇力绝人的#reward#第一个前来。",},  
    [66] = {401,16,2,1,4,500050,"城内粮草即将用完，【#knight#】正欲禀告主公，却得知#reward#已将粮草运送至城南粮仓。",},  
    [67] = {401,17,2,1,4,500060,"【#knight#】在城中立下比武擂台，挑战天下高手，名将#reward#慕名而来。",},  
    [68] = {401,18,2,2,0,0,"一队商贩入城，【#knight#】收缴商税，获得#reward#。",},  
    [69] = {501,1,1,1,999,0,"流星击中刘表宅邸，致其失火，【#knight#】率部灭火救出宅主，得赠#reward#。",},  
    [70] = {501,2,1,1,1,3,"【#knight#】征讨荆州流寇，流寇落荒而逃，得到遗落的#reward#。",},  
    [71] = {501,3,1,1,3,28,"一夜天降流星，坠落与地，光芒照耀四方，【#knight#】前往挖掘，获得#reward#。",},  
    [72] = {501,4,1,1,3,27,"又一夜，天缀流火于小溪，【#knight#】前往探查，获得#reward#。",},  
    [73] = {501,5,1,1,3,26,"布庄汪老板丢失了爱子，【#knight#】找到男童送了回去，汪老板送他很多#reward#。",},  
    [74] = {501,6,1,1,3,35,"汪老板的儿子想和【#knight#】学习武艺，这拜师礼物是#reward#。",},  
    [75] = {501,7,1,1,3,32,"在【#knight#】的悉心指导下，汪老板的儿子武艺突进，汪老板十分高兴，送来#reward#。",},  
    [76] = {501,8,1,1,1,3,"荆州异象连连，太守刘表派【#knight#】前往祭祀，获得#reward#。",},  
    [77] = {501,9,1,2,0,0,"【#knight#】在码头出发现一些无人认领的箱子，打开发现是#reward#。",},  
    [78] = {501,10,2,1,999,0,"有幼童坠入城东镜湖，【#knight#】凭借好水性救起了孩子，得其父母酬谢#reward#。",},  
    [79] = {501,11,2,1,1,3,"【#knight#】在集市抓获一伙小贼，共有三人，搜身得赃款#reward#。",},  
    [80] = {501,12,2,1,4,500190,"【#knight#】访遍城中名医却找不到可控疫情之人，愁眉难展之际，#reward#前来相助。",},  
    [81] = {501,13,2,1,4,500100,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [82] = {501,14,2,1,4,510040,"听闻有白衣少年在城门练枪，【#knight#】赶去探查，原来是名将#reward#前来投诚。",},  
    [83] = {501,15,2,1,4,500160,"【#knight#】在城中张贴招贤榜，以招纳天下贤才，名将#reward#揭榜来投。",},  
    [84] = {501,16,2,1,4,500210,"【#knight#】巡逻至城郊见一精舍，听见有人在读道书，正欲敲门，#reward#迎了出来。",},  
    [85] = {501,17,2,2,0,0,"【#knight#】在码头出发现一些无人认领的箱子，打开发现是#reward#。",},
    }
}

local __index_id_num = {   
    ["101_1"] = 1,  
    ["101_2"] = 2,  
    ["101_3"] = 3,  
    ["101_4"] = 4,  
    ["101_5"] = 5,  
    ["101_6"] = 6,  
    ["101_7"] = 7,  
    ["101_8"] = 8,  
    ["101_9"] = 9,  
    ["101_10"] = 10,  
    ["101_11"] = 11,  
    ["101_12"] = 12,  
    ["101_13"] = 13,  
    ["101_14"] = 14,  
    ["101_15"] = 15,  
    ["101_16"] = 16,  
    ["201_1"] = 17,  
    ["201_2"] = 18,  
    ["201_3"] = 19,  
    ["201_4"] = 20,  
    ["201_5"] = 21,  
    ["201_6"] = 22,  
    ["201_7"] = 23,  
    ["201_8"] = 24,  
    ["201_9"] = 25,  
    ["201_10"] = 26,  
    ["201_11"] = 27,  
    ["201_12"] = 28,  
    ["201_13"] = 29,  
    ["201_14"] = 30,  
    ["201_15"] = 31,  
    ["201_16"] = 32,  
    ["301_1"] = 33,  
    ["301_2"] = 34,  
    ["301_3"] = 35,  
    ["301_4"] = 36,  
    ["301_5"] = 37,  
    ["301_6"] = 38,  
    ["301_7"] = 39,  
    ["301_8"] = 40,  
    ["301_9"] = 41,  
    ["301_10"] = 42,  
    ["301_11"] = 43,  
    ["301_12"] = 44,  
    ["301_13"] = 45,  
    ["301_14"] = 46,  
    ["301_15"] = 47,  
    ["301_16"] = 48,  
    ["301_17"] = 49,  
    ["301_18"] = 50,  
    ["401_1"] = 51,  
    ["401_2"] = 52,  
    ["401_3"] = 53,  
    ["401_4"] = 54,  
    ["401_5"] = 55,  
    ["401_6"] = 56,  
    ["401_7"] = 57,  
    ["401_8"] = 58,  
    ["401_9"] = 59,  
    ["401_10"] = 60,  
    ["401_11"] = 61,  
    ["401_12"] = 62,  
    ["401_13"] = 63,  
    ["401_14"] = 64,  
    ["401_15"] = 65,  
    ["401_16"] = 66,  
    ["401_17"] = 67,  
    ["401_18"] = 68,  
    ["501_1"] = 69,  
    ["501_2"] = 70,  
    ["501_3"] = 71,  
    ["501_4"] = 72,  
    ["501_5"] = 73,  
    ["501_6"] = 74,  
    ["501_7"] = 75,  
    ["501_8"] = 76,  
    ["501_9"] = 77,  
    ["501_10"] = 78,  
    ["501_11"] = 79,  
    ["501_12"] = 80,  
    ["501_13"] = 81,  
    ["501_14"] = 82,  
    ["501_15"] = 83,  
    ["501_16"] = 84,  
    ["501_17"] = 85,
}

local __key_map = { 
    id = 1,
    num = 2,
    event_type = 3,
    direction_type = 4,
    reward_type = 5,
    reward_value = 6,
    description = 7,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_city_process_event_info")

        return t._raw[__key_map[k]]
    end
}


function city_process_event_info.getLength()
    return #city_process_event_info._data
end



function city_process_event_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_city_process_event_info
function city_process_event_info.indexOf(index)
    if index == nil or not city_process_event_info._data[index] then
        return nil
    end
    return setmetatable({_raw = city_process_event_info._data[index]}, m)
end



---
--@return @class record_city_process_event_info
function city_process_event_info.get(id,num)
    
    local k = id .. '_' .. num
    return city_process_event_info.indexOf(__index_id_num[k])
     
end



function city_process_event_info.set(id,num, key, value)
    local record = city_process_event_info.get(id,num)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function city_process_event_info.get_index_data()
    return __index_id_num 
end

return  city_process_event_info 