---@classdef record_dungeon_land_info
local record_dungeon_land_info = {}


record_dungeon_land_info.id = 0--id
record_dungeon_land_info.next_id = 0--下个章节
record_dungeon_land_info.number =  ""--版块序号
record_dungeon_land_info.name =  ""--版块名称
record_dungeon_land_info.stage_map = 0--板块地图文件
record_dungeon_land_info.ctrl_id = 0--章节配置文件
record_dungeon_land_info.chapter_1 = 0--章节1
record_dungeon_land_info.chapter_2 = 0--章节2
record_dungeon_land_info.chapter_3 = 0--章节3
record_dungeon_land_info.chapter_4 = 0--章节4
record_dungeon_land_info.chapter_5 = 0--章节5
record_dungeon_land_info.chapter_6 = 0--章节6
record_dungeon_land_info.chapter_7 = 0--章节7
record_dungeon_land_info.chapter_8 = 0--章节8
record_dungeon_land_info.chapter_9 = 0--章节9
record_dungeon_land_info.chapter_10 = 0--章节10
record_dungeon_land_info.city_id = 0--封地ID

local dungeon_land_info = {
   _data = {   
    [1] = {1,2,"一","初到三国",1,101,1,2,3,4,5,0,0,0,0,0,0,},  
    [2] = {2,3,"二","诸侯危机",2,204,6,7,8,9,10,0,0,0,0,0,10,},  
    [3] = {3,4,"三","火烧洛阳",3,301,11,12,13,14,15,0,0,0,0,0,0,},  
    [4] = {4,5,"四","诸侯散盟",4,402,16,17,18,19,20,0,0,0,0,0,20,},  
    [5] = {5,6,"五","长安风云",5,501,21,22,23,24,25,0,0,0,0,0,0,},  
    [6] = {6,7,"六","吕布称雄",2,204,26,27,28,29,30,0,0,0,0,0,30,},  
    [7] = {7,8,"七","雄据江东",1,101,31,32,33,34,35,0,0,0,0,0,0,},  
    [8] = {8,9,"八","天下大旱",4,402,36,37,38,39,40,0,0,0,0,0,40,},  
    [9] = {9,10,"九","奉迎天子",3,301,41,42,43,44,45,0,0,0,0,0,0,},  
    [10] = {10,11,"十","宛城兵败",5,501,46,47,48,49,50,0,0,0,0,0,0,},  
    [11] = {11,12,"十一","兴兵徐州",2,204,51,52,53,54,55,0,0,0,0,0,50,},  
    [12] = {12,13,"十二","吕布枭首",3,301,56,57,58,59,60,0,0,0,0,0,0,},  
    [13] = {13,14,"十三","袁曹初争",1,101,61,62,63,64,65,0,0,0,0,0,0,},  
    [14] = {14,15,"十四","猛虎陨落",4,403,66,67,68,69,70,0,0,0,0,0,0,},  
    [15] = {15,16,"十五","衣带血诏",5,501,71,72,73,74,75,0,0,0,0,0,0,},  
    [16] = {16,17,"十六","东征刘备",1,101,76,77,78,79,80,0,0,0,0,0,0,},  
    [17] = {17,18,"十七","五关六将",3,301,81,82,83,84,85,0,0,0,0,0,0,},  
    [18] = {18,19,"十八","官渡之战",2,205,86,87,88,89,90,0,0,0,0,0,0,},  
    [19] = {19,20,"十九","火烧乌巢",5,501,91,92,93,94,95,0,0,0,0,0,0,},  
    [20] = {20,21,"二十","十面埋伏",4,403,96,97,98,99,100,0,0,0,0,0,0,},  
    [21] = {21,22,"二十一","袁绍之死",2,205,101,102,103,104,105,0,0,0,0,0,0,},  
    [22] = {22,23,"二十二","邺城之围",1,101,106,107,108,109,110,0,0,0,0,0,0,},  
    [23] = {23,24,"二十三","鬼才陨落",5,501,111,112,113,114,115,0,0,0,0,0,0,},  
    [24] = {24,25,"二十四","刀剑相向",3,301,116,117,118,119,120,0,0,0,0,0,0,},  
    [25] = {25,26,"二十五","落难之交",1,101,121,122,123,124,125,0,0,0,0,0,0,},  
    [26] = {26,27,"二十六","峰回路转",2,205,126,127,128,129,130,0,0,0,0,0,0,},  
    [27] = {27,28,"二十七","三顾茅庐",5,501,131,132,133,134,135,0,0,0,0,0,0,},  
    [28] = {28,29,"二十八","卧龙出山",2,205,136,137,138,139,140,0,0,0,0,0,0,},  
    [29] = {29,30,"二十九","单骑救主",3,301,141,142,143,144,145,0,0,0,0,0,0,},  
    [30] = {30,31,"三十","联吴抗曹",1,101,146,147,148,149,150,0,0,0,0,0,0,},  
    [31] = {31,32,"三十一","孙刘联合",4,403,151,152,153,154,155,0,0,0,0,0,0,},  
    [32] = {32,33,"三十二","隔江对峙",5,501,156,157,158,159,160,0,0,0,0,0,0,},  
    [33] = {33,34,"三十三","奇谋频出",1,101,161,162,163,164,165,0,0,0,0,0,0,},  
    [34] = {34,35,"三十四","连环火攻",3,301,166,167,168,169,170,0,0,0,0,0,0,},  
    [35] = {35,36,"三十五","火烧赤壁",2,205,171,172,173,174,175,0,0,0,0,0,0,},  
    [36] = {36,37,"三十六","南郡之争",5,501,176,177,178,179,180,0,0,0,0,0,0,},  
    [37] = {37,38,"三十七","合淝之战",2,205,181,182,183,184,185,0,0,0,0,0,0,},  
    [38] = {38,39,"三十八","荆州攻伐",3,301,186,187,188,189,190,0,0,0,0,0,0,},  
    [39] = {39,40,"三十九","战长沙",1,101,191,192,193,194,195,0,0,0,0,0,0,},  
    [40] = {40,41,"四十","借荆州",4,403,196,197,198,199,200,0,0,0,0,0,0,},  
    [41] = {41,42,"四十一","图谋西川",3,301,201,202,203,204,205,0,0,0,0,0,0,},  
    [42] = {42,43,"四十二","出兵蜀中",1,101,206,207,208,209,210,0,0,0,0,0,0,},  
    [43] = {43,44,"四十三","东窗事发",5,501,211,212,213,214,215,0,0,0,0,0,0,},  
    [44] = {44,45,"四十四","转守为攻",1,101,216,217,218,219,220,0,0,0,0,0,0,},  
    [45] = {45,46,"四十五","庞统之死",3,301,221,222,223,224,225,0,0,0,0,0,0,},  
    [46] = {46,47,"四十六","孔明入蜀",2,205,226,227,228,229,230,0,0,0,0,0,0,},  
    [47] = {47,48,"四十七","义释严颜",1,101,231,232,233,234,235,0,0,0,0,0,0,},  
    [48] = {48,49,"四十八","雒城之战",3,301,236,237,238,239,240,0,0,0,0,0,0,},  
    [49] = {49,50,"四十九","大战马超",1,101,241,242,243,244,245,0,0,0,0,0,0,},  
    [50] = {50,51,"五十","兵围成都",5,501,246,247,248,249,250,0,0,0,0,0,0,},  
    [51] = {51,52,"五十一","从严治蜀",4,403,251,252,253,254,255,0,0,0,0,0,0,},  
    [52] = {52,0,"五十二","孙刘联盟",2,205,256,257,258,259,260,0,0,0,0,0,0,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,
}

local __key_map = { 
    id = 1,
    next_id = 2,
    number = 3,
    name = 4,
    stage_map = 5,
    ctrl_id = 6,
    chapter_1 = 7,
    chapter_2 = 8,
    chapter_3 = 9,
    chapter_4 = 10,
    chapter_5 = 11,
    chapter_6 = 12,
    chapter_7 = 13,
    chapter_8 = 14,
    chapter_9 = 15,
    chapter_10 = 16,
    city_id = 17,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_dungeon_land_info")

        return t._raw[__key_map[k]]
    end
}


function dungeon_land_info.getLength()
    return #dungeon_land_info._data
end



function dungeon_land_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_dungeon_land_info
function dungeon_land_info.indexOf(index)
    if index == nil or not dungeon_land_info._data[index] then
        return nil
    end
    return setmetatable({_raw = dungeon_land_info._data[index]}, m)
end



---
--@return @class record_dungeon_land_info
function dungeon_land_info.get(id)
    
    return dungeon_land_info.indexOf(__index_id[ id ])
     
end



function dungeon_land_info.set(id, key, value)
    local record = dungeon_land_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function dungeon_land_info.get_index_data()
    return __index_id 
end

return  dungeon_land_info 