---@classdef record_elite_dungeon_chest_info
local record_elite_dungeon_chest_info = {}


record_elite_dungeon_chest_info.id = 0--id
record_elite_dungeon_chest_info.chest_type = 0--宝箱类型
record_elite_dungeon_chest_info.unlock = 0--领取条件
record_elite_dungeon_chest_info.unlock_seen = 0--显示条件
record_elite_dungeon_chest_info.res = 0--资源
record_elite_dungeon_chest_info.reward_type_1 = 0--奖励1类型
record_elite_dungeon_chest_info.reward_value_1 = 0--奖励1类型值
record_elite_dungeon_chest_info.reward_size_1 = 0--奖励1数量
record_elite_dungeon_chest_info.reward_type_2 = 0--奖励2类型
record_elite_dungeon_chest_info.reward_value_2 = 0--奖励2类型值
record_elite_dungeon_chest_info.reward_size_2 = 0--奖励2数量
record_elite_dungeon_chest_info.reward_type_3 = 0--奖励3类型
record_elite_dungeon_chest_info.reward_value_3 = 0--奖励3类型值
record_elite_dungeon_chest_info.reward_size_3 = 0--奖励3数量
record_elite_dungeon_chest_info.reward_type_4 = 0--奖励4类型
record_elite_dungeon_chest_info.reward_value_4 = 0--奖励4类型值
record_elite_dungeon_chest_info.reward_size_4 = 0--奖励4数量

local elite_dungeon_chest_info = {
   _data = {   
    [1] = {1,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [2] = {2,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [3] = {3,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [4] = {4,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [5] = {5,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [6] = {6,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [7] = {7,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [8] = {8,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [9] = {9,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [10] = {10,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [11] = {11,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [12] = {12,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [13] = {13,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [14] = {14,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [15] = {15,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [16] = {16,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [17] = {17,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [18] = {18,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [19] = {19,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [20] = {20,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [21] = {21,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [22] = {22,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [23] = {23,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [24] = {24,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [25] = {25,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [26] = {26,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [27] = {27,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [28] = {28,1,10,0,1,999,0,688,0,0,0,0,0,0,0,0,0,},  
    [29] = {29,1,20,0,1,999,0,888,0,0,0,0,0,0,0,0,0,},  
    [30] = {30,1,30,0,1,999,0,1088,0,0,0,0,0,0,0,0,0,},  
    [31] = {10001,2,190103,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [32] = {10002,2,190106,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [33] = {10003,2,190109,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [34] = {10004,2,190203,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [35] = {10005,2,190206,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [36] = {10006,2,190209,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [37] = {10007,2,190303,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [38] = {10008,2,190306,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [39] = {10009,2,190309,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [40] = {10010,2,190403,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [41] = {10011,2,190406,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [42] = {10012,2,190409,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [43] = {10013,2,190503,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [44] = {10014,2,190506,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [45] = {10015,2,190509,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [46] = {10016,2,190603,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [47] = {10017,2,190606,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [48] = {10018,2,190609,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [49] = {10019,2,190703,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [50] = {10020,2,190706,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [51] = {10021,2,190709,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [52] = {10022,2,190803,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [53] = {10023,2,190806,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [54] = {10024,2,190809,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [55] = {10025,2,190903,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [56] = {10026,2,190906,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [57] = {10027,2,190909,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},  
    [58] = {10028,2,191003,0,1,3,201,2,3,202,800,0,0,0,0,0,0,},  
    [59] = {10029,2,191006,0,1,3,201,2,3,202,1500,0,0,0,0,0,0,},  
    [60] = {10030,2,191009,0,1,3,205,3,3,202,2500,0,0,0,0,0,0,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [10001] = 31,  
    [10002] = 32,  
    [10003] = 33,  
    [10004] = 34,  
    [10005] = 35,  
    [10006] = 36,  
    [10007] = 37,  
    [10008] = 38,  
    [10009] = 39,  
    [10010] = 40,  
    [10011] = 41,  
    [10012] = 42,  
    [10013] = 43,  
    [10014] = 44,  
    [10015] = 45,  
    [10016] = 46,  
    [10017] = 47,  
    [10018] = 48,  
    [10019] = 49,  
    [10020] = 50,  
    [10021] = 51,  
    [10022] = 52,  
    [10023] = 53,  
    [10024] = 54,  
    [10025] = 55,  
    [10026] = 56,  
    [10027] = 57,  
    [10028] = 58,  
    [10029] = 59,  
    [10030] = 60,
}

local __key_map = { 
    id = 1,
    chest_type = 2,
    unlock = 3,
    unlock_seen = 4,
    res = 5,
    reward_type_1 = 6,
    reward_value_1 = 7,
    reward_size_1 = 8,
    reward_type_2 = 9,
    reward_value_2 = 10,
    reward_size_2 = 11,
    reward_type_3 = 12,
    reward_value_3 = 13,
    reward_size_3 = 14,
    reward_type_4 = 15,
    reward_value_4 = 16,
    reward_size_4 = 17,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_elite_dungeon_chest_info")

        return t._raw[__key_map[k]]
    end
}


function elite_dungeon_chest_info.getLength()
    return #elite_dungeon_chest_info._data
end



function elite_dungeon_chest_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_elite_dungeon_chest_info
function elite_dungeon_chest_info.indexOf(index)
    if index == nil or not elite_dungeon_chest_info._data[index] then
        return nil
    end
    return setmetatable({_raw = elite_dungeon_chest_info._data[index]}, m)
end



---
--@return @class record_elite_dungeon_chest_info
function elite_dungeon_chest_info.get(id)
    
    return elite_dungeon_chest_info.indexOf(__index_id[ id ])
     
end



function elite_dungeon_chest_info.set(id, key, value)
    local record = elite_dungeon_chest_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function elite_dungeon_chest_info.get_index_data()
    return __index_id 
end

return  elite_dungeon_chest_info 