---@classdef record_equipment_info
local record_equipment_info = {}


record_equipment_info.id = 0--装备ID
record_equipment_info.name =  ""--装备名称
record_equipment_info.advance_id = 0--升阶码
record_equipment_info.type = 0--装备类型
record_equipment_info.quality = 0--品质
record_equipment_info.rare = 0--稀有
record_equipment_info.potential = 0--资质
record_equipment_info.magic_level = 0--幻化等级
record_equipment_info.next_id = 0--幻化后ID
record_equipment_info.cost_size = 0--幻化消耗碎片数量
record_equipment_info.magic_talent_1 = 0--幻化天赋1
record_equipment_info.magic_talent_2 = 0--幻化天赋2
record_equipment_info.magic_talent_3 = 0--幻化天赋3
record_equipment_info.fire_passive_skill = 0--火系幻化被动技能
record_equipment_info.water_passive_skill = 0--水系幻化被动技能
record_equipment_info.dot_id = 0--点化组
record_equipment_info.casting_id = 0--铸灵
record_equipment_info.put = 0--是否投放
record_equipment_info.res_id = 0--资源ID
record_equipment_info.fire_res_id = 0--火系资源ID
record_equipment_info.water_res_id = 0--水系资源ID
record_equipment_info.suit_id = 0--套装关联ID
record_equipment_info.strength_type = 0--强化属性类型
record_equipment_info.strength_value = 0--初始强化属性类型值
record_equipment_info.strength_growth = 0--属性成长率
record_equipment_info.money_1 = 0--强化花费系数1
record_equipment_info.money_2 = 0--强化花费系数2
record_equipment_info.refine_level = 0--精炼等级上限
record_equipment_info.refining_type_1 = 0--精练属性类型1
record_equipment_info.refining_value_1 = 0--初始精练属性类型值1
record_equipment_info.refining_growth_1 = 0--成长值1
record_equipment_info.refining_type_2 = 0--精练属性类型2
record_equipment_info.refining_value_2 = 0--初始精练属性类型值2
record_equipment_info.refining_growth_2 = 0--成长值2
record_equipment_info.refining_exp_1 = 0--精练需求经验成长系数1
record_equipment_info.refining_exp_2 = 0--精练需求经验成长系数2
record_equipment_info.is_sell = 0--是否可以出售
record_equipment_info.price_type = 0--出售类型
record_equipment_info.price_value = 0--出售类型值
record_equipment_info.price_size = 0--出售货币数量
record_equipment_info.fragment_id = 0--碎片id
record_equipment_info.talent_skill_1 = 0--装备天赋1
record_equipment_info.talent_skill_2 = 0--装备天赋2
record_equipment_info.talent_skill_3 = 0--装备天赋3
record_equipment_info.talent_skill_4 = 0--装备天赋4
record_equipment_info.talent_skill_5 = 0--装备天赋5
record_equipment_info.talent_skill_6 = 0--装备天赋6
record_equipment_info.talent_skill_7 = 0--装备天赋7
record_equipment_info.talent_skill_8 = 0--装备天赋8
record_equipment_info.talent_skill_9 = 0--装备天赋9
record_equipment_info.talent_skill_10 = 0--装备天赋10
record_equipment_info.gm = 0--GM后台是否可发
record_equipment_info.description =  ""--装备描述
record_equipment_info.is_resolve = 0--是否可以分解
record_equipment_info.resolve_type_1 = 0--分解类型1
record_equipment_info.resolve_value_1 = 0--分解类型值1
record_equipment_info.resolve_size_1 = 0--分解数量1
record_equipment_info.resolve_type_2 = 0--分解类型2
record_equipment_info.resolve_value_2 = 0--分解类型值2
record_equipment_info.resolve_size_2 = 0--分解数量2
record_equipment_info.equipment_glyph = 0--雕纹
record_equipment_info.remind_size = 0--GM后台数量提示

local equipment_info = {
   _data = {   
    [1] = {1,"测试战戟",1,1,5,0,35,0,0,0,0,0,0,0,0,0,0,1,421,421,421,420,2,99999999,2560,1000,2000,80,207,2000,500,12,200,50,50,100,0,1,6,10,1,0,0,0,0,0,0,0,0,0,0,1,"测试武器",1,1,6,10,0,0,0,1,1,},  
    [2] = {2,"测试战靴",2,2,5,0,35,0,0,0,0,0,0,0,0,0,0,1,422,422,422,420,1,999999999,25600,1000,2000,80,208,2000,500,11,200,50,50,100,0,1,6,10,2,0,0,0,0,0,0,0,0,0,0,1,"测试腰带",1,1,6,10,0,0,0,1,1,},  
    [3] = {3,"测试战甲",3,3,5,0,35,0,0,0,0,0,0,0,0,0,0,1,423,423,423,420,3,999999999,1280,1000,2000,80,101,2000,500,13,200,50,50,100,0,1,6,10,3,0,0,0,0,0,0,0,0,0,0,1,"测试铠甲",1,1,6,10,0,0,0,1,1,},  
    [4] = {4,"测试头盔",4,4,5,0,35,0,0,0,0,0,0,0,0,0,0,1,424,424,424,420,4,999999999,1280,1000,2000,80,106,2000,500,14,200,50,50,100,0,1,6,10,4,0,0,0,0,0,0,0,0,0,0,1,"测试头盔",1,1,6,10,0,0,0,1,1,},  
    [5] = {101,"百炼刀",101,1,3,0,6,0,0,0,0,0,0,0,0,0,0,1,101,101,101,0,2,200,10,15,15,10,2,0,96,12,0,10,100,0,1,1,6,100,0,0,0,0,0,0,0,0,0,0,0,1,"百炼套装部件，通体以精铁锻造而成，普通士卒常用兵器",1,1,6,100,0,0,0,2,10,},  
    [6] = {102,"百炼靴",102,2,3,0,6,0,0,0,0,0,0,0,0,0,0,1,102,102,102,0,1,4000,190,15,15,10,1,0,1824,11,0,10,100,0,1,1,6,100,0,0,0,0,0,0,0,0,0,0,0,1,"百炼套装部件，靴面以麻布织就，靴底以精铁相嵌，穿着舒适。",1,1,6,100,0,0,0,1,10,},  
    [7] = {103,"百炼甲",103,3,3,0,6,0,0,0,0,0,0,0,0,0,0,1,103,103,103,0,3,100,5,15,15,10,3,0,48,13,0,10,100,0,1,1,6,100,0,0,0,0,0,0,0,0,0,0,0,1,"百炼套装部件，甲片全用精铁锻造，能提供一定的防护力",1,1,6,100,0,0,0,3,10,},  
    [8] = {104,"百炼盔",104,4,3,0,6,0,0,0,0,0,0,0,0,0,0,1,104,104,104,0,4,100,5,15,15,10,4,0,48,14,0,10,100,0,1,1,6,100,0,0,0,0,0,0,0,0,0,0,0,1,"百炼套装部件，用精铁锻造的头盔，普通士卒常用防具。",1,1,6,100,0,0,0,4,10,},  
    [9] = {201,"烈焰弓",201,1,4,0,8,0,0,0,0,0,0,0,0,0,0,1,201,201,201,200,2,600,24,30,15,20,2,0,180,12,0,10,140,0,1,1,6,1000,201,0,0,0,0,0,0,0,0,0,0,1,"烈焰套装部件，用玄铜制造的强弓，其射出的箭支力道惊人。",1,1,6,1000,0,0,0,6,10,},  
    [10] = {202,"烈焰鞋",202,2,4,0,8,0,0,0,0,0,0,0,0,0,0,1,202,202,202,200,1,12000,456,30,15,20,1,0,3420,11,0,10,140,0,1,1,6,1000,202,0,0,0,0,0,0,0,0,0,0,1,"烈焰套装部件，棉布为衬，银丝镶边，外镶甲片，穿着美观轻便",1,1,6,1000,0,0,0,5,10,},  
    [11] = {203,"烈焰甲",203,3,4,0,8,0,0,0,0,0,0,0,0,0,0,1,203,203,203,200,3,300,12,30,15,20,3,0,90,13,0,10,140,0,1,1,6,1000,203,0,0,0,0,0,0,0,0,0,0,1,"烈焰套装部件，通体以玄铜炼制，外绣火焰图案，古朴美观。",1,1,6,1000,0,0,0,7,10,},  
    [12] = {204,"烈焰盔",204,4,4,0,8,0,0,0,0,0,0,0,0,0,0,1,204,204,204,200,4,300,12,30,15,20,4,0,90,14,0,10,140,0,1,1,6,1000,204,0,0,0,0,0,0,0,0,0,0,1,"烈焰套装部件，以玄铜炼制的头盔，顶部缀以红缨，穿戴舒适。",1,1,6,1000,0,0,0,8,10,},  
    [13] = {211,"寒光锤",211,1,4,0,8,0,0,0,0,0,0,0,0,0,0,1,211,211,211,210,2,600,24,30,15,20,2,0,180,12,0,10,140,0,1,1,6,1000,211,0,0,0,0,0,0,0,0,0,0,1,"寒光套装部件，以寒铁锻造的巨锤，外表突出尖刺，狰狞刺骨。",1,1,6,1000,0,0,0,6,10,},  
    [14] = {212,"寒光靴",212,2,4,0,8,0,0,0,0,0,0,0,0,0,0,1,212,212,212,210,1,12000,456,30,15,20,1,0,3420,11,0,10,140,0,1,1,6,1000,212,0,0,0,0,0,0,0,0,0,0,1,"寒光套装部件，鞋子通体以寒铁锻造，内衬棉布，穿戴舒适。",1,1,6,1000,0,0,0,5,10,},  
    [15] = {213,"寒光甲",213,3,4,0,8,0,0,0,0,0,0,0,0,0,0,1,213,213,213,210,3,300,12,30,15,20,3,0,90,13,0,10,140,0,1,1,6,1000,213,0,0,0,0,0,0,0,0,0,0,1,"寒光套装部件，通体使用寒铁铸造，入手沉重冰寒，具备不错的防护力。",1,1,6,1000,0,0,0,7,10,},  
    [16] = {214,"寒光盔",214,4,4,0,8,0,0,0,0,0,0,0,0,0,0,1,214,214,214,210,4,300,12,30,15,20,4,0,90,14,0,10,140,0,1,1,6,1000,214,0,0,0,0,0,0,0,0,0,0,1,"寒光套装部件，使用寒铁锻造的头盔，入手冰寒，能有效保护头部。",1,1,6,1000,0,0,0,8,10,},  
    [17] = {301,"血战利斧",301,1,5,0,10,0,0,0,0,0,0,0,0,0,0,1,301,301,301,300,2,1950,90,70,20,30,2,0,540,12,0,10,180,0,1,1,6,7500,301,0,0,0,0,0,0,0,0,0,0,1,"血战套装部件，通体由乌金锻造，因斧刃黑红宛若鲜血残渍，故名。",1,1,6,7500,0,0,0,10,10,},  
    [18] = {302,"血战长靴",302,2,5,0,10,0,0,0,0,0,0,0,0,0,0,1,302,302,302,300,1,37500,1710,70,20,30,1,0,10260,11,0,10,180,0,1,1,6,7500,302,0,0,0,0,0,0,0,0,0,0,1,"血战套装部件，鞋面由牛皮缝制，外以乌金拉丝装饰，利于疾跑迎战",1,1,6,7500,0,0,0,9,10,},  
    [19] = {303,"血战锁甲",303,3,5,0,10,0,0,0,0,0,0,0,0,0,0,1,303,303,303,300,3,975,45,70,20,30,3,0,270,13,0,10,180,0,1,1,6,7500,303,0,0,0,0,0,0,0,0,0,0,1,"血战套装部件，以乌金混杂白银拉丝编织而成，穿戴舒适，造型威严。",1,1,6,7500,0,0,0,11,10,},  
    [20] = {304,"血战头盔",304,4,5,0,10,0,0,0,0,0,0,0,0,0,0,1,304,304,304,300,4,975,45,70,20,30,4,0,270,14,0,10,180,0,1,1,6,7500,304,0,0,0,0,0,0,0,0,0,0,1,"血战套装部件，使用乌金锻造而成，内衬羊皮，造型精美，穿戴舒适。",1,1,6,7500,0,0,0,12,10,},  
    [21] = {311,"破军战枪",311,1,5,0,10,0,0,0,0,0,0,0,0,0,0,1,311,311,311,310,2,1950,90,70,20,30,2,0,540,12,0,10,180,0,1,1,6,7500,311,0,0,0,0,0,0,0,0,0,0,1,"破军套装部件，通体以玄铁制造，枪头梭形上尖，下部有倒钩，常用来对付冲锋骑兵",1,1,6,7500,0,0,0,10,10,},  
    [22] = {312,"破军长靴",312,2,5,0,10,0,0,0,0,0,0,0,0,0,0,1,312,312,312,310,1,37500,1710,70,20,30,1,0,10260,11,0,10,180,0,1,1,6,7500,312,0,0,0,0,0,0,0,0,0,0,1,"破军套装部件，通体用寒铁锻造，外镶乌金装饰，内衬牛皮，穿戴舒适。",1,1,6,7500,0,0,0,9,10,},  
    [23] = {313,"破军锁甲",313,3,5,0,10,0,0,0,0,0,0,0,0,0,0,1,313,313,313,310,3,975,45,70,20,30,3,0,270,13,0,10,180,0,1,1,6,7500,313,0,0,0,0,0,0,0,0,0,0,1,"破军套装部件，采用寒铁与乌金锻造，造型凶猛，拥有出色的防御力。",1,1,6,7500,0,0,0,11,10,},  
    [24] = {314,"破军面甲",314,4,5,0,10,0,0,0,0,0,0,0,0,0,0,1,314,314,314,310,4,975,45,70,20,30,4,0,270,14,0,10,180,0,1,1,6,7500,314,0,0,0,0,0,0,0,0,0,0,1,"破军套装部件，面具采用玄铁混杂玉砂锻造，造型宛若妖魔，凶悍威猛",1,1,6,7500,0,0,0,12,10,},  
    [25] = {401,"朱雀羽扇",401,1,6,0,13,0,0,0,0,0,0,0,0,0,0,1,401,401,401,400,2,7500,270,130,25,40,2,0,1620,12,0,10,230,0,1,1,6,30000,401,0,0,0,0,0,0,0,0,0,0,1,"朱雀套装部件，巧匠用异禽尾羽，并乌金拉丝编成，扇动时宛若浴火朱雀。",0,1,6,30000,0,0,0,14,10,},  
    [26] = {402,"朱雀步履",402,2,6,0,13,0,0,0,0,0,0,0,0,0,0,1,402,402,402,400,1,150000,5130,130,25,40,1,0,30780,11,0,10,230,0,1,1,6,30000,402,0,0,0,0,0,0,0,0,0,0,1,"朱雀套装部件，巧匠用真丝彩线缝制而成，上面镶有玄铁甲片，穿着舒适尊贵",0,1,6,30000,0,0,0,13,10,},  
    [27] = {403,"朱雀法袍",403,3,6,0,13,0,0,0,0,0,0,0,0,0,0,1,403,403,403,400,3,3750,135,130,25,40,3,0,810,13,0,10,230,0,1,1,6,30000,403,0,0,0,0,0,0,0,0,0,0,1,"朱雀套装部件，巧匠以金丝、豹虎毛裘缝制，其上绣有朱雀。造型华贵飘逸。",0,1,6,30000,0,0,0,15,10,},  
    [28] = {404,"朱雀发冠",404,4,6,0,13,0,0,0,0,0,0,0,0,0,0,1,404,404,404,400,4,3750,135,130,25,40,4,0,810,14,0,10,230,0,1,1,6,30000,404,0,0,0,0,0,0,0,0,0,0,1,"朱雀套装部件，巧匠以金丝、云锦缝制，其上镶以宝石，穿戴尽显儒雅。",0,1,6,30000,0,0,0,16,10,},  
    [29] = {411,"霸王神剑",411,1,6,0,13,0,0,0,0,0,0,0,0,0,0,1,411,411,411,410,2,7500,270,130,25,40,2,0,1620,12,0,10,230,0,1,1,6,30000,411,0,0,0,0,0,0,0,0,0,0,1,"霸王套装部件，名匠以玄铁混乌金锻造，重达百斤，非霸王神力无法使用。",0,1,6,30000,0,0,0,14,10,},  
    [30] = {412,"霸王战靴",412,2,6,0,13,0,0,0,0,0,0,0,0,0,0,1,412,412,412,410,1,150000,5130,130,25,40,1,0,30780,11,0,10,230,0,1,1,6,30000,412,0,0,0,0,0,0,0,0,0,0,1,"霸王套装部件，名匠用玄铁乌金锻造的长靴，内垫虎皮，穿戴沉重，力道惊人。",0,1,6,30000,0,0,0,13,10,},  
    [31] = {413,"霸王重甲",413,3,6,0,13,0,0,0,0,0,0,0,0,0,0,1,413,413,413,410,3,3750,135,130,25,40,3,0,810,13,0,10,230,0,1,1,6,30000,413,0,0,0,0,0,0,0,0,0,0,1,"霸王套装部件，名匠以玄铁混乌金锻造的重甲，造型威猛狰狞，气势惊人。",0,1,6,30000,0,0,0,15,10,},  
    [32] = {414,"霸王战盔",414,4,6,0,13,0,0,0,0,0,0,0,0,0,0,1,414,414,414,410,4,3750,135,130,25,40,4,0,810,14,0,10,230,0,1,1,6,30000,414,0,0,0,0,0,0,0,0,0,0,1,"霸王套装部件，名匠用玄铁锻造，内垫虎皮，穿戴舒适且威猛。",0,1,6,30000,0,0,0,16,10,},  
    [33] = {421,"无双画戟",421,1,7,0,17,0,0,0,0,0,0,0,0,1,1001,1,421,421,421,420,2,100000,540,200,50,80,2,0,3240,12,0,10,250,0,1,1,6,75000,421,0,0,0,0,0,0,0,0,0,0,1,"无双套装部件，来历已不可考，通体为玄铁锻造，戟头尖锐带钩，杀气腾腾。",0,1,6,75000,0,0,0,18,10,},  
    [34] = {422,"无双战靴",422,2,7,0,17,0,0,0,0,0,0,0,0,2,1002,1,422,422,422,420,1,2000000,10260,200,50,80,1,0,61560,11,0,10,250,0,1,1,6,75000,422,0,0,0,0,0,0,0,0,0,0,1,"无双套装部件，来历已不可考，通体玄铁锻造，外以乌金锦缎装饰，气势十足。",0,1,6,75000,0,0,0,17,10,},  
    [35] = {423,"无双宝铠",423,3,7,0,17,0,0,0,0,0,0,0,0,3,1003,1,423,423,423,420,3,50000,270,200,50,80,3,0,1620,13,0,10,250,0,1,1,6,75000,423,0,0,0,0,0,0,0,0,0,0,1,"无双套装部件，来历已不可考，通体以玄铁锻造，外以乌金、白银装饰，异常华丽。",0,1,6,75000,0,0,0,19,10,},  
    [36] = {424,"无双金冠",424,4,7,0,17,0,0,0,0,0,0,0,0,4,1004,1,424,424,424,420,4,50000,270,200,50,80,4,0,1620,14,0,10,250,0,1,1,6,75000,424,0,0,0,0,0,0,0,0,0,0,1,"无双套装部件，来历已不可考，冠身为天蚕丝编织，顶部镶两根雉尾， 霸气凌人",0,1,6,75000,0,0,0,20,10,},  
    [37] = {5000,"不灭神镰",5000,1,8,0,21,0,5001,50,600001,600002,600003,0,0,101,1011,1,5000,5001,5002,5000,2,1200000,1620,200,50,120,2,0,9720,12,0,10,250,0,1,1,6,100000,5000,0,0,0,0,0,0,0,0,0,0,1,"不灭套装部件，刀刃以神兽骨骼经历数年打磨而制成，劈铜砍铁丝毫不伤其刃，遂唤不灭。",0,1,6,1000000,0,0,0,22,10,},  
    [38] = {5001,"不灭神镰",5000,1,8,0,21,1,5002,100,600001,600002,600003,300001,300101,101,1011,1,5000,5001,5002,5000,2,1800000,2430,200,50,120,2,0,14580,12,0,10,250,0,1,1,6,150000,5000,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，刀刃以神兽骨骼经历数年打磨而制成，劈铜砍铁丝毫不伤其刃，遂唤不灭。",0,1,6,1000000,0,0,0,22,10,},  
    [39] = {5002,"不灭神镰",5000,1,8,0,21,2,5003,150,600001,600002,600003,300002,300102,101,1011,1,5000,5001,5002,5000,2,3000000,4050,200,50,120,2,0,24300,12,0,10,250,0,1,1,6,250000,5000,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，刀刃以神兽骨骼经历数年打磨而制成，劈铜砍铁丝毫不伤其刃，遂唤不灭。",0,1,6,1000000,0,0,0,22,10,},  
    [40] = {5003,"不灭神镰",5000,1,8,0,21,3,0,0,600001,600002,600003,300003,300103,101,1011,1,5000,5001,5002,5000,2,4800000,6480,200,50,120,2,0,38880,12,0,10,250,0,1,1,6,400000,5000,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，刀刃以神兽骨骼经历数年打磨而制成，劈铜砍铁丝毫不伤其刃，遂唤不灭。",0,1,6,1000000,0,0,0,22,10,},  
    [41] = {5010,"不灭飞履",5010,2,8,0,21,0,5011,50,600011,600012,600013,0,0,102,1012,1,5010,5011,5012,5000,1,24000000,30780,200,50,120,1,0,184680,11,0,10,250,0,1,1,6,100000,5010,0,0,0,0,0,0,0,0,0,0,1,"不灭套装部件，以雏凤翎羽配合紫金打造而成，穿之舒适轻盈，健步如飞。",0,1,6,1000000,0,0,0,21,10,},  
    [42] = {5011,"不灭飞履",5010,2,8,0,21,1,5012,100,600011,600012,600013,300011,300111,102,1012,1,5010,5011,5012,5000,1,36000000,46170,200,50,120,1,0,277020,11,0,10,250,0,1,1,6,150000,5010,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，以雏凤翎羽配合紫金打造而成，穿之舒适轻盈，健步如飞。",0,1,6,1000000,0,0,0,21,10,},  
    [43] = {5012,"不灭飞履",5010,2,8,0,21,2,5013,150,600011,600012,600013,300012,300112,102,1012,1,5010,5011,5012,5000,1,60000000,76950,200,50,120,1,0,461700,11,0,10,250,0,1,1,6,250000,5010,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，以雏凤翎羽配合紫金打造而成，穿之舒适轻盈，健步如飞。",0,1,6,1000000,0,0,0,21,10,},  
    [44] = {5013,"不灭飞履",5010,2,8,0,21,3,0,0,600011,600012,600013,300013,300113,102,1012,1,5010,5011,5012,5000,1,96000000,123120,200,50,120,1,0,738720,11,0,10,250,0,1,1,6,400000,5010,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，以雏凤翎羽配合紫金打造而成，穿之舒适轻盈，健步如飞。",0,1,6,1000000,0,0,0,21,10,},  
    [45] = {5020,"不灭玄铠",5020,3,8,0,21,0,5021,50,600021,600022,600023,0,0,103,1013,1,5020,5021,5022,5000,3,600000,810,200,50,120,3,0,4860,13,0,10,250,0,1,1,6,100000,5020,0,0,0,0,0,0,0,0,0,0,1,"不灭套装部件，大师熔紫金、玄铁锻造而成，刀砍斧劈不留丝毫痕迹，坚不可摧。",0,1,6,1000000,0,0,0,23,10,},  
    [46] = {5021,"不灭玄铠",5020,3,8,0,21,1,5022,100,600021,600022,600023,300021,300121,103,1013,1,5020,5021,5022,5000,3,900000,1215,200,50,120,3,0,7290,13,0,10,250,0,1,1,6,150000,5020,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，大师熔紫金、玄铁锻造而成，刀砍斧劈不留丝毫痕迹，坚不可摧。",0,1,6,1000000,0,0,0,23,10,},  
    [47] = {5022,"不灭玄铠",5020,3,8,0,21,2,5023,150,600021,600022,600023,300022,300122,103,1013,1,5020,5021,5022,5000,3,1500000,2025,200,50,120,3,0,12150,13,0,10,250,0,1,1,6,250000,5020,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，大师熔紫金、玄铁锻造而成，刀砍斧劈不留丝毫痕迹，坚不可摧。",0,1,6,1000000,0,0,0,23,10,},  
    [48] = {5023,"不灭玄铠",5020,3,8,0,21,3,0,0,600021,600022,600023,300023,300123,103,1013,1,5020,5021,5022,5000,3,2400000,3240,200,50,120,3,0,19440,13,0,10,250,0,1,1,6,400000,5020,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，大师熔紫金、玄铁锻造而成，刀砍斧劈不留丝毫痕迹，坚不可摧。",0,1,6,1000000,0,0,0,23,10,},  
    [49] = {5030,"不灭灵盔",5030,4,8,0,21,0,5031,50,600031,600032,600033,0,0,104,1014,1,5030,5031,5032,5000,4,600000,810,200,50,120,4,0,4860,14,0,10,250,0,1,1,6,100000,5030,0,0,0,0,0,0,0,0,0,0,1,"不灭套装部件，盔体以紫金镶嵌水晶制造而成，顶缀麒麟鬃毛，威风凛凛。",0,1,6,1000000,0,0,0,24,10,},  
    [50] = {5031,"不灭灵盔",5030,4,8,0,21,1,5032,100,600031,600032,600033,300031,300131,104,1014,1,5030,5031,5032,5000,4,900000,1215,200,50,120,4,0,7290,14,0,10,250,0,1,1,6,150000,5030,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，盔体以紫金镶嵌水晶制造而成，顶缀麒麟鬃毛，威风凛凛。",0,1,6,1000000,0,0,0,24,10,},  
    [51] = {5032,"不灭灵盔",5030,4,8,0,21,2,5033,150,600031,600032,600033,300032,300132,104,1014,1,5030,5031,5032,5000,4,1500000,2025,200,50,120,4,0,12150,14,0,10,250,0,1,1,6,250000,5030,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，盔体以紫金镶嵌水晶制造而成，顶缀麒麟鬃毛，威风凛凛。",0,1,6,1000000,0,0,0,24,10,},  
    [52] = {5033,"不灭灵盔",5030,4,8,0,21,3,0,0,600031,600032,600033,300033,300133,104,1014,1,5030,5031,5032,5000,4,2400000,3240,200,50,120,4,0,19440,14,0,10,250,0,1,1,6,400000,5030,0,0,0,0,0,0,0,0,0,0,0,"不灭套装部件，盔体以紫金镶嵌水晶制造而成，顶缀麒麟鬃毛，威风凛凛。",0,1,6,1000000,0,0,0,24,10,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [101] = 5,  
    [102] = 6,  
    [103] = 7,  
    [104] = 8,  
    [201] = 9,  
    [202] = 10,  
    [203] = 11,  
    [204] = 12,  
    [211] = 13,  
    [212] = 14,  
    [213] = 15,  
    [214] = 16,  
    [301] = 17,  
    [302] = 18,  
    [303] = 19,  
    [304] = 20,  
    [311] = 21,  
    [312] = 22,  
    [313] = 23,  
    [314] = 24,  
    [401] = 25,  
    [402] = 26,  
    [403] = 27,  
    [404] = 28,  
    [411] = 29,  
    [412] = 30,  
    [413] = 31,  
    [414] = 32,  
    [421] = 33,  
    [422] = 34,  
    [423] = 35,  
    [424] = 36,  
    [5000] = 37,  
    [5001] = 38,  
    [5002] = 39,  
    [5003] = 40,  
    [5010] = 41,  
    [5011] = 42,  
    [5012] = 43,  
    [5013] = 44,  
    [5020] = 45,  
    [5021] = 46,  
    [5022] = 47,  
    [5023] = 48,  
    [5030] = 49,  
    [5031] = 50,  
    [5032] = 51,  
    [5033] = 52,
}

local __key_map = { 
    id = 1,
    name = 2,
    advance_id = 3,
    type = 4,
    quality = 5,
    rare = 6,
    potential = 7,
    magic_level = 8,
    next_id = 9,
    cost_size = 10,
    magic_talent_1 = 11,
    magic_talent_2 = 12,
    magic_talent_3 = 13,
    fire_passive_skill = 14,
    water_passive_skill = 15,
    dot_id = 16,
    casting_id = 17,
    put = 18,
    res_id = 19,
    fire_res_id = 20,
    water_res_id = 21,
    suit_id = 22,
    strength_type = 23,
    strength_value = 24,
    strength_growth = 25,
    money_1 = 26,
    money_2 = 27,
    refine_level = 28,
    refining_type_1 = 29,
    refining_value_1 = 30,
    refining_growth_1 = 31,
    refining_type_2 = 32,
    refining_value_2 = 33,
    refining_growth_2 = 34,
    refining_exp_1 = 35,
    refining_exp_2 = 36,
    is_sell = 37,
    price_type = 38,
    price_value = 39,
    price_size = 40,
    fragment_id = 41,
    talent_skill_1 = 42,
    talent_skill_2 = 43,
    talent_skill_3 = 44,
    talent_skill_4 = 45,
    talent_skill_5 = 46,
    talent_skill_6 = 47,
    talent_skill_7 = 48,
    talent_skill_8 = 49,
    talent_skill_9 = 50,
    talent_skill_10 = 51,
    gm = 52,
    description = 53,
    is_resolve = 54,
    resolve_type_1 = 55,
    resolve_value_1 = 56,
    resolve_size_1 = 57,
    resolve_type_2 = 58,
    resolve_value_2 = 59,
    resolve_size_2 = 60,
    equipment_glyph = 61,
    remind_size = 62,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_equipment_info")

        return t._raw[__key_map[k]]
    end
}


function equipment_info.getLength()
    return #equipment_info._data
end



function equipment_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_equipment_info
function equipment_info.indexOf(index)
    if index == nil or not equipment_info._data[index] then
        return nil
    end
    return setmetatable({_raw = equipment_info._data[index]}, m)
end



---
--@return @class record_equipment_info
function equipment_info.get(id)
    
    return equipment_info.indexOf(__index_id[ id ])
     
end



function equipment_info.set(id, key, value)
    local record = equipment_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function equipment_info.get_index_data()
    return __index_id 
end

return  equipment_info 