---@classdef record_guide_log_info
local record_guide_log_info = {}


record_guide_log_info.ID = 0--埋点ID
record_guide_log_info.des =  ""--描述文本

local guide_log_info = {
   _data = {   
    [1] = {0,"supersdk初始化成功",},  
    [2] = {90,"开始获取版本控制文件",},  
    [3] = {100,"请求版本控制文件完成",},  
    [4] = {120,"获取版控文件失败",},  
    [5] = {130,"开始获取MD5文件",},  
    [6] = {140,"获取MD5List文件失败",},  
    [7] = {160,"获取MD5List文件成功",},  
    [8] = {180,"开始热更新",},  
    [9] = {200,"热更新异常",},  
    [10] = {220,"解压缩失败",},  
    [11] = {240,"更新成功",},  
    [12] = {260,"更新完重启游戏",},  
    [13] = {280,"初始化游戏",},  
    [14] = {300,"初始化完成",},  
    [15] = {320,"获取开服列表数据",},  
    [16] = {340,"获取开服列表数据成功",},  
    [17] = {360,"获取服务器列表数据失败",},  
    [18] = {380,"获取account服务器列表数据成功",},  
    [19] = {400,"获取account服务器数据失败",},  
    [20] = {420,"supersdk初始化失败",},  
    [21] = {440,"supersdk开始登陆",},  
    [22] = {460,"supersdk登陆成功",},  
    [23] = {480,"supersdk登陆失败",},  
    [24] = {500,"开始进入游戏",},  
    [25] = {505,"登录服务器被拒",},  
    [26] = {520,"登陆游戏成功",},  
    [27] = {540,"创角前_开场动画",},  
    [28] = {560,"登陆成功后进入创角界面",},  
    [29] = {580,"创建角色成功",},  
    [30] = {600,"创建角失败",},  
    [31] = {620,"首战_战斗初始剧情",},  
    [32] = {640,"首战_第一次点合击前对话",},  
    [33] = {660,"首战_第一次点合击",},  
    [34] = {680,"首战_第二次点合击前对话",},  
    [35] = {700,"首战_第二次点合击",},  
    [36] = {720,"首战后_动画视频",},  
    [37] = {740,"首战后_剧情动画",},  
    [38] = {1000,"1-1_点关卡1-1",},  
    [39] = {1010,"1-1_点挑战按钮",},  
    [40] = {1020,"1-1_战斗过程",},  
    [41] = {1030,"1-1_战斗结算",},  
    [42] = {1040,"1-1_第一次战斗后对话",},  
    [43] = {1050,"第一次回城_点击回主城按钮",},  
    [44] = {1060,"第一次回城_回主城后剧情动画",},  
    [45] = {1070,"第一次招将_点击进入招将台",},  
    [46] = {1080,"第一次招将_点击高级招将",},  
    [47] = {1090,"第一次招将_点击单抽",},  
    [48] = {1100,"第一次招将_剧情对话",},  
    [49] = {1110,"第一次招将_关闭抽将",},  
    [50] = {1120,"第一次招将_点击回主城按钮",},  
    [51] = {1130,"第一次配置阵容_点击阵容",},  
    [52] = {1140,"第一次配置阵容_点击阵位",},  
    [53] = {1150,"第一次配置阵容_点击上阵步练师",},  
    [54] = {1160,"第一次配置阵容_选择武将上阵",},  
    [55] = {1180,"第一次配置阵容_点击回主城按钮",},  
    [56] = {1185,"第一次配置阵容_上阵后剧情对话",},  
    [57] = {1190,"1-2_点击进入副本",},  
    [58] = {1200,"1-2_点击第一章",},  
    [59] = {1210,"1-2_点关卡1-2",},  
    [60] = {1220,"1-2_点挑战按钮",},  
    [61] = {1230,"1-2_合击前对话",},  
    [62] = {1240,"1-2_点击合击",},  
    [63] = {1250,"1-2_战斗过程",},  
    [64] = {1260,"1-2_战斗结算",},  
    [65] = {1270,"1-3_战斗前剧情对话",},  
    [66] = {1280,"1-3_点关卡",},  
    [67] = {1290,"1-3_点挑战按钮",},  
    [68] = {1320,"1-3_剧情对话",},  
    [69] = {1325,"1-3_引导合击",},  
    [70] = {1327,"1-3_战斗过程",},  
    [71] = {1330,"1-3_战斗结算",},  
    [72] = {1350,"1-3_点击宝箱",},  
    [73] = {1360,"1-3_点击领取",},  
    [74] = {1365,"获得祝融剧情",},  
    [75] = {1370,"1-3_点击回主城按钮",},  
    [76] = {1450,"第二次配置阵容_点击阵容",},  
    [77] = {1460,"第二次配置阵容_点击阵位",},  
    [78] = {1470,"第二次配置阵容_点击上阵祝融",},  
    [79] = {1475,"第二次配置阵容_点击上阵按钮",},  
    [80] = {1480,"武将升级_点击养成",},  
    [81] = {1490,"武将升级_点击经验升级1",},  
    [82] = {1500,"武将升级_点击经验升级2",},  
    [83] = {1520,"武将升级_点击回主城按钮",},  
    [84] = {1530,"2-1_点击进入副本",},  
    [85] = {1540,"2-1_点击第二章",},  
    [86] = {1550,"2-1_剧情",},  
    [87] = {1560,"2-1_点关卡",},  
    [88] = {1570,"2-1_点挑战按钮",},  
    [89] = {1580,"2-1_新合击介绍对话",},  
    [90] = {1590,"2-1_点击治疗合击",},  
    [91] = {1600,"2-1_战斗过程",},  
    [92] = {1610,"2-1_战斗结算",},  
    [93] = {1620,"2-1_关卡宝箱介绍对话",},  
    [94] = {1630,"2-1_点击宝箱",},  
    [95] = {1640,"2-1_点击领取",},  
    [96] = {1650,"2-1_点击回主城按钮",},  
    [97] = {1660,"武将进阶_点击阵容",},  
    [98] = {1670,"武将进阶_点击养成",},  
    [99] = {1680,"武将进阶_点击孔位1",},  
    [100] = {1690,"武将进阶_点击装备1",},  
    [101] = {1695,"武将进阶_点击一键装备",},  
    [102] = {1760,"武将进阶_点击大进阶",},  
    [103] = {1780,"武将进阶_战力提升动画对话",},  
    [104] = {1790,"武将进阶_点击回主城按钮",},  
    [105] = {1800,"2-2_点击进入副本",},  
    [106] = {1810,"2-2_点击第二章",},  
    [107] = {1820,"2-2_点关卡",},  
    [108] = {1830,"2-2_点挑战按钮",},  
    [109] = {1840,"2-2_剧情",},  
    [110] = {1850,"2-2_战斗过程",},  
    [111] = {1860,"2-2_战斗结算",},
    }
}

local __index_ID = {   
    [0] = 1,  
    [90] = 2,  
    [100] = 3,  
    [120] = 4,  
    [130] = 5,  
    [140] = 6,  
    [160] = 7,  
    [180] = 8,  
    [200] = 9,  
    [220] = 10,  
    [240] = 11,  
    [260] = 12,  
    [280] = 13,  
    [300] = 14,  
    [320] = 15,  
    [340] = 16,  
    [360] = 17,  
    [380] = 18,  
    [400] = 19,  
    [420] = 20,  
    [440] = 21,  
    [460] = 22,  
    [480] = 23,  
    [500] = 24,  
    [505] = 25,  
    [520] = 26,  
    [540] = 27,  
    [560] = 28,  
    [580] = 29,  
    [600] = 30,  
    [620] = 31,  
    [640] = 32,  
    [660] = 33,  
    [680] = 34,  
    [700] = 35,  
    [720] = 36,  
    [740] = 37,  
    [1000] = 38,  
    [1010] = 39,  
    [1020] = 40,  
    [1030] = 41,  
    [1040] = 42,  
    [1050] = 43,  
    [1060] = 44,  
    [1070] = 45,  
    [1080] = 46,  
    [1090] = 47,  
    [1100] = 48,  
    [1110] = 49,  
    [1120] = 50,  
    [1130] = 51,  
    [1140] = 52,  
    [1150] = 53,  
    [1160] = 54,  
    [1180] = 55,  
    [1185] = 56,  
    [1190] = 57,  
    [1200] = 58,  
    [1210] = 59,  
    [1220] = 60,  
    [1230] = 61,  
    [1240] = 62,  
    [1250] = 63,  
    [1260] = 64,  
    [1270] = 65,  
    [1280] = 66,  
    [1290] = 67,  
    [1320] = 68,  
    [1325] = 69,  
    [1327] = 70,  
    [1330] = 71,  
    [1350] = 72,  
    [1360] = 73,  
    [1365] = 74,  
    [1370] = 75,  
    [1450] = 76,  
    [1460] = 77,  
    [1470] = 78,  
    [1475] = 79,  
    [1480] = 80,  
    [1490] = 81,  
    [1500] = 82,  
    [1520] = 83,  
    [1530] = 84,  
    [1540] = 85,  
    [1550] = 86,  
    [1560] = 87,  
    [1570] = 88,  
    [1580] = 89,  
    [1590] = 90,  
    [1600] = 91,  
    [1610] = 92,  
    [1620] = 93,  
    [1630] = 94,  
    [1640] = 95,  
    [1650] = 96,  
    [1660] = 97,  
    [1670] = 98,  
    [1680] = 99,  
    [1690] = 100,  
    [1695] = 101,  
    [1760] = 102,  
    [1780] = 103,  
    [1790] = 104,  
    [1800] = 105,  
    [1810] = 106,  
    [1820] = 107,  
    [1830] = 108,  
    [1840] = 109,  
    [1850] = 110,  
    [1860] = 111,
}

local __key_map = { 
    ID = 1,
    des = 2,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_guide_log_info")

        return t._raw[__key_map[k]]
    end
}


function guide_log_info.getLength()
    return #guide_log_info._data
end



function guide_log_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_guide_log_info
function guide_log_info.indexOf(index)
    if index == nil or not guide_log_info._data[index] then
        return nil
    end
    return setmetatable({_raw = guide_log_info._data[index]}, m)
end



---
--@return @class record_guide_log_info
function guide_log_info.get(ID)
    
    return guide_log_info.indexOf(__index_ID[ ID ])
     
end



function guide_log_info.set(ID, key, value)
    local record = guide_log_info.get(ID)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function guide_log_info.get_index_data()
    return __index_ID 
end

return  guide_log_info 