---@classdef record_guild_dungeon_skill_info
local record_guild_dungeon_skill_info = {}


record_guild_dungeon_skill_info.id = 0--ID
record_guild_dungeon_skill_info.next_id = 0--下一级id
record_guild_dungeon_skill_info.name =  ""--技能名称
record_guild_dungeon_skill_info.type = 0--技能类型
record_guild_dungeon_skill_info.icon =  ""--技能图标
record_guild_dungeon_skill_info.description =  ""--技能描述
record_guild_dungeon_skill_info.level = 0--技能等级
record_guild_dungeon_skill_info.exp = 0--升级经验
record_guild_dungeon_skill_info.talent_skill_id = 0--天赋技能id

local guild_dungeon_skill_info = {
   _data = {   
    [1] = {1,2,"魏国增伤",1,"201","魏国增伤",0,30,80001,},  
    [2] = {2,3,"魏国增伤",1,"201","魏国增伤",1,60,80002,},  
    [3] = {3,4,"魏国增伤",1,"201","魏国增伤",2,100,80003,},  
    [4] = {4,5,"魏国增伤",1,"201","魏国增伤",3,150,80004,},  
    [5] = {5,6,"魏国增伤",1,"201","魏国增伤",4,200,80005,},  
    [6] = {6,7,"魏国增伤",1,"201","魏国增伤",5,250,80006,},  
    [7] = {7,8,"魏国增伤",1,"201","魏国增伤",6,300,80007,},  
    [8] = {8,9,"魏国增伤",1,"201","魏国增伤",7,350,80008,},  
    [9] = {9,10,"魏国增伤",1,"201","魏国增伤",8,400,80009,},  
    [10] = {10,11,"魏国增伤",1,"201","魏国增伤",9,500,80010,},  
    [11] = {11,0,"魏国增伤",1,"201","魏国增伤",10,0,80011,},  
    [12] = {12,13,"蜀国增伤",2,"202","蜀国增伤",0,30,80012,},  
    [13] = {13,14,"蜀国增伤",2,"202","蜀国增伤",1,60,80013,},  
    [14] = {14,15,"蜀国增伤",2,"202","蜀国增伤",2,100,80014,},  
    [15] = {15,16,"蜀国增伤",2,"202","蜀国增伤",3,150,80015,},  
    [16] = {16,17,"蜀国增伤",2,"202","蜀国增伤",4,200,80016,},  
    [17] = {17,18,"蜀国增伤",2,"202","蜀国增伤",5,250,80017,},  
    [18] = {18,19,"蜀国增伤",2,"202","蜀国增伤",6,300,80018,},  
    [19] = {19,20,"蜀国增伤",2,"202","蜀国增伤",7,350,80019,},  
    [20] = {20,21,"蜀国增伤",2,"202","蜀国增伤",8,400,80020,},  
    [21] = {21,22,"蜀国增伤",2,"202","蜀国增伤",9,500,80021,},  
    [22] = {22,0,"蜀国增伤",2,"202","蜀国增伤",10,0,80022,},  
    [23] = {23,24,"吴国增伤",3,"203","吴国增伤",0,30,80023,},  
    [24] = {24,25,"吴国增伤",3,"203","吴国增伤",1,60,80024,},  
    [25] = {25,26,"吴国增伤",3,"203","吴国增伤",2,100,80025,},  
    [26] = {26,27,"吴国增伤",3,"203","吴国增伤",3,150,80026,},  
    [27] = {27,28,"吴国增伤",3,"203","吴国增伤",4,200,80027,},  
    [28] = {28,29,"吴国增伤",3,"203","吴国增伤",5,250,80028,},  
    [29] = {29,30,"吴国增伤",3,"203","吴国增伤",6,300,80029,},  
    [30] = {30,31,"吴国增伤",3,"203","吴国增伤",7,350,80030,},  
    [31] = {31,32,"吴国增伤",3,"203","吴国增伤",8,400,80031,},  
    [32] = {32,33,"吴国增伤",3,"203","吴国增伤",9,500,80032,},  
    [33] = {33,0,"吴国增伤",3,"203","吴国增伤",10,0,80033,},  
    [34] = {34,35,"群雄增伤",4,"204","群雄增伤",0,30,80034,},  
    [35] = {35,36,"群雄增伤",4,"204","群雄增伤",1,60,80035,},  
    [36] = {36,37,"群雄增伤",4,"204","群雄增伤",2,100,80036,},  
    [37] = {37,38,"群雄增伤",4,"204","群雄增伤",3,150,80037,},  
    [38] = {38,39,"群雄增伤",4,"204","群雄增伤",4,200,80038,},  
    [39] = {39,40,"群雄增伤",4,"204","群雄增伤",5,250,80039,},  
    [40] = {40,41,"群雄增伤",4,"204","群雄增伤",6,300,80040,},  
    [41] = {41,42,"群雄增伤",4,"204","群雄增伤",7,350,80041,},  
    [42] = {42,43,"群雄增伤",4,"204","群雄增伤",8,400,80042,},  
    [43] = {43,44,"群雄增伤",4,"204","群雄增伤",9,500,80043,},  
    [44] = {44,0,"群雄增伤",4,"204","群雄增伤",10,0,80044,},  
    [45] = {45,46,"合击增伤",5,"105","合击增伤",0,60,80045,},  
    [46] = {46,47,"合击增伤",5,"105","合击增伤",1,120,80046,},  
    [47] = {47,48,"合击增伤",5,"105","合击增伤",2,200,80047,},  
    [48] = {48,49,"合击增伤",5,"105","合击增伤",3,300,80048,},  
    [49] = {49,50,"合击增伤",5,"105","合击增伤",4,400,80049,},  
    [50] = {50,51,"合击增伤",5,"105","合击增伤",5,500,80050,},  
    [51] = {51,52,"合击增伤",5,"105","合击增伤",6,600,80051,},  
    [52] = {52,53,"合击增伤",5,"105","合击增伤",7,700,80052,},  
    [53] = {53,54,"合击增伤",5,"105","合击增伤",8,800,80053,},  
    [54] = {54,55,"合击增伤",5,"105","合击增伤",9,1000,80054,},  
    [55] = {55,0,"合击增伤",5,"105","合击增伤",10,0,80055,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,
}

local __key_map = { 
    id = 1,
    next_id = 2,
    name = 3,
    type = 4,
    icon = 5,
    description = 6,
    level = 7,
    exp = 8,
    talent_skill_id = 9,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_guild_dungeon_skill_info")

        return t._raw[__key_map[k]]
    end
}


function guild_dungeon_skill_info.getLength()
    return #guild_dungeon_skill_info._data
end



function guild_dungeon_skill_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_guild_dungeon_skill_info
function guild_dungeon_skill_info.indexOf(index)
    if index == nil or not guild_dungeon_skill_info._data[index] then
        return nil
    end
    return setmetatable({_raw = guild_dungeon_skill_info._data[index]}, m)
end



---
--@return @class record_guild_dungeon_skill_info
function guild_dungeon_skill_info.get(id)
    
    return guild_dungeon_skill_info.indexOf(__index_id[ id ])
     
end



function guild_dungeon_skill_info.set(id, key, value)
    local record = guild_dungeon_skill_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function guild_dungeon_skill_info.get_index_data()
    return __index_id 
end

return  guild_dungeon_skill_info 