---@classdef record_guild_battle_score_info
local record_guild_battle_score_info = {}


record_guild_battle_score_info.id = 0--ID
record_guild_battle_score_info.score_type = 0--类型
record_guild_battle_score_info.score_value = 0--类型值
record_guild_battle_score_info.score = 0--积分
record_guild_battle_score_info.name =  ""--名称
record_guild_battle_score_info.name_1 =  ""--名称
record_guild_battle_score_info.name_2 =  ""--名称
record_guild_battle_score_info.name_3 =  ""--名称
record_guild_battle_score_info.quality = 0--品质

local guild_battle_score_info = {
   _data = {   
    [1] = {1,1,1,500,"兵马大元帅","兵马大元帅","兵马大元帅","兵马大元帅",7,},  
    [2] = {2,1,2,400,"统兵大都督","统兵大都督","统兵大都督","统兵大都督",7,},  
    [3] = {3,1,3,350,"统兵大都督","统兵大都督","统兵大都督","统兵大都督",7,},  
    [4] = {4,1,4,300,"三军大司马","三军大司马","三军大司马","三军大司马",7,},  
    [5] = {5,1,5,270,"三军大司马","三军大司马","三军大司马","三军大司马",7,},  
    [6] = {6,1,6,240,"三军大司马","三军大司马","三军大司马","三军大司马",7,},  
    [7] = {7,1,7,220,"柱国大将军","柱国大将军","柱国大将军","柱国大将军",7,},  
    [8] = {8,1,8,200,"柱国大将军","柱国大将军","柱国大将军","柱国大将军",7,},  
    [9] = {9,1,9,180,"柱国大将军","柱国大将军","柱国大将军","柱国大将军",7,},  
    [10] = {10,1,10,160,"柱国大将军","柱国大将军","柱国大将军","柱国大将军",7,},  
    [11] = {11,1,11,100,"奋勇将军","奋勇将军","奋勇将军","奋勇将军",6,},  
    [12] = {12,1,12,98,"奋勇将军","奋勇将军","奋勇将军","奋勇将军",6,},  
    [13] = {13,1,13,96,"奋勇将军","奋勇将军","奋勇将军","奋勇将军",6,},  
    [14] = {14,1,14,94,"虎威将军","虎威将军","虎威将军","虎威将军",6,},  
    [15] = {15,1,15,92,"虎威将军","虎威将军","虎威将军","虎威将军",6,},  
    [16] = {16,1,16,90,"虎威将军","虎威将军","虎威将军","虎威将军",6,},  
    [17] = {17,1,17,88,"骠骑将军","骠骑将军","骠骑将军","骠骑将军",6,},  
    [18] = {18,1,18,86,"骠骑将军","骠骑将军","骠骑将军","骠骑将军",6,},  
    [19] = {19,1,19,84,"骠骑将军","骠骑将军","骠骑将军","骠骑将军",6,},  
    [20] = {20,1,20,82,"镇远将军","镇远将军","镇远将军","镇远将军",6,},  
    [21] = {21,1,21,80,"镇远将军","镇远将军","镇远将军","镇远将军",6,},  
    [22] = {22,1,22,78,"镇远将军","镇远将军","镇远将军","镇远将军",6,},  
    [23] = {23,1,23,76,"典军中郎将","典军中郎将","典军中郎将","典军中郎将",6,},  
    [24] = {24,1,24,74,"典军中郎将","典军中郎将","典军中郎将","典军中郎将",6,},  
    [25] = {25,1,25,72,"典军中郎将","典军中郎将","典军中郎将","典军中郎将",6,},  
    [26] = {26,1,26,70,"掌军中郎将","掌军中郎将","掌军中郎将","掌军中郎将",6,},  
    [27] = {27,1,27,68,"掌军中郎将","掌军中郎将","掌军中郎将","掌军中郎将",6,},  
    [28] = {28,1,28,66,"掌军中郎将","掌军中郎将","掌军中郎将","掌军中郎将",6,},  
    [29] = {29,1,29,64,"抚军中郎将","抚军中郎将","抚军中郎将","抚军中郎将",6,},  
    [30] = {30,1,30,62,"抚军中郎将","抚军中郎将","抚军中郎将","抚军中郎将",6,},  
    [31] = {31,1,31,60,"抚军中郎将","抚军中郎将","抚军中郎将","抚军中郎将",6,},  
    [32] = {32,1,32,58,"副军中郎将","副军中郎将","副军中郎将","副军中郎将",6,},  
    [33] = {33,1,33,56,"副军中郎将","副军中郎将","副军中郎将","副军中郎将",6,},  
    [34] = {34,1,34,54,"副军中郎将","副军中郎将","副军中郎将","副军中郎将",6,},  
    [35] = {35,1,35,52,"虎贲校尉","虎贲校尉","虎贲校尉","虎贲校尉",5,},  
    [36] = {36,1,36,50,"虎贲校尉","虎贲校尉","虎贲校尉","虎贲校尉",5,},  
    [37] = {37,1,37,48,"虎贲校尉","虎贲校尉","虎贲校尉","虎贲校尉",5,},  
    [38] = {38,1,38,46,"中垒校尉","中垒校尉","中垒校尉","中垒校尉",5,},  
    [39] = {39,1,39,44,"中垒校尉","中垒校尉","中垒校尉","中垒校尉",5,},  
    [40] = {40,1,40,42,"中垒校尉","中垒校尉","中垒校尉","中垒校尉",5,},  
    [41] = {41,1,41,40,"越骑校尉","越骑校尉","越骑校尉","越骑校尉",5,},  
    [42] = {42,1,42,38,"越骑校尉","越骑校尉","越骑校尉","越骑校尉",5,},  
    [43] = {43,1,43,36,"越骑校尉","越骑校尉","越骑校尉","越骑校尉",5,},  
    [44] = {44,1,44,34,"长水校尉","长水校尉","长水校尉","长水校尉",5,},  
    [45] = {45,1,45,32,"长水校尉","长水校尉","长水校尉","长水校尉",5,},  
    [46] = {46,1,46,30,"长水校尉","长水校尉","长水校尉","长水校尉",5,},  
    [47] = {201,2,1,400,"黄金战车","三军大司马","统兵大都督","兵马大元帅",7,},  
    [48] = {202,2,2,200,"黄金战车","虎威将军","奋勇将军","柱国大将军",7,},  
    [49] = {203,2,3,100,"赤银战车","典军中郎将","镇远将军","骠骑将军",6,},  
    [50] = {204,2,4,80,"原木战车","副军中郎将","抚军中郎将","掌军中郎将",5,},  
    [51] = {205,2,5,60,"原木战车","越骑校尉","越骑校尉","越骑校尉",5,},  
    [52] = {206,2,6,40,"原木战车","虎贲校尉","虎贲校尉","虎贲校尉",5,},  
    [53] = {207,2,7,20,"原木战车","长水校尉","长水校尉","长水校尉",5,},  
    [54] = {301,3,9999,10,"攻城士卒","长水校尉","长水校尉","长水校尉",4,},  
    [55] = {401,4,9999,10,"原木战车","攻城士卒","攻城士卒","攻城士卒",5,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [201] = 47,  
    [202] = 48,  
    [203] = 49,  
    [204] = 50,  
    [205] = 51,  
    [206] = 52,  
    [207] = 53,  
    [301] = 54,  
    [401] = 55,
}

local __key_map = { 
    id = 1,
    score_type = 2,
    score_value = 3,
    score = 4,
    name = 5,
    name_1 = 6,
    name_2 = 7,
    name_3 = 8,
    quality = 9,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_guild_battle_score_info")

        return t._raw[__key_map[k]]
    end
}


function guild_battle_score_info.getLength()
    return #guild_battle_score_info._data
end



function guild_battle_score_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_guild_battle_score_info
function guild_battle_score_info.indexOf(index)
    if index == nil or not guild_battle_score_info._data[index] then
        return nil
    end
    return setmetatable({_raw = guild_battle_score_info._data[index]}, m)
end



---
--@return @class record_guild_battle_score_info
function guild_battle_score_info.get(id)
    
    return guild_battle_score_info.indexOf(__index_id[ id ])
     
end



function guild_battle_score_info.set(id, key, value)
    local record = guild_battle_score_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function guild_battle_score_info.get_index_data()
    return __index_id 
end

return  guild_battle_score_info 