---@classdef record_guild_competition_task_info
local record_guild_competition_task_info = {}


record_guild_competition_task_info.id = 0--编号
record_guild_competition_task_info.activity_id = 0--活动ID
record_guild_competition_task_info.name =  ""--任务名称
record_guild_competition_task_info.description =  ""--任务描述
record_guild_competition_task_info.type = 0--任务类型
record_guild_competition_task_info.target = 0--任务目标
record_guild_competition_task_info.num = 0--任务目标数值
record_guild_competition_task_info.sort = 0--排序值
record_guild_competition_task_info.reward_type_1 = 0--奖励类型1
record_guild_competition_task_info.reward_value_1 = 0--奖励类型值1
record_guild_competition_task_info.reward_size_1 = 0--奖励数量1
record_guild_competition_task_info.reward_type_2 = 0--奖励类型2
record_guild_competition_task_info.reward_value_2 = 0--奖励类型值2
record_guild_competition_task_info.reward_size_2 = 0--奖励数量2
record_guild_competition_task_info.reward_type_3 = 0--奖励类型3
record_guild_competition_task_info.reward_value_3 = 0--奖励类型值3
record_guild_competition_task_info.reward_size_3 = 0--奖励数量3
record_guild_competition_task_info.route_id = 0--跳转接口

local guild_competition_task_info = {
   _data = {   
    [1] = {1,100000,"铸造神像","累计消耗3个神像石",2,1079,3,1,1,11,500,1,3,50000,0,0,0,61,},  
    [2] = {2,100000,"铸造神像","累计消耗6个神像石",2,1079,6,2,1,11,500,1,3,60000,0,0,0,61,},  
    [3] = {3,100000,"铸造神像","累计消耗10个神像石",2,1079,10,3,1,11,700,1,3,70000,0,0,0,61,},  
    [4] = {4,100000,"铸造神像","累计消耗15个神像石",2,1079,15,4,1,11,1000,1,3,80000,0,0,0,61,},  
    [5] = {5,100000,"铸造神像","累计消耗20个神像石",2,1079,20,5,1,11,1000,1,3,90000,0,0,0,61,},  
    [6] = {6,100000,"铸造神像","累计消耗30个神像石",2,1079,30,6,1,11,1500,1,3,100000,0,0,0,61,},  
    [7] = {7,100000,"铸造神像","累计消耗40个神像石",2,1079,40,7,999,0,200,1,11,1500,1,3,150000,61,},  
    [8] = {8,100000,"军团副本挑战","军团副本挑战5次",2,1012,5,8,1,11,500,3,26,10,0,0,0,16,},  
    [9] = {9,100000,"军团副本挑战","军团副本挑战10次",2,1012,10,9,1,11,500,3,26,20,0,0,0,16,},  
    [10] = {10,100000,"军团副本挑战","军团副本挑战15次",2,1012,15,10,1,11,700,3,26,30,0,0,0,16,},  
    [11] = {11,100000,"军团副本挑战","军团副本挑战20次",2,1012,20,11,1,11,1000,3,26,40,0,0,0,16,},  
    [12] = {12,100000,"军团副本挑战","军团副本挑战30次",2,1012,30,12,1,11,1500,3,26,50,0,0,0,16,},  
    [13] = {13,100000,"军团副本挑战","军团副本挑战40次",2,1012,40,13,999,0,200,1,11,1500,3,26,60,16,},  
    [14] = {14,100000,"铸造神像","累计1次建造铜品质以上神像",1,1081,1,14,1,11,500,3,35,100,1,3,30000,61,},  
    [15] = {15,100000,"铸造神像","累计2次建造铜品质以上神像",1,1081,2,15,1,11,500,3,35,100,1,3,30000,61,},  
    [16] = {16,100000,"铸造神像","累计3次建造铜品质以上神像",1,1081,3,16,1,11,500,3,35,100,1,3,30000,61,},  
    [17] = {17,100000,"铸造神像","累计4次建造铜品质以上神像",1,1081,4,17,1,11,500,3,35,100,1,3,30000,61,},  
    [18] = {18,100000,"铸造神像","累计1次建造银品质以上神像",1,1082,1,18,1,11,1000,3,35,150,1,3,50000,61,},  
    [19] = {19,100000,"铸造神像","累计2次建造银品质以上神像",1,1082,2,19,1,11,1000,3,35,150,1,3,50000,61,},  
    [20] = {20,100000,"铸造神像","累计3次建造银品质以上神像",1,1082,3,20,1,11,1000,3,35,150,1,3,50000,61,},  
    [21] = {21,100000,"铸造神像","累计1次建造金品质神像",1,1083,1,21,1,11,1500,3,35,200,1,3,100000,61,},  
    [22] = {22,100000,"铸造神像","累计2次建造金品质神像",1,1083,2,22,1,11,1500,3,35,200,1,3,100000,61,},  
    [23] = {23,100001,"铸造神像","累计消耗3个神像石",2,1079,3,1,1,11,500,1,3,50000,0,0,0,61,},  
    [24] = {24,100001,"铸造神像","累计消耗6个神像石",2,1079,6,2,1,11,500,1,3,60000,0,0,0,61,},  
    [25] = {25,100001,"铸造神像","累计消耗10个神像石",2,1079,10,3,1,11,700,1,3,70000,0,0,0,61,},  
    [26] = {26,100001,"铸造神像","累计消耗15个神像石",2,1079,15,4,1,11,1000,1,3,80000,0,0,0,61,},  
    [27] = {27,100001,"铸造神像","累计消耗20个神像石",2,1079,20,5,1,11,1000,1,3,90000,0,0,0,61,},  
    [28] = {28,100001,"铸造神像","累计消耗30个神像石",2,1079,30,6,1,11,1500,1,3,100000,0,0,0,61,},  
    [29] = {29,100001,"铸造神像","累计消耗40个神像石",2,1079,40,7,999,0,200,1,11,3000,1,3,150000,61,},  
    [30] = {30,100001,"军团副本挑战","军团副本挑战5次",2,1012,5,8,1,11,500,3,26,100,0,0,0,16,},  
    [31] = {31,100001,"军团副本挑战","军团副本挑战10次",2,1012,10,9,1,11,500,3,26,100,0,0,0,16,},  
    [32] = {32,100001,"军团副本挑战","军团副本挑战15次",2,1012,15,10,1,11,700,3,26,100,0,0,0,16,},  
    [33] = {33,100001,"军团副本挑战","军团副本挑战20次",2,1012,20,11,1,11,1000,3,26,150,0,0,0,16,},  
    [34] = {34,100001,"军团副本挑战","军团副本挑战30次",2,1012,30,12,1,11,1500,3,26,150,0,0,0,16,},  
    [35] = {35,100001,"军团副本挑战","军团副本挑战40次",2,1012,40,13,999,0,200,1,11,3000,3,26,200,16,},  
    [36] = {36,100001,"铸造神像","累计1次建造铜品质以上神像",1,1081,1,14,1,11,500,3,35,100,1,3,30000,61,},  
    [37] = {37,100001,"铸造神像","累计2次建造铜品质以上神像",1,1081,2,15,1,11,500,3,35,100,1,3,30000,61,},  
    [38] = {38,100001,"铸造神像","累计3次建造铜品质以上神像",1,1081,3,16,1,11,500,3,35,100,1,3,30000,61,},  
    [39] = {39,100001,"铸造神像","累计4次建造铜品质以上神像",1,1081,4,17,1,11,500,3,35,100,1,3,30000,61,},  
    [40] = {40,100001,"铸造神像","累计1次建造银品质以上神像",1,1082,1,18,1,11,1000,3,35,150,1,3,50000,61,},  
    [41] = {41,100001,"铸造神像","累计2次建造银品质以上神像",1,1082,2,19,1,11,1000,3,35,150,1,3,50000,61,},  
    [42] = {42,100001,"铸造神像","累计3次建造银品质以上神像",1,1082,3,20,1,11,1000,3,35,150,1,3,50000,61,},  
    [43] = {43,100001,"铸造神像","累计1次建造金品质神像",1,1083,1,21,1,11,1500,3,35,200,1,3,100000,61,},  
    [44] = {44,100001,"铸造神像","累计2次建造金品质神像",1,1083,2,22,1,11,1500,3,35,200,1,3,100000,61,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,
}

local __key_map = { 
    id = 1,
    activity_id = 2,
    name = 3,
    description = 4,
    type = 5,
    target = 6,
    num = 7,
    sort = 8,
    reward_type_1 = 9,
    reward_value_1 = 10,
    reward_size_1 = 11,
    reward_type_2 = 12,
    reward_value_2 = 13,
    reward_size_2 = 14,
    reward_type_3 = 15,
    reward_value_3 = 16,
    reward_size_3 = 17,
    route_id = 18,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_guild_competition_task_info")

        return t._raw[__key_map[k]]
    end
}


function guild_competition_task_info.getLength()
    return #guild_competition_task_info._data
end



function guild_competition_task_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_guild_competition_task_info
function guild_competition_task_info.indexOf(index)
    if index == nil or not guild_competition_task_info._data[index] then
        return nil
    end
    return setmetatable({_raw = guild_competition_task_info._data[index]}, m)
end



---
--@return @class record_guild_competition_task_info
function guild_competition_task_info.get(id)
    
    return guild_competition_task_info.indexOf(__index_id[ id ])
     
end



function guild_competition_task_info.set(id, key, value)
    local record = guild_competition_task_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function guild_competition_task_info.get_index_data()
    return __index_id 
end

return  guild_competition_task_info 