---@classdef record_gvg_grid_info
local record_gvg_grid_info = {}


record_gvg_grid_info.id = 0--id
record_gvg_grid_info.name =  ""--名称
record_gvg_grid_info.map_id = 0--关联地图ID
record_gvg_grid_info.type = 0--类型
record_gvg_grid_info.open_time = 0--开始时间
record_gvg_grid_info.end_time = 0--结束时间
record_gvg_grid_info.min_x = 0--最小X
record_gvg_grid_info.max_x = 0--最大X
record_gvg_grid_info.min_y = 0--最小Y
record_gvg_grid_info.max_y = 0--最大Y
record_gvg_grid_info.value_1 = 0--类型值1
record_gvg_grid_info.value_2 = 0--类型值2
record_gvg_grid_info.value_3 = 0--类型值3
record_gvg_grid_info.value_4 = 0--类型值4
record_gvg_grid_info.value_5 = 0--类型值5
record_gvg_grid_info.value_6 = 0--类型值6
record_gvg_grid_info.object_id = 0--关联摆件位置
record_gvg_grid_info.effect_state_1 =  ""--状态1
record_gvg_grid_info.effect_value_1 =  ""--特效1
record_gvg_grid_info.effect_state_2 =  ""--状态2
record_gvg_grid_info.effect_value_2 =  ""--特效2
record_gvg_grid_info.effect_state_3 =  ""--状态3
record_gvg_grid_info.effect_value_3 =  ""--特效3

local gvg_grid_info = {
   _data = {   
    [1] = {2001,"城门",2,1,0,900,1,1,1,1,170001,1,0,0,0,0,0,"0","0","0","0","0","0",},  
    [2] = {2002,"复活点1",2,3,0,0,5,5,5,5,1,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [3] = {2003,"复活点2",2,3,0,0,6,6,6,6,2,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [4] = {2004,"复活点3",2,3,0,0,7,7,7,7,3,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [5] = {2005,"复活点4",2,3,0,0,8,8,8,8,4,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [6] = {2006,"复活点5",2,3,0,0,9,9,9,9,5,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [7] = {2007,"复活点6",2,3,0,0,10,10,10,10,6,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [8] = {2008,"复活点7",2,3,0,0,11,11,11,11,7,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [9] = {2009,"复活点8",2,3,0,0,12,12,12,12,8,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [10] = {2010,"复活点9",2,3,0,0,13,13,13,13,9,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [11] = {2011,"复活点10",2,3,0,0,14,14,14,14,10,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [12] = {2012,"复活点11",2,3,0,0,15,15,15,15,11,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [13] = {2013,"复活点12",2,3,0,0,16,16,16,16,12,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [14] = {2014,"城门占领区1",2,4,0,0,17,17,17,17,2001,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [15] = {2015,"buff1",2,6,0,0,21,21,21,21,2001,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [16] = {2016,"buff2",2,6,0,0,22,22,22,22,2002,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [17] = {900201,"城门",9002,1,0,900,14,14,19,19,0,1,10000,0,0,0,1201,"0","0","0","0","0","0",},  
    [18] = {900202,"城门",9002,1,0,900,14,14,11,11,0,1,10000,0,0,0,1204,"0","0","0","0","0","0",},  
    [19] = {900203,"炮塔",9002,2,450,900,7,8,14,16,0,0,0,0,0,0,962,"0","0","0","0","0","0",},  
    [20] = {900204,"炮塔",9002,2,450,900,20,21,14,16,0,0,0,0,0,0,965,"0","0","0","0","0","0",},  
    [21] = {900205,"复活点1",9002,3,0,0,4,4,4,4,1,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [22] = {900206,"复活点2",9002,3,0,0,26,26,6,6,2,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [23] = {900207,"复活点3",9002,3,0,0,26,26,24,24,3,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [24] = {900208,"复活点4",9002,3,0,0,4,4,26,26,4,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [25] = {900209,"复活点5",9002,3,0,0,6,6,2,2,5,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [26] = {900210,"复活点6",9002,3,0,0,24,24,4,4,6,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [27] = {900211,"复活点7",9002,3,0,0,24,24,26,26,7,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [28] = {900212,"复活点8",9002,3,0,0,6,6,28,28,8,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [29] = {900213,"复活点9",9002,3,0,0,3,3,1,1,9,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [30] = {900214,"复活点10",9002,3,0,0,27,27,3,3,10,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [31] = {900215,"复活点11",9002,3,0,0,27,27,27,27,11,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [32] = {900216,"复活点12",9002,3,0,0,3,3,29,29,12,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [33] = {900217,"城门占领区1",9002,4,0,0,13,15,20,20,900201,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [34] = {900218,"城门占领区2",9002,4,0,0,13,15,10,10,900202,0,0,0,0,0,0,"0","0","0","0","0","0",},  
    [35] = {900219,"炮塔占领区1",9002,5,0,0,5,6,13,17,900203,209,210,211,212,213,213,"0","0","0","0","0","0",},  
    [36] = {900220,"炮塔占领区2",9002,5,0,0,22,23,13,17,900204,696,697,698,699,700,700,"0","0","0","0","0","0",},  
    [37] = {900221,"buff1",9002,6,0,0,13,14,4,5,1001,0,0,0,0,0,1206,"0","0","0","0","0","0",},
    }
}

local __index_id = {   
    [2001] = 1,  
    [2002] = 2,  
    [2003] = 3,  
    [2004] = 4,  
    [2005] = 5,  
    [2006] = 6,  
    [2007] = 7,  
    [2008] = 8,  
    [2009] = 9,  
    [2010] = 10,  
    [2011] = 11,  
    [2012] = 12,  
    [2013] = 13,  
    [2014] = 14,  
    [2015] = 15,  
    [2016] = 16,  
    [900201] = 17,  
    [900202] = 18,  
    [900203] = 19,  
    [900204] = 20,  
    [900205] = 21,  
    [900206] = 22,  
    [900207] = 23,  
    [900208] = 24,  
    [900209] = 25,  
    [900210] = 26,  
    [900211] = 27,  
    [900212] = 28,  
    [900213] = 29,  
    [900214] = 30,  
    [900215] = 31,  
    [900216] = 32,  
    [900217] = 33,  
    [900218] = 34,  
    [900219] = 35,  
    [900220] = 36,  
    [900221] = 37,
}

local __key_map = { 
    id = 1,
    name = 2,
    map_id = 3,
    type = 4,
    open_time = 5,
    end_time = 6,
    min_x = 7,
    max_x = 8,
    min_y = 9,
    max_y = 10,
    value_1 = 11,
    value_2 = 12,
    value_3 = 13,
    value_4 = 14,
    value_5 = 15,
    value_6 = 16,
    object_id = 17,
    effect_state_1 = 18,
    effect_value_1 = 19,
    effect_state_2 = 20,
    effect_value_2 = 21,
    effect_state_3 = 22,
    effect_value_3 = 23,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_gvg_grid_info")

        return t._raw[__key_map[k]]
    end
}


function gvg_grid_info.getLength()
    return #gvg_grid_info._data
end



function gvg_grid_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_gvg_grid_info
function gvg_grid_info.indexOf(index)
    if index == nil or not gvg_grid_info._data[index] then
        return nil
    end
    return setmetatable({_raw = gvg_grid_info._data[index]}, m)
end



---
--@return @class record_gvg_grid_info
function gvg_grid_info.get(id)
    
    return gvg_grid_info.indexOf(__index_id[ id ])
     
end



function gvg_grid_info.set(id, key, value)
    local record = gvg_grid_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function gvg_grid_info.get_index_data()
    return __index_id 
end

return  gvg_grid_info 