---@classdef record_knight_advance_material_info
local record_knight_advance_material_info = {}


record_knight_advance_material_info.id = 0--序号
record_knight_advance_material_info.name =  ""--材料名称
record_knight_advance_material_info.icon =  ""--图标
record_knight_advance_material_info.script_type = 0--角标类型
record_knight_advance_material_info.script_text =  ""--特殊角标
record_knight_advance_material_info.description =  ""--描述
record_knight_advance_material_info.quality = 0--品质
record_knight_advance_material_info.sell_value = 0--出售返还
record_knight_advance_material_info.compose_id = 0--引用合成ID
record_knight_advance_material_info.gm = 0--是否GM后台发送
record_knight_advance_material_info.shop_id = 0--购买id
record_knight_advance_material_info.if_reel = 0--是否是合成卷轴

local knight_advance_material_info = {
   _data = {   
    [1] = {1,"燕辞戒+1","101",1,"+1","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,20,0,1,100001,0,},  
    [2] = {2,"燕辞链+1","201",1,"+1","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,20,0,1,100002,0,},  
    [3] = {3,"燕辞镯+1","301",1,"+1","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,20,0,1,100003,0,},  
    [4] = {4,"燕辞佩+1","401",1,"+1","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,20,0,1,100004,0,},  
    [5] = {5,"燕辞戒+2","102",1,"+2","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,30,1,1,100005,0,},  
    [6] = {6,"燕辞链+2","202",1,"+2","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,30,2,1,100006,0,},  
    [7] = {7,"燕辞镯+2","302",1,"+2","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,30,3,1,100007,0,},  
    [8] = {8,"燕辞佩+2","402",1,"+2","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,30,4,1,100008,0,},  
    [9] = {9,"燕辞戒+3","103",1,"+3","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,40,5,1,100009,0,},  
    [10] = {10,"燕辞链+3","203",1,"+3","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,40,6,1,100010,0,},  
    [11] = {11,"燕辞镯+3","303",1,"+3","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,40,7,1,100011,0,},  
    [12] = {12,"燕辞佩+3","403",1,"+3","精美的饰品，可用于武将进阶。后人有诗赞叹其物：群燕辞归雁南翔，念君客游思断肠。",2,40,8,1,100012,0,},  
    [13] = {13,"惊雷戒+1","111",1,"+1","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,50,9,1,100013,0,},  
    [14] = {14,"惊雷链+1","211",1,"+1","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,50,10,1,100014,0,},  
    [15] = {15,"惊雷镯+1","311",1,"+1","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,50,11,1,100015,0,},  
    [16] = {16,"惊雷佩+1","411",1,"+1","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,50,12,1,100016,0,},  
    [17] = {17,"惊雷戒+2","112",1,"+2","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,60,13,1,100017,0,},  
    [18] = {18,"惊雷链+2","212",1,"+2","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,60,14,1,100018,0,},  
    [19] = {19,"惊雷镯+2","312",1,"+2","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,60,15,1,100019,0,},  
    [20] = {20,"惊雷佩+2","412",1,"+2","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,60,16,1,100020,0,},  
    [21] = {21,"惊雷戒+3","113",1,"+3","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,70,17,1,100021,0,},  
    [22] = {22,"惊雷链+3","213",1,"+3","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,70,18,1,100022,0,},  
    [23] = {23,"惊雷镯+3","313",1,"+3","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,70,19,1,100023,0,},  
    [24] = {24,"惊雷佩+3","413",1,"+3","名贵的饰品，可用于武将进阶。后人有诗赞叹其物：专待春雷惊梦回，一声长啸安天下。",3,70,20,1,100024,0,},  
    [25] = {25,"烈焰戒+1","121",1,"+1","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,80,21,1,100025,0,},  
    [26] = {26,"烈焰链+1","221",1,"+1","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,80,22,1,100026,0,},  
    [27] = {27,"烈焰镯+1","321",1,"+1","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,80,23,1,100027,0,},  
    [28] = {28,"烈焰佩+1","421",1,"+1","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,80,24,1,100028,0,},  
    [29] = {29,"烈焰戒+2","122",1,"+2","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,90,25,1,100029,0,},  
    [30] = {30,"烈焰链+2","222",1,"+2","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,90,26,1,100030,0,},  
    [31] = {31,"烈焰镯+2","322",1,"+2","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,90,27,1,100031,0,},  
    [32] = {32,"烈焰佩+2","422",1,"+2","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,90,28,1,100032,0,},  
    [33] = {33,"烈焰戒+3","123",1,"+3","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,100,29,1,100033,0,},  
    [34] = {34,"烈焰链+3","223",1,"+3","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,100,30,1,100034,0,},  
    [35] = {35,"烈焰镯+3","323",1,"+3","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,100,31,1,100035,0,},  
    [36] = {36,"烈焰佩+3","423",1,"+3","珍贵的饰品，可用于武将进阶。后人有诗赞叹其物：谷口风狂烈焰飘，何期骤雨降青霄。",4,100,32,1,100036,0,},  
    [37] = {37,"飞虎出云戒+1","131",1,"+1","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,110,33,1,100037,0,},  
    [38] = {38,"飞虎出云链+1","231",1,"+1","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,110,34,1,100038,0,},  
    [39] = {39,"飞虎出云镯+1","331",1,"+1","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,110,35,1,100039,0,},  
    [40] = {40,"飞虎出云佩+1","431",1,"+1","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,110,36,1,100040,0,},  
    [41] = {41,"飞虎出云戒+2","132",1,"+2","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,120,37,1,100041,0,},  
    [42] = {42,"飞虎出云链+2","232",1,"+2","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,120,38,1,100042,0,},  
    [43] = {43,"飞虎出云镯+2","332",1,"+2","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,120,39,1,100043,0,},  
    [44] = {44,"飞虎出云佩+2","432",1,"+2","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,120,40,1,100044,0,},  
    [45] = {45,"飞虎出云戒+3","133",1,"+3","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,130,41,1,100045,0,},  
    [46] = {46,"飞虎出云链+3","233",1,"+3","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,130,42,1,100046,0,},  
    [47] = {47,"飞虎出云镯+3","333",1,"+3","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,130,43,1,100047,0,},  
    [48] = {48,"飞虎出云佩+3","433",1,"+3","罕见的饰品，可用于武将进阶。后人有诗赞叹其物：曹操军中飞虎出，赵云怀内小龙眠",5,130,44,1,100048,0,},  
    [49] = {49,"火凤飞星戒+1","141",1,"+1","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,140,45,1,100049,0,},  
    [50] = {50,"火凤飞星链+1","241",1,"+1","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,140,46,1,100050,0,},  
    [51] = {51,"火凤飞星镯+1","341",1,"+1","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,140,47,1,100051,0,},  
    [52] = {52,"火凤飞星佩+1","441",1,"+1","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,140,48,1,100052,0,},  
    [53] = {53,"火凤飞星戒+2","142",1,"+2","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,150,49,1,100053,0,},  
    [54] = {54,"火凤飞星链+2","242",1,"+2","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,150,50,1,100054,0,},  
    [55] = {55,"火凤飞星镯+2","342",1,"+2","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,150,51,1,100055,0,},  
    [56] = {56,"火凤飞星佩+2","442",1,"+2","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,150,52,1,100056,0,},  
    [57] = {57,"火凤飞星戒+3","143",1,"+3","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,160,53,1,100057,0,},  
    [58] = {58,"火凤飞星链+3","243",1,"+3","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,160,54,1,100058,0,},  
    [59] = {59,"火凤飞星镯+3","343",1,"+3","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,160,55,1,100059,0,},  
    [60] = {60,"火凤飞星佩+3","443",1,"+3","绝世的饰品，可用于武将进阶。后人有诗赞叹其物：星飞庞统骥，箭发鲁连书。",6,160,56,1,100060,0,},  
    [61] = {61,"苍龙补天戒+1","151",1,"+1","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,170,57,1,100061,0,},  
    [62] = {62,"苍龙补天链+1","251",1,"+1","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,170,58,1,100062,0,},  
    [63] = {63,"苍龙补天镯+1","351",1,"+1","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,170,59,1,100063,0,},  
    [64] = {64,"苍龙补天佩+1","451",1,"+1","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,170,60,1,100064,0,},  
    [65] = {65,"苍龙补天戒+2","152",1,"+2","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,180,61,1,100065,0,},  
    [66] = {66,"苍龙补天链+2","252",1,"+2","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,180,62,1,100066,0,},  
    [67] = {67,"苍龙补天镯+2","352",1,"+2","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,180,63,1,100067,0,},  
    [68] = {68,"苍龙补天佩+2","452",1,"+2","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,180,64,1,100068,0,},  
    [69] = {69,"苍龙补天戒+3","153",1,"+3","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,190,65,1,100069,0,},  
    [70] = {70,"苍龙补天链+3","253",1,"+3","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,190,66,1,100070,0,},  
    [71] = {71,"苍龙补天镯+3","353",1,"+3","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,190,67,1,100071,0,},  
    [72] = {72,"苍龙补天佩+3","453",1,"+3","传说中的饰品，可用于武将进阶。后人有诗赞叹其物：先取荆州后取川，大展经纶补天手。",7,190,68,1,100072,0,},  
    [73] = {73,"饰品合成卷轴","1000",0,"0","武将进阶饰品材料合成卷轴",3,10,0,1,100073,1,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,  
    [56] = 56,  
    [57] = 57,  
    [58] = 58,  
    [59] = 59,  
    [60] = 60,  
    [61] = 61,  
    [62] = 62,  
    [63] = 63,  
    [64] = 64,  
    [65] = 65,  
    [66] = 66,  
    [67] = 67,  
    [68] = 68,  
    [69] = 69,  
    [70] = 70,  
    [71] = 71,  
    [72] = 72,  
    [73] = 73,
}

local __key_map = { 
    id = 1,
    name = 2,
    icon = 3,
    script_type = 4,
    script_text = 5,
    description = 6,
    quality = 7,
    sell_value = 8,
    compose_id = 9,
    gm = 10,
    shop_id = 11,
    if_reel = 12,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_knight_advance_material_info")

        return t._raw[__key_map[k]]
    end
}


function knight_advance_material_info.getLength()
    return #knight_advance_material_info._data
end



function knight_advance_material_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_knight_advance_material_info
function knight_advance_material_info.indexOf(index)
    if index == nil or not knight_advance_material_info._data[index] then
        return nil
    end
    return setmetatable({_raw = knight_advance_material_info._data[index]}, m)
end



---
--@return @class record_knight_advance_material_info
function knight_advance_material_info.get(id)
    
    return knight_advance_material_info.indexOf(__index_id[ id ])
     
end



function knight_advance_material_info.set(id, key, value)
    local record = knight_advance_material_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function knight_advance_material_info.get_index_data()
    return __index_id 
end

return  knight_advance_material_info 