---@classdef record_knight_awake_info
local record_knight_awake_info = {}


record_knight_awake_info.id = 0--id
record_knight_awake_info.awake_stage = 0--觉醒阶段
record_knight_awake_info.awake_name =  ""--觉醒名称
record_knight_awake_info.text_res = 0--名称
record_knight_awake_info.res = 0--图标资源
record_knight_awake_info.open_level = 0--所需等级
record_knight_awake_info.max_level = 0--等级上限
record_knight_awake_info.awake_task = 0--觉醒任务
record_knight_awake_info.awake_pendant = 0--觉醒饰品
record_knight_awake_info.talent_skill = 0--觉醒天赋
record_knight_awake_info.attribute_type1 = 0--增加属性类型1
record_knight_awake_info.attribute_value1 = 0--增加属性类型值1
record_knight_awake_info.attribute_type2 = 0--增加属性类型2
record_knight_awake_info.attribute_value2 = 0--增加属性类型值2
record_knight_awake_info.attribute_type3 = 0--增加属性类型3
record_knight_awake_info.attribute_value3 = 0--增加属性类型值3
record_knight_awake_info.attribute_type4 = 0--增加属性类型4
record_knight_awake_info.attribute_value4 = 0--增加属性类型值4
record_knight_awake_info.attribute_type5 = 0--增加属性类型5
record_knight_awake_info.attribute_value5 = 0--增加属性类型值5
record_knight_awake_info.attribute_type6 = 0--增加属性类型6
record_knight_awake_info.attribute_value6 = 0--增加属性类型值6
record_knight_awake_info.new_function =  ""--开启描述
record_knight_awake_info.pendant_desc =  ""--饰品描述
record_knight_awake_info.item_type = 0--觉醒道具类型
record_knight_awake_info.item_value = 0--觉醒道具类型值
record_knight_awake_info.cost_num = 0--觉醒道具数量
record_knight_awake_info.get_num = 0--重生返还数量

local knight_awake_info = {
   _data = {   
    [1] = {1001,0,"未觉醒",NaN,0,0,120,1001,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [2] = {1001,1,"超凡一觉",NaN,0,120,160,1001,110030,400101,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [3] = {1001,2,"无双二觉",NaN,0,160,200,1101,110130,400102,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [4] = {1002,0,"未觉醒",NaN,0,0,120,1002,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [5] = {1002,1,"超凡一觉",NaN,0,120,160,1002,110010,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [6] = {1002,2,"无双二觉",NaN,0,160,200,1102,110110,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [7] = {1003,0,"未觉醒",NaN,0,0,120,1003,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [8] = {1003,1,"超凡一觉",NaN,0,120,160,1003,110020,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [9] = {1003,2,"无双二觉",NaN,0,160,200,1103,110120,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [10] = {1004,0,"未觉醒",NaN,0,0,120,1004,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [11] = {1004,1,"超凡一觉",NaN,0,120,160,1004,110010,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [12] = {1004,2,"无双二觉",NaN,0,160,200,1104,110110,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [13] = {1005,0,"未觉醒",NaN,0,0,120,1005,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [14] = {1005,1,"超凡一觉",NaN,0,120,160,1005,110020,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [15] = {1005,2,"无双二觉",NaN,0,160,200,1105,110120,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [16] = {1006,0,"未觉醒",NaN,0,0,120,1006,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [17] = {1006,1,"超凡一觉",NaN,0,120,160,1006,110020,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [18] = {1006,2,"无双二觉",NaN,0,160,200,1106,110120,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [19] = {1007,0,"未觉醒",NaN,0,0,120,1007,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [20] = {1007,1,"超凡一觉",NaN,0,120,160,1007,110010,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [21] = {1007,2,"无双二觉",NaN,0,160,200,1107,110110,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [22] = {1008,0,"未觉醒",NaN,0,0,120,1008,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [23] = {1008,1,"超凡一觉",NaN,0,120,160,1008,110020,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [24] = {1008,2,"无双二觉",NaN,0,160,200,1108,110120,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [25] = {1009,0,"未觉醒",NaN,0,0,120,1009,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [26] = {1009,1,"超凡一觉",NaN,0,120,160,1009,110010,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [27] = {1009,2,"无双二觉",NaN,0,160,200,1109,110110,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [28] = {1010,0,"未觉醒",NaN,0,0,120,1010,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [29] = {1010,1,"超凡一觉",NaN,0,120,160,1010,110030,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [30] = {1010,2,"无双二觉",NaN,0,160,200,1110,110130,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [31] = {1011,0,"未觉醒",NaN,0,0,120,1011,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [32] = {1011,1,"超凡一觉",NaN,0,120,160,1011,110040,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [33] = {1011,2,"无双二觉",NaN,0,160,200,1111,110140,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [34] = {1012,0,"未觉醒",NaN,0,0,120,1012,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [35] = {1012,1,"超凡一觉",NaN,0,120,160,1012,110040,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [36] = {1012,2,"无双二觉",NaN,0,160,200,1112,110140,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [37] = {1013,0,"未觉醒",NaN,0,0,120,1013,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [38] = {1013,1,"超凡一觉",NaN,0,120,160,1013,110030,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [39] = {1013,2,"无双二觉",NaN,0,160,200,1113,110130,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [40] = {1014,0,"未觉醒",NaN,0,0,120,1014,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [41] = {1014,1,"超凡一觉",NaN,0,120,160,1014,110030,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [42] = {1014,2,"无双二觉",NaN,0,160,200,1114,110130,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [43] = {1015,0,"未觉醒",NaN,0,0,120,1015,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [44] = {1015,1,"超凡一觉",NaN,0,120,160,1015,110030,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [45] = {1015,2,"无双二觉",NaN,0,160,200,1115,110130,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [46] = {1016,0,"未觉醒",NaN,0,0,120,1016,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [47] = {1016,1,"超凡一觉",NaN,0,120,160,1016,110040,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [48] = {1016,2,"无双二觉",NaN,0,160,200,1116,110140,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [49] = {1017,0,"未觉醒",NaN,0,0,120,1017,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [50] = {1017,1,"超凡一觉",NaN,0,120,160,1017,110040,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [51] = {1017,2,"无双二觉",NaN,0,160,200,1117,110140,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [52] = {1018,0,"未觉醒",NaN,0,0,120,1018,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [53] = {1018,1,"超凡一觉",NaN,0,120,160,1018,110050,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [54] = {1018,2,"无双二觉",NaN,0,160,200,1118,110150,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [55] = {1019,0,"未觉醒",NaN,0,0,120,1019,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [56] = {1019,1,"超凡一觉",NaN,0,120,160,1019,110050,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [57] = {1019,2,"无双二觉",NaN,0,160,200,1119,110150,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [58] = {1020,0,"未觉醒",NaN,0,0,120,1020,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [59] = {1020,1,"超凡一觉",NaN,0,120,160,1020,110050,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [60] = {1020,2,"无双二觉",NaN,0,160,200,1120,110150,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [61] = {1021,0,"未觉醒",NaN,0,0,120,1021,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [62] = {1021,1,"超凡一觉",NaN,0,120,160,1021,110050,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [63] = {1021,2,"无双二觉",NaN,0,160,200,1121,110150,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [64] = {1022,0,"未觉醒",NaN,0,0,120,1022,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [65] = {1022,1,"超凡一觉",NaN,0,120,160,1022,110040,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [66] = {1022,2,"无双二觉",NaN,0,160,200,1122,110140,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [67] = {1023,0,"未觉醒",NaN,0,0,120,1023,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [68] = {1023,1,"超凡一觉",NaN,0,120,160,1023,110040,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [69] = {1023,2,"无双二觉",NaN,0,160,200,1123,110140,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [70] = {1024,0,"未觉醒",NaN,0,0,120,1024,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [71] = {1024,1,"超凡一觉",NaN,0,120,160,1024,110040,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [72] = {1024,2,"无双二觉",NaN,0,160,200,1124,110140,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [73] = {1025,0,"未觉醒",NaN,0,0,120,1025,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [74] = {1025,1,"超凡一觉",NaN,0,120,160,1025,110040,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [75] = {1025,2,"无双二觉",NaN,0,160,200,1125,110140,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [76] = {1026,0,"未觉醒",NaN,0,0,120,1026,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [77] = {1026,1,"超凡一觉",NaN,0,120,160,1026,110010,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [78] = {1026,2,"无双二觉",NaN,0,160,200,1126,110110,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [79] = {1027,0,"未觉醒",NaN,0,0,120,1027,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [80] = {1027,1,"超凡一觉",NaN,0,120,160,1027,110030,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [81] = {1027,2,"无双二觉",NaN,0,160,200,1127,110130,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [82] = {1028,0,"未觉醒",NaN,0,0,120,1028,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [83] = {1028,1,"超凡一觉",NaN,0,120,160,1028,110010,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [84] = {1028,2,"无双二觉",NaN,0,160,200,1128,110110,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [85] = {1029,0,"未觉醒",NaN,0,0,120,1029,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [86] = {1029,1,"超凡一觉",NaN,0,120,160,1029,110010,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [87] = {1029,2,"无双二觉",NaN,0,160,200,1129,110110,400122,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [88] = {1030,0,"未觉醒",NaN,0,0,120,1030,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [89] = {1030,1,"超凡一觉",NaN,0,120,160,1030,110010,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [90] = {1030,2,"无双二觉",NaN,0,160,200,1130,110110,400132,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [91] = {1031,0,"未觉醒",NaN,0,0,120,1031,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [92] = {1031,1,"超凡一觉",NaN,0,120,160,1031,110010,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [93] = {1031,2,"无双二觉",NaN,0,160,200,1131,110110,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [94] = {1032,0,"未觉醒",NaN,0,0,120,1032,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [95] = {1032,1,"超凡一觉",NaN,0,120,160,1032,110010,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [96] = {1032,2,"无双二觉",NaN,0,160,200,1132,110110,400112,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [97] = {1033,0,"未觉醒",NaN,0,0,120,1033,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [98] = {1033,1,"超凡一觉",NaN,0,120,160,1033,110010,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [99] = {1033,2,"无双二觉",NaN,0,160,200,1133,110110,400142,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},  
    [100] = {1034,0,"未觉醒",NaN,0,0,120,1034,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",0,0,0,0,},  
    [101] = {1034,1,"超凡一觉",NaN,0,120,160,1034,110030,400151,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",3,218,1,1,},  
    [102] = {1034,2,"无双二觉",NaN,0,160,200,1134,110130,400152,1,27600000,2,1449000,3,713000,4,713000,0,0,0,0,"等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页","等级上限：200级\n进阶上限：20阶\n培养阶段：开启太微将星页",3,239,1,1,},
    }
}

local __index_id_awake_stage = {   
    ["1001_0"] = 1,  
    ["1001_1"] = 2,  
    ["1001_2"] = 3,  
    ["1002_0"] = 4,  
    ["1002_1"] = 5,  
    ["1002_2"] = 6,  
    ["1003_0"] = 7,  
    ["1003_1"] = 8,  
    ["1003_2"] = 9,  
    ["1004_0"] = 10,  
    ["1004_1"] = 11,  
    ["1004_2"] = 12,  
    ["1005_0"] = 13,  
    ["1005_1"] = 14,  
    ["1005_2"] = 15,  
    ["1006_0"] = 16,  
    ["1006_1"] = 17,  
    ["1006_2"] = 18,  
    ["1007_0"] = 19,  
    ["1007_1"] = 20,  
    ["1007_2"] = 21,  
    ["1008_0"] = 22,  
    ["1008_1"] = 23,  
    ["1008_2"] = 24,  
    ["1009_0"] = 25,  
    ["1009_1"] = 26,  
    ["1009_2"] = 27,  
    ["1010_0"] = 28,  
    ["1010_1"] = 29,  
    ["1010_2"] = 30,  
    ["1011_0"] = 31,  
    ["1011_1"] = 32,  
    ["1011_2"] = 33,  
    ["1012_0"] = 34,  
    ["1012_1"] = 35,  
    ["1012_2"] = 36,  
    ["1013_0"] = 37,  
    ["1013_1"] = 38,  
    ["1013_2"] = 39,  
    ["1014_0"] = 40,  
    ["1014_1"] = 41,  
    ["1014_2"] = 42,  
    ["1015_0"] = 43,  
    ["1015_1"] = 44,  
    ["1015_2"] = 45,  
    ["1016_0"] = 46,  
    ["1016_1"] = 47,  
    ["1016_2"] = 48,  
    ["1017_0"] = 49,  
    ["1017_1"] = 50,  
    ["1017_2"] = 51,  
    ["1018_0"] = 52,  
    ["1018_1"] = 53,  
    ["1018_2"] = 54,  
    ["1019_0"] = 55,  
    ["1019_1"] = 56,  
    ["1019_2"] = 57,  
    ["1020_0"] = 58,  
    ["1020_1"] = 59,  
    ["1020_2"] = 60,  
    ["1021_0"] = 61,  
    ["1021_1"] = 62,  
    ["1021_2"] = 63,  
    ["1022_0"] = 64,  
    ["1022_1"] = 65,  
    ["1022_2"] = 66,  
    ["1023_0"] = 67,  
    ["1023_1"] = 68,  
    ["1023_2"] = 69,  
    ["1024_0"] = 70,  
    ["1024_1"] = 71,  
    ["1024_2"] = 72,  
    ["1025_0"] = 73,  
    ["1025_1"] = 74,  
    ["1025_2"] = 75,  
    ["1026_0"] = 76,  
    ["1026_1"] = 77,  
    ["1026_2"] = 78,  
    ["1027_0"] = 79,  
    ["1027_1"] = 80,  
    ["1027_2"] = 81,  
    ["1028_0"] = 82,  
    ["1028_1"] = 83,  
    ["1028_2"] = 84,  
    ["1029_0"] = 85,  
    ["1029_1"] = 86,  
    ["1029_2"] = 87,  
    ["1030_0"] = 88,  
    ["1030_1"] = 89,  
    ["1030_2"] = 90,  
    ["1031_0"] = 91,  
    ["1031_1"] = 92,  
    ["1031_2"] = 93,  
    ["1032_0"] = 94,  
    ["1032_1"] = 95,  
    ["1032_2"] = 96,  
    ["1033_0"] = 97,  
    ["1033_1"] = 98,  
    ["1033_2"] = 99,  
    ["1034_0"] = 100,  
    ["1034_1"] = 101,  
    ["1034_2"] = 102,
}

local __key_map = { 
    id = 1,
    awake_stage = 2,
    awake_name = 3,
    text_res = 4,
    res = 5,
    open_level = 6,
    max_level = 7,
    awake_task = 8,
    awake_pendant = 9,
    talent_skill = 10,
    attribute_type1 = 11,
    attribute_value1 = 12,
    attribute_type2 = 13,
    attribute_value2 = 14,
    attribute_type3 = 15,
    attribute_value3 = 16,
    attribute_type4 = 17,
    attribute_value4 = 18,
    attribute_type5 = 19,
    attribute_value5 = 20,
    attribute_type6 = 21,
    attribute_value6 = 22,
    new_function = 23,
    pendant_desc = 24,
    item_type = 25,
    item_value = 26,
    cost_num = 27,
    get_num = 28,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_knight_awake_info")

        return t._raw[__key_map[k]]
    end
}


function knight_awake_info.getLength()
    return #knight_awake_info._data
end



function knight_awake_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_knight_awake_info
function knight_awake_info.indexOf(index)
    if index == nil or not knight_awake_info._data[index] then
        return nil
    end
    return setmetatable({_raw = knight_awake_info._data[index]}, m)
end



---
--@return @class record_knight_awake_info
function knight_awake_info.get(id,awake_stage)
    
    local k = id .. '_' .. awake_stage
    return knight_awake_info.indexOf(__index_id_awake_stage[k])
     
end



function knight_awake_info.set(id,awake_stage, key, value)
    local record = knight_awake_info.get(id,awake_stage)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function knight_awake_info.get_index_data()
    return __index_id_awake_stage 
end

return  knight_awake_info 