---@classdef record_knight_awake_info
local record_knight_awake_info = {}


record_knight_awake_info.id = 0--id
record_knight_awake_info.awake_stage = 0--觉醒阶段
record_knight_awake_info.awake_name =  ""--觉醒名称
record_knight_awake_info.text_res = 0--名称
record_knight_awake_info.res = 0--图标资源
record_knight_awake_info.open_level = 0--所需等级
record_knight_awake_info.max_level = 0--等级上限
record_knight_awake_info.awake_task = 0--觉醒任务
record_knight_awake_info.awake_pendant = 0--觉醒饰品
record_knight_awake_info.talent_skill = 0--觉醒天赋
record_knight_awake_info.attribute_type1 = 0--增加属性类型1
record_knight_awake_info.attribute_value1 = 0--增加属性类型值1
record_knight_awake_info.attribute_type2 = 0--增加属性类型2
record_knight_awake_info.attribute_value2 = 0--增加属性类型值2
record_knight_awake_info.attribute_type3 = 0--增加属性类型3
record_knight_awake_info.attribute_value3 = 0--增加属性类型值3
record_knight_awake_info.attribute_type4 = 0--增加属性类型4
record_knight_awake_info.attribute_value4 = 0--增加属性类型值4
record_knight_awake_info.attribute_type5 = 0--增加属性类型5
record_knight_awake_info.attribute_value5 = 0--增加属性类型值5
record_knight_awake_info.attribute_type6 = 0--增加属性类型6
record_knight_awake_info.attribute_value6 = 0--增加属性类型值6
record_knight_awake_info.new_function =  ""--开启描述
record_knight_awake_info.pendant_desc =  ""--饰品描述

local knight_awake_info = {
   _data = {   
    [1] = {1001,0,"未觉醒",NaN,0,0,120,1001,0,0,0,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [2] = {1001,1,"超凡一觉",NaN,0,120,160,1001,110030,400101,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [3] = {1002,0,"未觉醒",NaN,0,0,120,1002,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [4] = {1002,1,"超凡一觉",NaN,0,120,160,1002,110010,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [5] = {1003,0,"未觉醒",NaN,0,0,120,1003,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [6] = {1003,1,"超凡一觉",NaN,0,120,160,1003,110020,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [7] = {1004,0,"未觉醒",NaN,0,0,120,1004,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [8] = {1004,1,"超凡一觉",NaN,0,120,160,1004,110010,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [9] = {1005,0,"未觉醒",NaN,0,0,120,1005,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [10] = {1005,1,"超凡一觉",NaN,0,120,160,1005,110020,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [11] = {1006,0,"未觉醒",NaN,0,0,120,1006,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [12] = {1006,1,"超凡一觉",NaN,0,120,160,1006,110020,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [13] = {1007,0,"未觉醒",NaN,0,0,120,1007,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [14] = {1007,1,"超凡一觉",NaN,0,120,160,1007,110010,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [15] = {1008,0,"未觉醒",NaN,0,0,120,1008,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [16] = {1008,1,"超凡一觉",NaN,0,120,160,1008,110020,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [17] = {1009,0,"未觉醒",NaN,0,0,120,1009,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [18] = {1009,1,"超凡一觉",NaN,0,120,160,1009,110010,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [19] = {1010,0,"未觉醒",NaN,0,0,120,1010,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [20] = {1010,1,"超凡一觉",NaN,0,120,160,1010,110030,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [21] = {1011,0,"未觉醒",NaN,0,0,120,1011,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [22] = {1011,1,"超凡一觉",NaN,0,120,160,1011,110040,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [23] = {1012,0,"未觉醒",NaN,0,0,120,1012,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [24] = {1012,1,"超凡一觉",NaN,0,120,160,1012,110040,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [25] = {1013,0,"未觉醒",NaN,0,0,120,1013,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [26] = {1013,1,"超凡一觉",NaN,0,120,160,1013,110030,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [27] = {1014,0,"未觉醒",NaN,0,0,120,1014,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [28] = {1014,1,"超凡一觉",NaN,0,120,160,1014,110030,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [29] = {1015,0,"未觉醒",NaN,0,0,120,1015,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [30] = {1015,1,"超凡一觉",NaN,0,120,160,1015,110030,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [31] = {1016,0,"未觉醒",NaN,0,0,120,1016,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [32] = {1016,1,"超凡一觉",NaN,0,120,160,1016,110040,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [33] = {1017,0,"未觉醒",NaN,0,0,120,1017,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [34] = {1017,1,"超凡一觉",NaN,0,120,160,1017,110040,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [35] = {1018,0,"未觉醒",NaN,0,0,120,1018,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [36] = {1018,1,"超凡一觉",NaN,0,120,160,1018,110050,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [37] = {1019,0,"未觉醒",NaN,0,0,120,1019,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [38] = {1019,1,"超凡一觉",NaN,0,120,160,1019,110050,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [39] = {1020,0,"未觉醒",NaN,0,0,120,1020,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [40] = {1020,1,"超凡一觉",NaN,0,120,160,1020,110050,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [41] = {1021,0,"未觉醒",NaN,0,0,120,1021,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [42] = {1021,1,"超凡一觉",NaN,0,120,160,1021,110050,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [43] = {1022,0,"未觉醒",NaN,0,0,120,1022,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [44] = {1022,1,"超凡一觉",NaN,0,120,160,1022,110040,400111,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [45] = {1023,0,"未觉醒",NaN,0,0,120,1023,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [46] = {1023,1,"超凡一觉",NaN,0,120,160,1023,110040,400121,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [47] = {1024,0,"未觉醒",NaN,0,0,120,1024,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [48] = {1024,1,"超凡一觉",NaN,0,120,160,1024,110040,400131,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},  
    [49] = {1025,0,"未觉醒",NaN,0,0,120,1025,0,0,1,0,0,0,0,0,0,0,0,0,0,0,"0","0",},  
    [50] = {1025,1,"超凡一觉",NaN,0,120,160,1025,110040,400141,1,12000000,2,630000,3,310000,4,310000,0,0,0,0,"等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页","等级上限：160级\n进阶上限：16阶\n培养阶段：开启太微将星页",},
    }
}

local __index_id_awake_stage = {   
    ["1001_0"] = 1,  
    ["1001_1"] = 2,  
    ["1002_0"] = 3,  
    ["1002_1"] = 4,  
    ["1003_0"] = 5,  
    ["1003_1"] = 6,  
    ["1004_0"] = 7,  
    ["1004_1"] = 8,  
    ["1005_0"] = 9,  
    ["1005_1"] = 10,  
    ["1006_0"] = 11,  
    ["1006_1"] = 12,  
    ["1007_0"] = 13,  
    ["1007_1"] = 14,  
    ["1008_0"] = 15,  
    ["1008_1"] = 16,  
    ["1009_0"] = 17,  
    ["1009_1"] = 18,  
    ["1010_0"] = 19,  
    ["1010_1"] = 20,  
    ["1011_0"] = 21,  
    ["1011_1"] = 22,  
    ["1012_0"] = 23,  
    ["1012_1"] = 24,  
    ["1013_0"] = 25,  
    ["1013_1"] = 26,  
    ["1014_0"] = 27,  
    ["1014_1"] = 28,  
    ["1015_0"] = 29,  
    ["1015_1"] = 30,  
    ["1016_0"] = 31,  
    ["1016_1"] = 32,  
    ["1017_0"] = 33,  
    ["1017_1"] = 34,  
    ["1018_0"] = 35,  
    ["1018_1"] = 36,  
    ["1019_0"] = 37,  
    ["1019_1"] = 38,  
    ["1020_0"] = 39,  
    ["1020_1"] = 40,  
    ["1021_0"] = 41,  
    ["1021_1"] = 42,  
    ["1022_0"] = 43,  
    ["1022_1"] = 44,  
    ["1023_0"] = 45,  
    ["1023_1"] = 46,  
    ["1024_0"] = 47,  
    ["1024_1"] = 48,  
    ["1025_0"] = 49,  
    ["1025_1"] = 50,
}

local __key_map = { 
    id = 1,
    awake_stage = 2,
    awake_name = 3,
    text_res = 4,
    res = 5,
    open_level = 6,
    max_level = 7,
    awake_task = 8,
    awake_pendant = 9,
    talent_skill = 10,
    attribute_type1 = 11,
    attribute_value1 = 12,
    attribute_type2 = 13,
    attribute_value2 = 14,
    attribute_type3 = 15,
    attribute_value3 = 16,
    attribute_type4 = 17,
    attribute_value4 = 18,
    attribute_type5 = 19,
    attribute_value5 = 20,
    attribute_type6 = 21,
    attribute_value6 = 22,
    new_function = 23,
    pendant_desc = 24,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_knight_awake_info")

        return t._raw[__key_map[k]]
    end
}


function knight_awake_info.getLength()
    return #knight_awake_info._data
end



function knight_awake_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_knight_awake_info
function knight_awake_info.indexOf(index)
    if index == nil or not knight_awake_info._data[index] then
        return nil
    end
    return setmetatable({_raw = knight_awake_info._data[index]}, m)
end



---
--@return @class record_knight_awake_info
function knight_awake_info.get(id,awake_stage)
    
    local k = id .. '_' .. awake_stage
    return knight_awake_info.indexOf(__index_id_awake_stage[k])
     
end



function knight_awake_info.set(id,awake_stage, key, value)
    local record = knight_awake_info.get(id,awake_stage)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function knight_awake_info.get_index_data()
    return __index_id_awake_stage 
end

return  knight_awake_info 