---@classdef record_ksoul_info
local record_ksoul_info = {}


record_ksoul_info.id = 0--ID
record_ksoul_info.name =  ""--名称
record_ksoul_info.icon = 0--图标
record_ksoul_info.quality = 0--品质
record_ksoul_info.group = 0--阵营
record_ksoul_info.description =  ""--描述
record_ksoul_info.sale_type = 0--出售道具
record_ksoul_info.sale_value = 0--出售道具值
record_ksoul_info.sale_size = 0--出售价格

local ksoul_info = {
   _data = {   
    [1] = {400060,"命星·孟获",400060,4,2,"占星获得的神秘晶石，记录着孟获的命运故事，可以组成命星谱",1,11,300,},  
    [2] = {400070,"命星·祝融",400070,4,2,"占星获得的神秘晶石，记录着祝融的命运故事，可以组成命星谱",1,11,300,},  
    [3] = {400130,"命星·孙尚香",400130,4,3,"占星获得的神秘晶石，记录着孙尚香的命运故事，可以组成命星谱",1,11,300,},  
    [4] = {400010,"命星·于禁",400010,5,1,"占星获得的神秘晶石，记录着于禁的命运故事，可以组成命星谱",1,11,500,},  
    [5] = {400020,"命星·曹丕",400020,5,1,"占星获得的神秘晶石，记录着曹丕的命运故事，可以组成命星谱",1,11,500,},  
    [6] = {400030,"命星·乐进",400030,5,1,"占星获得的神秘晶石，记录着乐进的命运故事，可以组成命星谱",1,11,500,},  
    [7] = {400040,"命星·庞德",400040,5,1,"占星获得的神秘晶石，记录着庞德的命运故事，可以组成命星谱",1,11,500,},  
    [8] = {400050,"命星·步练师",400050,5,3,"占星获得的神秘晶石，记录着步练师的命运故事，可以组成命星谱",1,11,500,},  
    [9] = {400080,"命星·法正",400080,5,2,"占星获得的神秘晶石，记录着法正的命运故事，可以组成命星谱",1,11,500,},  
    [10] = {400090,"命星·程普",400090,5,3,"占星获得的神秘晶石，记录着程普的命运故事，可以组成命星谱",1,11,500,},  
    [11] = {400100,"命星·周泰",400100,5,3,"占星获得的神秘晶石，记录着周泰的命运故事，可以组成命星谱",1,11,500,},  
    [12] = {400110,"命星·黄盖",400110,5,3,"占星获得的神秘晶石，记录着黄盖的命运故事，可以组成命星谱",1,11,500,},  
    [13] = {400120,"命星·徐盛",400120,5,3,"占星获得的神秘晶石，记录着徐盛的命运故事，可以组成命星谱",1,11,500,},  
    [14] = {400140,"命星·颜良",400140,5,4,"占星获得的神秘晶石，记录着颜良的命运故事，可以组成命星谱",1,11,500,},  
    [15] = {400150,"命星·文丑",400150,5,4,"占星获得的神秘晶石，记录着文丑的命运故事，可以组成命星谱",1,11,500,},  
    [16] = {400160,"命星·陈宫",400160,5,4,"占星获得的神秘晶石，记录着陈宫的命运故事，可以组成命星谱",1,11,500,},  
    [17] = {500010,"命星·甄姬",500010,6,1,"占星获得的神秘晶石，记录着甄姬的命运故事，可以组成命星谱",1,11,7500,},  
    [18] = {500020,"命星·张辽",500020,6,1,"占星获得的神秘晶石，记录着张辽的命运故事，可以组成命星谱",1,11,7500,},  
    [19] = {500030,"命星·许褚",500030,6,1,"占星获得的神秘晶石，记录着许褚的命运故事，可以组成命星谱",1,11,7500,},  
    [20] = {500040,"命星·夏侯惇",500040,6,1,"占星获得的神秘晶石，记录着夏侯惇的命运故事，可以组成命星谱",1,11,7500,},  
    [21] = {500050,"命星·夏侯渊",500050,6,1,"占星获得的神秘晶石，记录着夏侯渊的命运故事，可以组成命星谱",1,11,7500,},  
    [22] = {500060,"命星·张郃",500060,6,1,"占星获得的神秘晶石，记录着张郃的命运故事，可以组成命星谱",1,11,7500,},  
    [23] = {500070,"命星·庞统",500070,6,2,"占星获得的神秘晶石，记录着庞统的命运故事，可以组成命星谱",1,11,7500,},  
    [24] = {500080,"命星·张飞",500080,6,2,"占星获得的神秘晶石，记录着张飞的命运故事，可以组成命星谱",1,11,7500,},  
    [25] = {500090,"命星·黄忠",500090,6,2,"占星获得的神秘晶石，记录着黄忠的命运故事，可以组成命星谱",1,11,7500,},  
    [26] = {500100,"命星·魏延",500100,6,2,"占星获得的神秘晶石，记录着魏延的命运故事，可以组成命星谱",1,11,7500,},  
    [27] = {510040,"命星·赵云",510040,6,2,"占星获得的神秘晶石，记录着赵云的命运故事，可以组成命星谱",1,11,7500,},  
    [28] = {500120,"命星·姜维",500120,6,2,"占星获得的神秘晶石，记录着姜维的命运故事，可以组成命星谱",1,11,7500,},  
    [29] = {500130,"命星·大乔",500130,6,3,"占星获得的神秘晶石，记录着大乔的命运故事，可以组成命星谱",1,11,7500,},  
    [30] = {500140,"命星·孙权",500140,6,3,"占星获得的神秘晶石，记录着孙权的命运故事，可以组成命星谱",1,11,7500,},  
    [31] = {500150,"命星·孙坚",500150,6,3,"占星获得的神秘晶石，记录着孙坚的命运故事，可以组成命星谱",1,11,7500,},  
    [32] = {500160,"命星·吕蒙",500160,6,3,"占星获得的神秘晶石，记录着吕蒙的命运故事，可以组成命星谱",1,11,7500,},  
    [33] = {500170,"命星·太史慈",500170,6,3,"占星获得的神秘晶石，记录着太史慈的命运故事，可以组成命星谱",1,11,7500,},  
    [34] = {500180,"命星·鲁肃",500180,6,3,"占星获得的神秘晶石，记录着鲁肃的命运故事，可以组成命星谱",1,11,7500,},  
    [35] = {500190,"命星·华佗",500190,6,4,"占星获得的神秘晶石，记录着华佗的命运故事，可以组成命星谱",1,11,7500,},  
    [36] = {500200,"命星·袁绍",500200,6,4,"占星获得的神秘晶石，记录着袁绍的命运故事，可以组成命星谱",1,11,7500,},  
    [37] = {500210,"命星·于吉",500210,6,4,"占星获得的神秘晶石，记录着于吉的命运故事，可以组成命星谱",1,11,7500,},  
    [38] = {500220,"命星·华雄",500220,6,4,"占星获得的神秘晶石，记录着华雄的命运故事，可以组成命星谱",1,11,7500,},  
    [39] = {500230,"命星·董卓",500230,6,4,"占星获得的神秘晶石，记录着董卓的命运故事，可以组成命星谱",1,11,7500,},  
    [40] = {500240,"命星·公孙瓒",500240,6,4,"占星获得的神秘晶石，记录着公孙瓒的命运故事，可以组成命星谱",1,11,7500,},  
    [41] = {510010,"命星·郭嘉",510010,7,1,"占星获得的神秘晶石，记录着郭嘉的命运故事，可以组成命星谱",1,11,25000,},  
    [42] = {510020,"命星·典韦",510020,7,1,"占星获得的神秘晶石，记录着典韦的命运故事，可以组成命星谱",1,11,25000,},  
    [43] = {510030,"命星·刘备",510030,7,2,"占星获得的神秘晶石，记录着刘备的命运故事，可以组成命星谱",1,11,25000,},  
    [44] = {500110,"命星·马超",500110,7,2,"占星获得的神秘晶石，记录着马超的命运故事，可以组成命星谱",1,11,25000,},  
    [45] = {510050,"命星·陆逊",510050,7,3,"占星获得的神秘晶石，记录着陆逊的命运故事，可以组成命星谱",1,11,25000,},  
    [46] = {510060,"命星·小乔",510060,7,3,"占星获得的神秘晶石，记录着小乔的命运故事，可以组成命星谱",1,11,25000,},  
    [47] = {510070,"命星·贾诩",510070,7,4,"占星获得的神秘晶石，记录着贾诩的命运故事，可以组成命星谱",1,11,25000,},  
    [48] = {510080,"命星·貂蝉",510080,7,4,"占星获得的神秘晶石，记录着貂蝉的命运故事，可以组成命星谱",1,11,25000,},  
    [49] = {600020,"命星·司马懿",600020,7,1,"占星获得的神秘晶石，记录着司马懿的命运故事，可以组成命星谱",1,11,25000,},  
    [50] = {600030,"命星·诸葛亮",600030,7,2,"占星获得的神秘晶石，记录着诸葛亮的命运故事，可以组成命星谱",1,11,25000,},  
    [51] = {600050,"命星·孙策",600050,7,3,"占星获得的神秘晶石，记录着孙策的命运故事，可以组成命星谱",1,11,25000,},  
    [52] = {600080,"命星·张角",600080,7,4,"占星获得的神秘晶石，记录着张角的命运故事，可以组成命星谱",1,11,25000,},  
    [53] = {600090,"命星·黄月英",600090,7,2,"占星获得的神秘晶石，记录着黄月英的命运故事，可以组成命星谱",1,11,25000,},  
    [54] = {600100,"命星·甘宁",600100,7,3,"占星获得的神秘晶石，记录着甘宁的命运故事，可以组成命星谱",1,11,25000,},  
    [55] = {600110,"命星·荀彧",600110,7,1,"占星获得的神秘晶石，记录着荀彧的命运故事，可以组成命星谱",1,11,25000,},  
    [56] = {600120,"命星·左慈",600120,7,4,"占星获得的神秘晶石，记录着左慈的命运故事，可以组成命星谱",1,11,25000,},  
    [57] = {600010,"命星·曹操",600010,7,1,"占星获得的神秘晶石，记录着曹操的命运故事，可以组成命星谱",1,11,25000,},  
    [58] = {600040,"命星·关羽",600040,7,2,"占星获得的神秘晶石，记录着关羽的命运故事，可以组成命星谱",1,11,25000,},  
    [59] = {600060,"命星·周瑜",600060,7,3,"占星获得的神秘晶石，记录着周瑜的命运故事，可以组成命星谱",1,11,25000,},  
    [60] = {600070,"命星·吕布",600070,7,4,"占星获得的神秘晶石，记录着吕布的命运故事，可以组成命星谱",1,11,25000,},
    }
}

local __index_id = {   
    [400010] = 4,  
    [400020] = 5,  
    [400030] = 6,  
    [400040] = 7,  
    [400050] = 8,  
    [400060] = 1,  
    [400070] = 2,  
    [400080] = 9,  
    [400090] = 10,  
    [400100] = 11,  
    [400110] = 12,  
    [400120] = 13,  
    [400130] = 3,  
    [400140] = 14,  
    [400150] = 15,  
    [400160] = 16,  
    [500010] = 17,  
    [500020] = 18,  
    [500030] = 19,  
    [500040] = 20,  
    [500050] = 21,  
    [500060] = 22,  
    [500070] = 23,  
    [500080] = 24,  
    [500090] = 25,  
    [500100] = 26,  
    [500110] = 44,  
    [500120] = 28,  
    [500130] = 29,  
    [500140] = 30,  
    [500150] = 31,  
    [500160] = 32,  
    [500170] = 33,  
    [500180] = 34,  
    [500190] = 35,  
    [500200] = 36,  
    [500210] = 37,  
    [500220] = 38,  
    [500230] = 39,  
    [500240] = 40,  
    [510010] = 41,  
    [510020] = 42,  
    [510030] = 43,  
    [510040] = 27,  
    [510050] = 45,  
    [510060] = 46,  
    [510070] = 47,  
    [510080] = 48,  
    [600010] = 57,  
    [600020] = 49,  
    [600030] = 50,  
    [600040] = 58,  
    [600050] = 51,  
    [600060] = 59,  
    [600070] = 60,  
    [600080] = 52,  
    [600090] = 53,  
    [600100] = 54,  
    [600110] = 55,  
    [600120] = 56,
}

local __key_map = { 
    id = 1,
    name = 2,
    icon = 3,
    quality = 4,
    group = 5,
    description = 6,
    sale_type = 7,
    sale_value = 8,
    sale_size = 9,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_ksoul_info")

        return t._raw[__key_map[k]]
    end
}


function ksoul_info.getLength()
    return #ksoul_info._data
end



function ksoul_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_ksoul_info
function ksoul_info.indexOf(index)
    if index == nil or not ksoul_info._data[index] then
        return nil
    end
    return setmetatable({_raw = ksoul_info._data[index]}, m)
end



---
--@return @class record_ksoul_info
function ksoul_info.get(id)
    
    return ksoul_info.indexOf(__index_id[ id ])
     
end



function ksoul_info.set(id, key, value)
    local record = ksoul_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function ksoul_info.get_index_data()
    return __index_id 
end

return  ksoul_info 