---@classdef record_order_world_barrage_info
local record_order_world_barrage_info = {}


record_order_world_barrage_info.id = 0--id
record_order_world_barrage_info.condition_type = 0--条件类型
record_order_world_barrage_info.condition_value = 0--参数值
record_order_world_barrage_info.barrage_type = 0--弹幕类型
record_order_world_barrage_info.barrage_resource = 0--弹幕的显示类型
record_order_world_barrage_info.stop_time = 0--弹幕停留时间
record_order_world_barrage_info.barrage_speed = 0--弹幕速度
record_order_world_barrage_info.barrage_value =  ""--弹幕内容

local order_world_barrage_info = {
   _data = {   
    [1] = {1,1,20,1,1,0,30,"招兵买马，为军团增加#num#兵力，功勋卓著！",},  
    [2] = {2,1,50,1,1,0,30,"征募雄兵猛将，为军团增加#num#兵力，名动四海，声震八方！",},  
    [3] = {3,2,100,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [4] = {4,2,200,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [5] = {5,2,300,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [6] = {6,2,400,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [7] = {7,2,500,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [8] = {8,2,600,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [9] = {9,2,700,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [10] = {10,2,800,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [11] = {11,2,900,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [12] = {12,2,1000,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [13] = {13,2,1100,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [14] = {14,2,1200,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [15] = {15,2,1300,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [16] = {16,2,1400,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [17] = {17,2,1500,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [18] = {18,2,1600,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [19] = {19,2,1700,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [20] = {20,2,1800,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [21] = {21,2,1900,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [22] = {22,2,2000,1,1,0,30,"功绩斐然，累计为军团增加#num#兵力，荣誉等身！",},  
    [23] = {23,2,2100,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [24] = {24,2,2200,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [25] = {25,2,2300,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [26] = {26,2,2400,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [27] = {27,2,2500,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [28] = {28,2,2600,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [29] = {29,2,2700,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [30] = {30,2,2800,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [31] = {31,2,2900,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [32] = {32,2,3000,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [33] = {33,2,3100,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [34] = {34,2,3200,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [35] = {35,2,3300,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [36] = {36,2,3400,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [37] = {37,2,3500,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [38] = {38,2,3600,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [39] = {39,2,3700,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [40] = {40,2,3800,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [41] = {41,2,3900,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [42] = {42,2,4000,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [43] = {43,2,4100,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [44] = {44,2,4200,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [45] = {45,2,4300,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [46] = {46,2,4400,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [47] = {47,2,4500,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [48] = {48,2,4600,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [49] = {49,2,4700,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [50] = {50,2,4800,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [51] = {51,2,4900,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [52] = {52,2,5000,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [53] = {53,2,5100,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [54] = {54,2,5200,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},  
    [55] = {55,2,5300,1,1,0,30,"立不世之功，累计为军团增加#num#兵力，号令天下，莫敢不从！",},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,
}

local __key_map = { 
    id = 1,
    condition_type = 2,
    condition_value = 3,
    barrage_type = 4,
    barrage_resource = 5,
    stop_time = 6,
    barrage_speed = 7,
    barrage_value = 8,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_order_world_barrage_info")

        return t._raw[__key_map[k]]
    end
}


function order_world_barrage_info.getLength()
    return #order_world_barrage_info._data
end



function order_world_barrage_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_order_world_barrage_info
function order_world_barrage_info.indexOf(index)
    if index == nil or not order_world_barrage_info._data[index] then
        return nil
    end
    return setmetatable({_raw = order_world_barrage_info._data[index]}, m)
end



---
--@return @class record_order_world_barrage_info
function order_world_barrage_info.get(id)
    
    return order_world_barrage_info.indexOf(__index_id[ id ])
     
end



function order_world_barrage_info.set(id, key, value)
    local record = order_world_barrage_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function order_world_barrage_info.get_index_data()
    return __index_id 
end

return  order_world_barrage_info 