---@classdef record_order_world_task_info
local record_order_world_task_info = {}


record_order_world_task_info.id = 0--id
record_order_world_task_info.sub_id = 0--活动id
record_order_world_task_info.task_type = 0--任务类型
record_order_world_task_info.task_name =  ""--任务名称
record_order_world_task_info.task_describe =  ""--任务描述
record_order_world_task_info.source_id = 0--跳转界面
record_order_world_task_info.goal = 0--目标值
record_order_world_task_info.refresh = 0--任务刷新
record_order_world_task_info.order = 0--排序
record_order_world_task_info.reward_type_1 = 0--奖励类型1
record_order_world_task_info.reward_value_1 = 0--奖励类型值1
record_order_world_task_info.reward_size_1 = 0--奖励数量1
record_order_world_task_info.reward_type_2 = 0--奖励类型2
record_order_world_task_info.reward_value_2 = 0--奖励类型值2
record_order_world_task_info.reward_size_2 = 0--奖励数量2
record_order_world_task_info.reward_type_3 = 0--奖励类型3
record_order_world_task_info.reward_value_3 = 0--奖励类型值3
record_order_world_task_info.reward_size_3 = 0--奖励数量3
record_order_world_task_info.reward_type_4 = 0--奖励类型4
record_order_world_task_info.reward_value_4 = 0--奖励类型值4
record_order_world_task_info.reward_size_4 = 0--奖励数量4

local order_world_task_info = {
   _data = {   
    [1] = {10001,1,1094,"登录游戏","活动期间每天登录游戏可获得",1,1,1,1,999,0,588,3,98,5,3,97,20,0,0,0,},  
    [2] = {10001,2,1022,"主线有礼","挑战主线副本#num#次",115,20,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [3] = {10001,3,1022,"主线有礼","挑战主线副本#num#次",115,50,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [4] = {10001,4,1022,"主线有礼","挑战主线副本#num#次",115,80,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [5] = {10001,5,1022,"主线有礼","挑战主线副本#num#次",115,110,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [6] = {10001,6,1022,"主线有礼","挑战主线副本#num#次",115,150,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [7] = {10001,7,1022,"主线有礼","挑战主线副本#num#次",115,200,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [8] = {10001,8,1022,"主线有礼","挑战主线副本#num#次",115,250,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [9] = {10001,9,1022,"主线有礼","挑战主线副本#num#次",115,300,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [10] = {10001,10,1022,"主线有礼","挑战主线副本#num#次",115,350,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [11] = {10001,11,1022,"主线有礼","挑战主线副本#num#次",115,400,2,2,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [12] = {10001,12,1023,"传记挑战","列传传记挑战#num#次",11,5,2,3,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [13] = {10001,13,1023,"传记挑战","列传传记挑战#num#次",11,10,2,3,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [14] = {10001,14,1023,"传记挑战","列传传记挑战#num#次",11,15,2,3,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [15] = {10001,15,1023,"传记挑战","列传传记挑战#num#次",11,20,2,3,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [16] = {10001,16,1023,"传记挑战","列传传记挑战#num#次",11,25,2,3,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [17] = {10001,17,1023,"传记挑战","列传传记挑战#num#次",11,30,2,3,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [18] = {10001,18,1024,"战役挑战","名将副本组队战役挑战#num#次",11,3,2,4,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [19] = {10001,19,1024,"战役挑战","名将副本组队战役挑战#num#次",11,6,2,4,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [20] = {10001,20,1024,"战役挑战","名将副本组队战役挑战#num#次",11,9,2,4,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [21] = {10001,21,1099,"攻城掠地","攻城略地主动挑战#num#次",177,10,2,5,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [22] = {10001,22,1099,"攻城掠地","攻城略地主动挑战#num#次",177,20,2,5,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [23] = {10001,23,1099,"攻城掠地","攻城略地主动挑战#num#次",177,30,2,5,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [24] = {10001,24,1099,"攻城掠地","攻城略地主动挑战#num#次",177,40,2,5,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [25] = {10001,25,1099,"攻城掠地","攻城略地主动挑战#num#次",177,50,2,5,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [26] = {10001,26,1099,"攻城掠地","攻城略地主动挑战#num#次",177,60,2,5,3,98,2,0,0,0,0,0,0,0,0,0,},  
    [27] = {10001,27,1001,"竞技挑战","竞技场挑战#num#次",10,15,2,6,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [28] = {10001,28,1001,"竞技挑战","竞技场挑战#num#次",10,30,2,6,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [29] = {10001,29,1001,"竞技挑战","竞技场挑战#num#次",10,45,2,6,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [30] = {10001,30,1001,"竞技挑战","竞技场挑战#num#次",10,60,2,6,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [31] = {10001,31,1001,"竞技挑战","竞技场挑战#num#次",10,75,2,6,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [32] = {10001,32,1001,"竞技挑战","竞技场挑战#num#次",10,90,2,6,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [33] = {10001,33,1027,"无双挑战","无双试炼挑战#num#次",17,15,2,7,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [34] = {10001,34,1027,"无双挑战","无双试炼挑战#num#次",17,30,2,7,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [35] = {10001,35,1027,"无双挑战","无双试炼挑战#num#次",17,60,2,7,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [36] = {10001,36,1027,"无双挑战","无双试炼挑战#num#次",17,100,2,7,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [37] = {10001,37,1027,"无双挑战","无双试炼挑战#num#次",17,150,2,7,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [38] = {10001,38,1027,"无双挑战","无双试炼挑战#num#次",17,200,2,7,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [39] = {10001,39,1075,"讨伐巨兽","讨伐巨兽消耗#num#次",20,5,2,8,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [40] = {10001,40,1075,"讨伐巨兽","讨伐巨兽消耗#num#次",20,10,2,8,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [41] = {10001,41,1075,"讨伐巨兽","讨伐巨兽消耗#num#次",20,20,2,8,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [42] = {10001,42,1075,"讨伐巨兽","讨伐巨兽消耗#num#次",20,30,2,8,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [43] = {10001,43,1075,"讨伐巨兽","讨伐巨兽消耗#num#次",20,40,2,8,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [44] = {10001,44,1075,"讨伐巨兽","讨伐巨兽消耗#num#次",20,50,2,8,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [45] = {10001,45,1005,"寻宝有礼","秘境寻宝挑战#num#次",19,15,2,9,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [46] = {10001,46,1005,"寻宝有礼","秘境寻宝挑战#num#次",19,30,2,9,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [47] = {10001,47,1005,"寻宝有礼","秘境寻宝挑战#num#次",19,50,2,9,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [48] = {10001,48,1005,"寻宝有礼","秘境寻宝挑战#num#次",19,70,2,9,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [49] = {10001,49,1005,"寻宝有礼","秘境寻宝挑战#num#次",19,90,2,9,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [50] = {10001,50,1005,"寻宝有礼","秘境寻宝挑战#num#次",19,120,2,9,3,97,10,0,0,0,0,0,0,0,0,0,},  
    [51] = {10001,51,1093,"过关斩将","过关斩将任意战斗#num#次",160,6,2,10,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [52] = {10001,52,1093,"过关斩将","过关斩将任意战斗#num#次",160,12,2,10,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [53] = {10001,53,1093,"过关斩将","过关斩将任意战斗#num#次",160,18,2,10,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [54] = {10001,54,1093,"过关斩将","过关斩将任意战斗#num#次",160,24,2,10,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [55] = {10001,55,1093,"过关斩将","过关斩将任意战斗#num#次",160,30,2,10,3,98,1,0,0,0,0,0,0,0,0,0,},  
    [56] = {10001,56,1093,"过关斩将","过关斩将任意战斗#num#次",160,36,2,10,3,98,1,0,0,0,0,0,0,0,0,0,},
    }
}

local __index_id_sub_id = {   
    ["10001_1"] = 1,  
    ["10001_2"] = 2,  
    ["10001_3"] = 3,  
    ["10001_4"] = 4,  
    ["10001_5"] = 5,  
    ["10001_6"] = 6,  
    ["10001_7"] = 7,  
    ["10001_8"] = 8,  
    ["10001_9"] = 9,  
    ["10001_10"] = 10,  
    ["10001_11"] = 11,  
    ["10001_12"] = 12,  
    ["10001_13"] = 13,  
    ["10001_14"] = 14,  
    ["10001_15"] = 15,  
    ["10001_16"] = 16,  
    ["10001_17"] = 17,  
    ["10001_18"] = 18,  
    ["10001_19"] = 19,  
    ["10001_20"] = 20,  
    ["10001_21"] = 21,  
    ["10001_22"] = 22,  
    ["10001_23"] = 23,  
    ["10001_24"] = 24,  
    ["10001_25"] = 25,  
    ["10001_26"] = 26,  
    ["10001_27"] = 27,  
    ["10001_28"] = 28,  
    ["10001_29"] = 29,  
    ["10001_30"] = 30,  
    ["10001_31"] = 31,  
    ["10001_32"] = 32,  
    ["10001_33"] = 33,  
    ["10001_34"] = 34,  
    ["10001_35"] = 35,  
    ["10001_36"] = 36,  
    ["10001_37"] = 37,  
    ["10001_38"] = 38,  
    ["10001_39"] = 39,  
    ["10001_40"] = 40,  
    ["10001_41"] = 41,  
    ["10001_42"] = 42,  
    ["10001_43"] = 43,  
    ["10001_44"] = 44,  
    ["10001_45"] = 45,  
    ["10001_46"] = 46,  
    ["10001_47"] = 47,  
    ["10001_48"] = 48,  
    ["10001_49"] = 49,  
    ["10001_50"] = 50,  
    ["10001_51"] = 51,  
    ["10001_52"] = 52,  
    ["10001_53"] = 53,  
    ["10001_54"] = 54,  
    ["10001_55"] = 55,  
    ["10001_56"] = 56,
}

local __key_map = { 
    id = 1,
    sub_id = 2,
    task_type = 3,
    task_name = 4,
    task_describe = 5,
    source_id = 6,
    goal = 7,
    refresh = 8,
    order = 9,
    reward_type_1 = 10,
    reward_value_1 = 11,
    reward_size_1 = 12,
    reward_type_2 = 13,
    reward_value_2 = 14,
    reward_size_2 = 15,
    reward_type_3 = 16,
    reward_value_3 = 17,
    reward_size_3 = 18,
    reward_type_4 = 19,
    reward_value_4 = 20,
    reward_size_4 = 21,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_order_world_task_info")

        return t._raw[__key_map[k]]
    end
}


function order_world_task_info.getLength()
    return #order_world_task_info._data
end



function order_world_task_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_order_world_task_info
function order_world_task_info.indexOf(index)
    if index == nil or not order_world_task_info._data[index] then
        return nil
    end
    return setmetatable({_raw = order_world_task_info._data[index]}, m)
end



---
--@return @class record_order_world_task_info
function order_world_task_info.get(id,sub_id)
    
    local k = id .. '_' .. sub_id
    return order_world_task_info.indexOf(__index_id_sub_id[k])
     
end



function order_world_task_info.set(id,sub_id, key, value)
    local record = order_world_task_info.get(id,sub_id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function order_world_task_info.get_index_data()
    return __index_id_sub_id 
end

return  order_world_task_info 