---@classdef record_pet_info
local record_pet_info = {}


record_pet_info.id = 0--ID
record_pet_info.advance_id = 0--升阶码
record_pet_info.name =  ""--名称
record_pet_info.quality = 0--品质
record_pet_info.rare = 0--稀有
record_pet_info.resource =  ""--资源
record_pet_info.level_group = 0--升级组
record_pet_info.fragment_id = 0--碎片id
record_pet_info.star = 0--星级
record_pet_info.next_star = 0--下一星级
record_pet_info.pet_num = 0--下一星级所需神兽个数
record_pet_info.describe =  ""--描述
record_pet_info.passive_skill_1 = 0--技能1
record_pet_info.passive_skill_2 = 0--技能2
record_pet_info.belong_passive_skill_1 = 0--技能1附属技能
record_pet_info.belong_passive_skill_2 = 0--技能2附属技能
record_pet_info.skill_factor = 0--初始技能战斗力系数
record_pet_info.affect_type_1 = 0--属性1
record_pet_info.affect_value_1 = 0--属性1数值
record_pet_info.develop_1 = 0--属性1成长
record_pet_info.affect_type_2 = 0--属性2
record_pet_info.affect_value_2 = 0--属性2数值
record_pet_info.develop_2 = 0--属性2成长
record_pet_info.affect_type_3 = 0--属性3
record_pet_info.affect_value_3 = 0--属性3数值
record_pet_info.develop_3 = 0--属性3成长
record_pet_info.affect_type_4 = 0--属性4
record_pet_info.affect_value_4 = 0--属性4数值
record_pet_info.develop_4 = 0--属性4成长
record_pet_info.affect_type_5 = 0--属性5
record_pet_info.affect_value_5 = 0--属性5数值
record_pet_info.develop_5 = 0--属性5成长
record_pet_info.affect_type_6 = 0--属性6
record_pet_info.affect_value_6 = 0--属性6数值
record_pet_info.develop_6 = 0--属性6成长
record_pet_info.put = 0--是否投放
record_pet_info.gm = 0--gm后台是否可发放

local pet_info = {
   _data = {   
    [1] = {1010,101,"巨猿",4,0,"101",4,15101,0,1,1,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1001,0,0,0,0,1,135000,4500,2,2200,70,3,1800,60,4,1800,60,11,50,0,0,0,0,1,1,},  
    [2] = {1011,101,"巨猿",4,0,"101",4,15101,1,2,1,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1002,0,0,0,0,1,275000,6750,2,4300,105,3,3600,90,4,3600,90,11,50,0,0,0,0,1,0,},  
    [3] = {1012,101,"巨猿",4,0,"101",4,15101,2,3,1,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1003,0,0,0,0,1,410000,9000,2,6500,140,3,5400,120,4,5400,120,11,50,0,0,0,0,1,0,},  
    [4] = {1013,101,"巨猿",4,0,"101",4,15101,3,4,1,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1004,0,0,0,0,1,550000,11250,2,8700,180,3,7200,150,4,7200,150,11,50,0,0,0,0,1,0,},  
    [5] = {1014,101,"巨猿",4,0,"101",4,15101,4,5,2,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1005,0,0,0,0,1,685000,13550,2,10800,215,3,9000,180,4,9000,180,11,50,0,0,0,0,1,0,},  
    [6] = {1015,101,"巨猿",4,0,"101",4,15101,5,6,2,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1006,0,0,0,0,1,960000,18050,2,15200,285,3,12700,235,4,12700,235,11,50,0,0,0,0,1,0,},  
    [7] = {1016,101,"巨猿",4,0,"101",4,15101,6,7,3,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1007,0,0,0,0,1,1235000,22550,2,19500,355,3,16300,295,4,16300,295,11,50,0,0,0,0,1,0,},  
    [8] = {1017,101,"巨猿",4,0,"101",4,15101,7,0,0,"巨猿是生活在蓬莱仙岛中雪山上的异兽，常结伴而居。因为长年吞吐天地元气，所以身形硕大，长有丈余。巨猿性情暴躁易怒，在仙岛的记载中常有巨猿伤人之事。愤怒的巨猿看到异乡人入侵自己的领地，会抄起山上散落的巨石朝他们砸去。",1008,0,0,0,0,1,1650000,29300,2,26000,465,3,21700,385,4,21700,385,11,50,0,0,0,0,1,0,},  
    [9] = {2010,201,"猞猁",5,0,"201",5,15201,0,1,1,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1011,0,0,0,0,1,220000,6500,2,4600,135,3,2900,85,4,2900,85,11,100,0,0,0,0,1,1,},  
    [10] = {2011,201,"猞猁",5,0,"201",5,15201,1,2,1,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1012,0,0,0,0,1,440000,9700,2,9200,205,3,5800,130,4,5800,130,11,100,0,0,0,0,1,0,},  
    [11] = {2012,201,"猞猁",5,0,"201",5,15201,2,3,1,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1013,0,0,0,0,1,660000,12950,2,13900,275,3,8700,170,4,8700,170,11,100,0,0,0,0,1,0,},  
    [12] = {2013,201,"猞猁",5,0,"201",5,15201,3,4,1,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1014,0,0,0,0,1,880000,16200,2,18500,340,3,11600,215,4,11600,215,11,100,0,0,0,0,1,0,},  
    [13] = {2014,201,"猞猁",5,0,"201",5,15201,4,5,2,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1015,0,0,0,0,1,1095000,19450,2,23100,410,3,14400,255,4,14400,255,11,100,0,0,0,0,1,0,},  
    [14] = {2015,201,"猞猁",5,0,"201",5,15201,5,6,2,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1016,0,0,0,0,1,1535000,25950,2,32300,545,3,20200,340,4,20200,340,11,100,0,0,0,0,1,0,},  
    [15] = {2016,201,"猞猁",5,0,"201",5,15201,6,7,3,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1017,0,0,0,0,1,1975000,32400,2,41600,680,3,26000,425,4,26000,425,11,100,0,0,0,0,1,0,},  
    [16] = {2017,201,"猞猁",5,0,"201",5,15201,7,0,0,"猞猁是蓬莱仙岛上丛林中的一种灵猫，独来独往，生性狡猾，常常猎食徘徊在丛林中的异乡人。猞猁猫首豹身，身长7尺有余。这种狡猾且凶猛的异兽可以用以尾巴的数量来判断危险程度。",1018,0,0,0,0,1,2635000,42150,2,55400,885,3,34700,555,4,34700,555,11,100,0,0,0,0,1,0,},  
    [17] = {3010,301,"机关鸟",6,0,"301",6,15301,0,1,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1021,0,0,0,0,1,700000,8650,2,14800,180,3,9200,115,4,9200,115,11,150,0,0,0,0,1,1,},  
    [18] = {3011,301,"机关鸟",6,0,"301",6,15301,1,2,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1022,0,0,0,0,1,1405000,12950,2,29600,275,3,18500,170,4,18500,170,11,150,0,0,0,0,1,0,},  
    [19] = {3012,301,"机关鸟",6,0,"301",6,15301,2,3,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1023,0,0,0,0,1,2105000,17300,2,44400,365,3,27700,225,4,27700,225,11,150,0,0,0,0,1,0,},  
    [20] = {3013,301,"机关鸟",6,0,"301",6,15301,3,4,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1024,0,0,0,0,1,2810000,21600,2,59100,455,3,37000,285,4,37000,285,11,150,0,0,0,0,1,0,},  
    [21] = {3014,301,"机关鸟",6,0,"301",6,15301,4,5,2,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1025,0,0,0,0,1,3510000,25950,2,73900,545,3,46200,340,4,46200,340,11,150,0,0,0,0,1,0,},  
    [22] = {3015,301,"机关鸟",6,0,"301",6,15301,5,6,2,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1026,0,0,0,0,1,4915000,34550,2,103500,730,3,64700,455,4,64700,455,11,150,0,0,0,0,1,0,},  
    [23] = {3016,301,"机关鸟",6,0,"301",6,15301,6,7,3,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1027,0,0,0,0,1,6320000,43200,2,133100,910,3,83200,570,4,83200,570,11,150,0,0,0,0,1,0,},  
    [24] = {3017,301,"机关鸟",6,0,"301",6,15301,7,0,0,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关鸟便是出自他们手中。机关鸟全长五尺，双翼展开足有一丈。全身由木制机关打造，精巧无比。它的翅膀由一千零八十根木制羽毛以卯榫连接而成。羽毛中空，羽尖处固定有引爆材料。机关鸟可以在飞行过程中振翅向外击出这些可以爆炸的箭羽，用以杀伤秘境中的异兽和敌人。",1028,0,0,0,0,1,8425000,56200,2,177400,1185,3,110900,740,4,110900,740,11,150,0,0,0,0,1,0,},  
    [25] = {3020,302,"机关牛",6,0,"302",6,15302,0,1,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1031,0,0,0,0,1,735000,9000,2,11600,140,3,9600,120,4,9600,120,11,150,0,0,0,0,1,1,},  
    [26] = {3021,302,"机关牛",6,0,"302",6,15302,1,2,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1032,0,0,0,0,1,1465000,13550,2,23100,215,3,19300,180,4,19300,180,11,150,0,0,0,0,1,0,},  
    [27] = {3022,302,"机关牛",6,0,"302",6,15302,2,3,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1033,0,0,0,0,1,2200000,18050,2,34700,285,3,28900,235,4,28900,235,11,150,0,0,0,0,1,0,},  
    [28] = {3023,302,"机关牛",6,0,"302",6,15302,3,4,1,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1034,0,0,0,0,1,2930000,22550,2,46300,355,3,38600,295,4,38600,295,11,150,0,0,0,0,1,0,},  
    [29] = {3024,302,"机关牛",6,0,"302",6,15302,4,5,2,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1035,0,0,0,0,1,3665000,27050,2,57900,425,3,48200,355,4,48200,355,11,150,0,0,0,0,1,0,},  
    [30] = {3025,302,"机关牛",6,0,"302",6,15302,5,6,2,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1036,0,0,0,0,1,5130000,36100,2,81000,570,3,67500,475,4,67500,475,11,150,0,0,0,0,1,0,},  
    [31] = {3026,302,"机关牛",6,0,"302",6,15302,6,7,3,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1037,0,0,0,0,1,6595000,45100,2,104100,710,3,86800,595,4,86800,595,11,150,0,0,0,0,1,0,},  
    [32] = {3027,302,"机关牛",6,0,"302",6,15302,7,0,0,"仙岛秘境中有能人异士，擅长机关巧术，拟物傀儡，机关牛是他们的杰作。机关牛重可达千斗，行走时震起的烟尘足有一人高，响声可传到数十里开外。机关牛的构造极为复杂，内部使用了木制，机械和蒸汽的结构。仙岛秘境中的机关巧匠是如何掌握这种穿越时空的技术到现在还不得而知。机关牛平时用于运输，遇到秘境中的异兽和敌人时，它可以驱动蒸汽装置，为自己提供无比强大的动力。同时蒸汽加热的尖角也可以刺穿许多防御。",1038,0,0,0,0,1,8795000,58600,2,138800,925,3,115700,770,4,115700,770,11,150,0,0,0,0,1,0,},  
    [33] = {4010,401,"神木青鸾",7,0,"401",7,15401,0,1,1,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1041,0,0,0,0,1,1755000,10800,2,37000,225,3,23100,140,4,23100,140,11,300,0,0,0,0,1,1,},  
    [34] = {4011,401,"神木青鸾",7,0,"401",7,15401,1,2,1,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1042,0,0,0,0,1,3510000,16200,2,73900,340,3,46200,215,4,46200,215,11,300,0,0,0,0,1,0,},  
    [35] = {4012,401,"神木青鸾",7,0,"401",7,15401,2,3,1,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1043,0,0,0,0,1,5265000,21600,2,110900,455,3,69300,285,4,69300,285,11,300,0,0,0,0,1,0,},  
    [36] = {4013,401,"神木青鸾",7,0,"401",7,15401,3,4,1,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1044,0,0,0,0,1,7025000,27000,2,147800,570,3,92400,355,4,92400,355,11,300,0,0,0,0,1,0,},  
    [37] = {4014,401,"神木青鸾",7,0,"401",7,15401,4,5,2,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1045,0,0,0,0,1,8780000,32400,2,184800,680,3,115500,425,4,115500,425,11,300,0,0,0,0,1,0,},  
    [38] = {4015,401,"神木青鸾",7,0,"401",7,15401,5,6,2,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1046,0,0,0,0,1,12290000,43200,2,258700,910,3,161700,570,4,161700,570,11,300,0,0,0,0,1,0,},  
    [39] = {4016,401,"神木青鸾",7,0,"401",7,15401,6,7,3,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1047,0,0,0,0,1,15800000,54000,2,332700,1135,3,207900,710,4,207900,710,11,300,0,0,0,0,1,0,},  
    [40] = {4017,401,"神木青鸾",7,0,"401",7,15401,7,0,0,"传说中蓬莱仙岛最深处有一参天神木，树荫可以盖住苍穹，使日月无色。而神木下的光辉都出自于栖息于神木之上的神兽——神木青鸾。在仙岛的古老传说中，青鸾的羽翼可以洒下世间至纯的光辉，照耀万物。青鸾振翅时，花开人间，万木逢春。青鸾是生机的象征，很多仙岛上的住民以青鸾为图腾，向这只神兽祈福，祈祷他们的部族的命运可以绵长，像草木一般，春风吹又生。",1048,0,0,0,0,1,21070000,70250,2,443500,1480,3,277200,925,4,277200,925,11,300,0,0,0,0,1,0,},  
    [41] = {4020,402,"撼地灵犀",7,0,"402",7,15402,0,1,1,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1051,0,0,0,0,1,1830000,11250,2,28900,180,3,24100,150,4,24100,150,11,300,0,0,0,0,1,1,},  
    [42] = {4021,402,"撼地灵犀",7,0,"402",7,15402,1,2,1,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1052,0,0,0,0,1,3665000,16900,2,57900,265,3,48200,225,4,48200,225,11,300,0,0,0,0,1,0,},  
    [43] = {4022,402,"撼地灵犀",7,0,"402",7,15402,2,3,1,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1053,0,0,0,0,1,5495000,22550,2,86800,355,3,72300,295,4,72300,295,11,300,0,0,0,0,1,0,},  
    [44] = {4023,402,"撼地灵犀",7,0,"402",7,15402,3,4,1,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1054,0,0,0,0,1,7330000,28200,2,115700,445,3,96400,370,4,96400,370,11,300,0,0,0,0,1,0,},  
    [45] = {4024,402,"撼地灵犀",7,0,"402",7,15402,4,5,2,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1055,0,0,0,0,1,9160000,33800,2,144600,535,3,120500,445,4,120500,445,11,300,0,0,0,0,1,0,},  
    [46] = {4025,402,"撼地灵犀",7,0,"402",7,15402,5,6,2,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1056,0,0,0,0,1,12825000,45100,2,202500,710,3,168700,595,4,168700,595,11,300,0,0,0,0,1,0,},  
    [47] = {4026,402,"撼地灵犀",7,0,"402",7,15402,6,7,3,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1057,0,0,0,0,1,16490000,56350,2,260300,890,3,216900,740,4,216900,740,11,300,0,0,0,0,1,0,},  
    [48] = {4027,402,"撼地灵犀",7,0,"402",7,15402,7,0,0,"撼地灵犀又称“重土兕”，是在蓬莱仙境中罕见的神兽。撼地灵犀的来源记载在当地人编纂的《蓬莱异兽考》中，传说是犀牛吞吐天地灵气进化而成，灵兽感大地之力，背负千钧之山，成为了蓬莱的土地守护神兽。传闻中撼地灵犀出没时，摇山震岳，海浪涌起，林间飞狐走兽四散而去。撼地灵犀头顶的犀角负大地气运，有搬山填海之能。这种神兽只出现在典籍记载和传说中，在秘境中似乎连仙人也未有缘得见。",1058,0,0,0,0,1,21985000,73300,2,347100,1155,3,289300,965,4,289300,965,11,300,0,0,0,0,1,0,},  
    [49] = {4030,403,"狱火穷奇",7,0,"403",7,15403,0,1,1,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1061,0,0,0,0,1,1755000,10800,2,37000,225,3,23100,140,4,23100,140,11,300,0,0,0,0,1,1,},  
    [50] = {4031,403,"狱火穷奇",7,0,"403",7,15403,1,2,1,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1062,0,0,0,0,1,3510000,16200,2,73900,340,3,46200,215,4,46200,215,11,300,0,0,0,0,1,0,},  
    [51] = {4032,403,"狱火穷奇",7,0,"403",7,15403,2,3,1,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1063,0,0,0,0,1,5265000,21600,2,110900,455,3,69300,285,4,69300,285,11,300,0,0,0,0,1,0,},  
    [52] = {4033,403,"狱火穷奇",7,0,"403",7,15403,3,4,1,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1064,0,0,0,0,1,7025000,27000,2,147800,570,3,92400,355,4,92400,355,11,300,0,0,0,0,1,0,},  
    [53] = {4034,403,"狱火穷奇",7,0,"403",7,15403,4,5,2,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1065,0,0,0,0,1,8780000,32400,2,184800,680,3,115500,425,4,115500,425,11,300,0,0,0,0,1,0,},  
    [54] = {4035,403,"狱火穷奇",7,0,"403",7,15403,5,6,2,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1066,0,0,0,0,1,12290000,43200,2,258700,910,3,161700,570,4,161700,570,11,300,0,0,0,0,1,0,},  
    [55] = {4036,403,"狱火穷奇",7,0,"403",7,15403,6,7,3,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1067,0,0,0,0,1,15800000,54000,2,332700,1135,3,207900,710,4,207900,710,11,300,0,0,0,0,1,0,},  
    [56] = {4037,403,"狱火穷奇",7,0,"403",7,15403,7,0,0,"穷奇是来自地狱中的恶兽，据蓬莱仙境中的原始住民的传言，穷奇虎面狮身，背负双翼，身上燃烧着红黑相间的火焰，喜欢吞噬世间出现的罪恶。穷奇的每次出现都必然带来蔓延数十日的大火。穷奇带来的狱火不同于世间的一般火焰，用人力无法使其熄灭。熊熊狱火要烧尽穷奇现身时看到的一切方才罢休。每当穷奇现身，蓬莱仙境中的住民要焚香祈祷，用圣水洗濯自身的罪恶，祈祷穷奇尽快离去。",1068,0,0,0,0,1,21070000,70250,2,443500,1480,3,277200,925,4,277200,925,11,300,0,0,0,0,1,0,},  
    [57] = {4040,404,"九天应龙",7,1,"404",7,15404,0,1,1,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1071,0,0,0,0,1,2200000,18000,2,34700,290,3,29000,240,4,29000,240,11,300,0,0,0,0,1,1,},  
    [58] = {4041,404,"九天应龙",7,1,"404",7,15404,1,2,1,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1072,0,0,0,0,1,4400000,27050,2,69500,425,3,57900,360,4,57900,360,11,300,0,0,0,0,1,0,},  
    [59] = {4042,404,"九天应龙",7,1,"404",7,15404,2,3,1,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1073,0,0,0,0,1,6595000,36100,2,104200,570,3,86800,475,4,86800,475,11,300,0,0,0,0,1,0,},  
    [60] = {4043,404,"九天应龙",7,1,"404",7,15404,3,4,1,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1074,0,0,0,0,1,8800000,45150,2,138900,715,3,115700,595,4,115700,595,11,300,0,0,0,0,1,0,},  
    [61] = {4044,404,"九天应龙",7,1,"404",7,15404,4,5,2,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1075,0,0,0,0,1,10995000,54100,2,173600,860,3,144600,715,4,144600,715,11,300,0,0,0,0,1,0,},  
    [62] = {4045,404,"九天应龙",7,1,"404",7,15404,5,6,2,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1076,0,0,0,0,1,15390000,72200,2,243000,1140,3,202500,955,4,202500,955,11,300,0,0,0,0,1,0,},  
    [63] = {4046,404,"九天应龙",7,1,"404",7,15404,6,7,3,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1077,0,0,0,0,1,19790000,90200,2,312400,1425,3,260300,1185,4,260300,1185,11,300,0,0,0,0,1,0,},  
    [64] = {4047,404,"九天应龙",7,1,"404",7,15404,7,0,0,"苍穹之上有九天，相传九天之主是名叫应龙的神兽。应龙有数百丈之长，盘旋在蓬莱的最高山处，昏睡五十年，清醒五十年。清醒时，背后的双翼展开，会有垂天之云从九天落下，应龙飞过，会有玄风骤起，席卷天地。应龙由天地玄风中应运而生，据说是掌管命运的神兽。神龙见首不见尾，蓬莱仙岛上已有数百年未见到过应龙的踪迹，偶尔有狂风大作，岛民们都会去俯拜九天上的神兽，祈祷它护佑自己的命运。",1078,0,0,0,0,1,26385000,117300,2,416600,1850,3,347200,1545,4,347200,1545,11,300,0,0,0,0,1,0,},  
    [65] = {4050,405,"苍鸣雷君",8,0,"405",8,15405,0,1,1,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1081,1201,0,1218,200,1,2745000,18000,2,43350,288,3,36150,240,4,36150,240,11,350,0,0,0,0,1,1,},  
    [66] = {4051,405,"苍鸣雷君",8,0,"405",8,15405,1,2,1,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1082,1202,0,1219,400,1,5497500,27040,2,86850,424,3,72300,360,4,72300,360,11,350,0,0,0,0,1,0,},  
    [67] = {4052,405,"苍鸣雷君",8,0,"405",8,15405,2,3,1,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1083,1203,0,1220,600,1,8242500,36080,2,130200,568,3,108450,472,4,108450,472,11,350,0,0,0,0,1,0,},  
    [68] = {4053,405,"苍鸣雷君",8,0,"405",8,15405,3,4,1,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1084,1204,0,1221,750,1,10995000,45120,2,173550,712,3,144600,592,4,144600,592,11,350,0,0,0,0,1,0,},  
    [69] = {4054,405,"苍鸣雷君",8,0,"405",8,15405,4,5,2,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1085,1205,0,1222,900,1,13740000,54080,2,216900,856,3,180750,712,4,180750,712,11,350,0,0,0,0,1,0,},  
    [70] = {4055,405,"苍鸣雷君",8,0,"405",8,15405,5,6,2,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1086,1206,0,1223,1200,1,19237500,72160,2,303750,1136,3,253050,952,4,253050,952,11,350,0,0,0,0,1,0,},  
    [71] = {4056,405,"苍鸣雷君",8,0,"405",8,15405,6,7,3,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1087,1207,0,1224,1400,1,24735000,90160,2,390450,1424,3,325350,1184,4,325350,1184,11,350,0,0,0,0,1,0,},  
    [72] = {4057,405,"苍鸣雷君",8,0,"405",8,15405,7,0,0,"极东之地有一处山谷，四周的山峰高耸入云、陡峭难攀，寻常人绝难进入。千万年间，得以窥见谷中情形的人寥寥无几。谷中终年阴云缭绕，雷鸣之声贯破长空，处处可见紫电之光。世人传言，其中居住着掌管风雷闪电的神兽，名为苍鸣雷君。自天地混沌之中而生，苍鸣雷君浑身充斥着惊心骇神的电光，头上的角闪耀着堪比日月的光辉，令人不敢直视。背后生双翼，挥舞之时常有雷暴形成，凡所过处，万里焦土、寸草无生。",1088,1208,0,1225,1600,1,32977500,117280,2,520650,1848,3,433950,1544,4,433950,1544,11,350,0,0,0,0,1,0,},  
    [73] = {4060,406,"碧水麒麟",8,0,"406",8,15406,0,1,1,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1091,0,0,0,200,1,2632500,17280,2,55500,360,3,34650,224,4,34650,224,11,350,0,0,0,0,1,1,},  
    [74] = {4061,406,"碧水麒麟",8,0,"406",8,15406,1,2,1,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1092,0,0,0,400,1,5265000,25920,2,110850,544,3,69300,344,4,69300,344,11,350,0,0,0,0,1,0,},  
    [75] = {4062,406,"碧水麒麟",8,0,"406",8,15406,2,3,1,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1093,0,1099,0,600,1,7897500,34560,2,166350,728,3,103950,456,4,103950,456,11,350,0,0,0,0,1,0,},  
    [76] = {4063,406,"碧水麒麟",8,0,"406",8,15406,3,4,1,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1094,0,1100,0,750,1,10537500,43200,2,221700,912,3,138600,568,4,138600,568,11,350,0,0,0,0,1,0,},  
    [77] = {4064,406,"碧水麒麟",8,0,"406",8,15406,4,5,2,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1095,0,1101,0,900,1,13170000,51840,2,277200,1088,3,173250,680,4,173250,680,11,350,0,0,0,0,1,0,},  
    [78] = {4065,406,"碧水麒麟",8,0,"406",8,15406,5,6,2,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1096,0,1102,0,1200,1,18435000,69120,2,388050,1456,3,242550,912,4,242550,912,11,350,0,0,0,0,1,0,},  
    [79] = {4066,406,"碧水麒麟",8,0,"406",8,15406,6,7,3,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1097,0,1103,0,1400,1,23700000,86400,2,499050,1816,3,311850,1136,4,311850,1136,11,350,0,0,0,0,1,0,},  
    [80] = {4067,406,"碧水麒麟",8,0,"406",8,15406,7,0,0,"相传九州的最中央有一处碧水寒潭，潭水冰冷彻骨，四周寒气缭绕，纵使盛夏，人、兽亦不能近。唯有一神兽能不畏严寒，栖息在此，便是碧水麒麟。麒麟头似龙，身似马，因长居寒潭，碧水寒气与体内炽热交融，于周身形成一道光晕，夺目照人。麒麟每百年入世一次，凡麒麟现世，旱地降雨，乱世平和，有能目睹神采者，皆可活逾百岁，因而被世人奉为祥瑞。",1098,0,1104,0,1600,1,31605000,112400,2,665250,2368,3,415800,1480,4,415800,1480,11,350,0,0,0,0,1,0,},
    }
}

local __index_id = {   
    [1010] = 1,  
    [1011] = 2,  
    [1012] = 3,  
    [1013] = 4,  
    [1014] = 5,  
    [1015] = 6,  
    [1016] = 7,  
    [1017] = 8,  
    [2010] = 9,  
    [2011] = 10,  
    [2012] = 11,  
    [2013] = 12,  
    [2014] = 13,  
    [2015] = 14,  
    [2016] = 15,  
    [2017] = 16,  
    [3010] = 17,  
    [3011] = 18,  
    [3012] = 19,  
    [3013] = 20,  
    [3014] = 21,  
    [3015] = 22,  
    [3016] = 23,  
    [3017] = 24,  
    [3020] = 25,  
    [3021] = 26,  
    [3022] = 27,  
    [3023] = 28,  
    [3024] = 29,  
    [3025] = 30,  
    [3026] = 31,  
    [3027] = 32,  
    [4010] = 33,  
    [4011] = 34,  
    [4012] = 35,  
    [4013] = 36,  
    [4014] = 37,  
    [4015] = 38,  
    [4016] = 39,  
    [4017] = 40,  
    [4020] = 41,  
    [4021] = 42,  
    [4022] = 43,  
    [4023] = 44,  
    [4024] = 45,  
    [4025] = 46,  
    [4026] = 47,  
    [4027] = 48,  
    [4030] = 49,  
    [4031] = 50,  
    [4032] = 51,  
    [4033] = 52,  
    [4034] = 53,  
    [4035] = 54,  
    [4036] = 55,  
    [4037] = 56,  
    [4040] = 57,  
    [4041] = 58,  
    [4042] = 59,  
    [4043] = 60,  
    [4044] = 61,  
    [4045] = 62,  
    [4046] = 63,  
    [4047] = 64,  
    [4050] = 65,  
    [4051] = 66,  
    [4052] = 67,  
    [4053] = 68,  
    [4054] = 69,  
    [4055] = 70,  
    [4056] = 71,  
    [4057] = 72,  
    [4060] = 73,  
    [4061] = 74,  
    [4062] = 75,  
    [4063] = 76,  
    [4064] = 77,  
    [4065] = 78,  
    [4066] = 79,  
    [4067] = 80,
}

local __key_map = { 
    id = 1,
    advance_id = 2,
    name = 3,
    quality = 4,
    rare = 5,
    resource = 6,
    level_group = 7,
    fragment_id = 8,
    star = 9,
    next_star = 10,
    pet_num = 11,
    describe = 12,
    passive_skill_1 = 13,
    passive_skill_2 = 14,
    belong_passive_skill_1 = 15,
    belong_passive_skill_2 = 16,
    skill_factor = 17,
    affect_type_1 = 18,
    affect_value_1 = 19,
    develop_1 = 20,
    affect_type_2 = 21,
    affect_value_2 = 22,
    develop_2 = 23,
    affect_type_3 = 24,
    affect_value_3 = 25,
    develop_3 = 26,
    affect_type_4 = 27,
    affect_value_4 = 28,
    develop_4 = 29,
    affect_type_5 = 30,
    affect_value_5 = 31,
    develop_5 = 32,
    affect_type_6 = 33,
    affect_value_6 = 34,
    develop_6 = 35,
    put = 36,
    gm = 37,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_pet_info")

        return t._raw[__key_map[k]]
    end
}


function pet_info.getLength()
    return #pet_info._data
end



function pet_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_pet_info
function pet_info.indexOf(index)
    if index == nil or not pet_info._data[index] then
        return nil
    end
    return setmetatable({_raw = pet_info._data[index]}, m)
end



---
--@return @class record_pet_info
function pet_info.get(id)
    
    return pet_info.indexOf(__index_id[ id ])
     
end



function pet_info.set(id, key, value)
    local record = pet_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function pet_info.get_index_data()
    return __index_id 
end

return  pet_info 