---@classdef record_recruit_knight_show_info
local record_recruit_knight_show_info = {}


record_recruit_knight_show_info.id = 0--ID
record_recruit_knight_show_info.open = 0--活动id
record_recruit_knight_show_info.name =  ""--活动名称
record_recruit_knight_show_info.knight_id = 0--武将ID
record_recruit_knight_show_info.touch =  ""--特点描述
record_recruit_knight_show_info.reward_view = 0--奖池预览
record_recruit_knight_show_info.cost_gain_1 = 0--购买类型（1次）
record_recruit_knight_show_info.cost_gain_10 = 0--购买类型（10次）
record_recruit_knight_show_info.recruit_knight_1 = 0--神将卡池
record_recruit_knight_show_info.recruit_knight_10 = 0--十连保底
record_recruit_knight_show_info.recruit_knight_20 = 0--20连保底
record_recruit_knight_show_info.show_type = 0--显示类型
record_recruit_knight_show_info.show_value = 0--显示类型值

local recruit_knight_show_info = {
   _data = {   
    [1] = {1,100000,"限时金将第一期",510020,"爆炸列伤，概率眩晕",1,5,6,19,23,27,1,0,},  
    [2] = {2,100000,"限时金将第一期",500110,"单体爆发，怒气回复",2,5,6,20,24,28,1,0,},  
    [3] = {3,100000,"限时金将第一期",510060,"后排减怒，削减免伤",3,5,6,21,25,29,1,0,},  
    [4] = {4,100000,"限时金将第一期",510080,"随机沉默，残敌秒杀",4,5,6,22,26,30,1,0,},  
    [5] = {5,100001,"限时金将第二期",510010,"全体减怒，全体增伤",5,5,6,33,37,41,1,0,},  
    [6] = {6,100001,"限时金将第二期",510030,"前排减怒，全体增伤",6,5,6,34,38,42,1,0,},  
    [7] = {7,100001,"限时金将第二期",510050,"全体灼烧，全体免伤",7,5,6,35,39,43,1,0,},  
    [8] = {8,100001,"限时金将第二期",510070,"范围中毒，全体增伤",8,5,6,36,40,44,1,0,},  
    [9] = {9,100002,"限时金将第三期",510010,"全体减怒，全体增伤",9,5,6,47,51,55,2,201,},  
    [10] = {10,100002,"限时金将第三期",510030,"前排减怒，全体增伤",10,5,6,48,52,56,2,202,},  
    [11] = {11,100002,"限时金将第三期",510050,"全体灼烧，全体免伤",11,5,6,49,53,57,2,203,},  
    [12] = {12,100002,"限时金将第三期",510070,"范围中毒，全体增伤",12,5,6,50,54,58,2,204,},  
    [13] = {13,100003,"第四期  金1-金3",600020,"随机减怒，爆炸输出",13,5,6,61,65,69,2,301,},  
    [14] = {14,100003,"第四期  金1-金3",600090,"增益回怒，全体增伤",14,5,6,62,66,70,2,302,},  
    [15] = {15,100003,"第四期  金1-金3",600100,"概率眩晕，前排伤害",15,5,6,63,67,71,2,303,},  
    [16] = {16,100003,"第四期  金1-金3",600080,"随机减怒，全体减防",16,5,6,64,68,72,2,304,},  
    [17] = {17,100004,"限时金将(开服金1)",510020,"爆炸列伤，概率眩晕",1,5,6,19,23,27,1,0,},  
    [18] = {18,100004,"限时金将(开服金1)",500110,"单体爆发，怒气回复",2,5,6,20,24,28,1,0,},  
    [19] = {19,100004,"限时金将(开服金1)",510060,"后排减怒，削减免伤",3,5,6,21,25,29,1,0,},  
    [20] = {20,100004,"限时金将(开服金1)",510080,"随机沉默，残敌秒杀",4,5,6,22,26,30,1,0,},  
    [21] = {21,100005,"限时金将(开服金2)",510010,"全体减怒，全体增伤",17,5,6,2001,2005,2009,1,0,},  
    [22] = {22,100005,"限时金将(开服金2)",510030,"前排减怒，全体增伤",18,5,6,2002,2006,2010,1,0,},  
    [23] = {23,100005,"限时金将(开服金2)",510050,"全体灼烧，全体免伤",19,5,6,2003,2007,2011,1,0,},  
    [24] = {24,100005,"限时金将(开服金2)",510070,"范围中毒，全体增伤",20,5,6,2004,2008,2012,1,0,},  
    [25] = {25,100006,"第五期  金1-金4",600110,"前排流血，强力输出",21,5,6,2020,2024,2024,2,401,},  
    [26] = {26,100006,"第五期  金1-金4",600030,"全体吸怒，强力控制",22,5,6,2021,2025,2025,2,402,},  
    [27] = {27,100006,"第五期  金1-金4",600050,"暴击破阵，强力输出",23,5,6,2022,2026,2026,2,403,},  
    [28] = {28,100006,"第五期  金1-金4",600120,"后排化身，强力控制",24,5,6,2023,2027,2027,2,404,},  
    [29] = {29,100007,"金1(2.2.0)",510020,"爆炸列伤，概率眩晕",1,5,6,19,23,27,1,0,},  
    [30] = {30,100007,"金1(2.2.0)",500110,"单体爆发，怒气回复",2,5,6,20,24,28,1,0,},  
    [31] = {31,100007,"金1(2.2.0)",510060,"后排减怒，削减免伤",3,5,6,21,25,29,1,0,},  
    [32] = {32,100007,"金1(2.2.0)",510080,"随机沉默，残敌秒杀",4,5,6,22,26,30,1,0,},  
    [33] = {33,100008,"金2(2.2.0)",510010,"全体减怒，全体增伤",25,5,6,2028,2032,2036,1,0,},  
    [34] = {34,100008,"金2(2.2.0)",510030,"前排减怒，全体增伤",26,5,6,2029,2033,2037,1,0,},  
    [35] = {35,100008,"金2(2.2.0)",510050,"全体灼烧，全体免伤",27,5,6,2030,2034,2038,1,0,},  
    [36] = {36,100008,"金2(2.2.0)",510070,"范围中毒，全体增伤",28,5,6,2031,2035,2039,1,0,},  
    [37] = {37,100009,"金3(2.2.0)",600020,"随机减怒，爆炸输出",29,5,6,2040,2044,2048,1,0,},  
    [38] = {38,100009,"金3(2.2.0)",600090,"增益回怒，全体增伤",30,5,6,2041,2045,2049,1,0,},  
    [39] = {39,100009,"金3(2.2.0)",600100,"概率眩晕，前排伤害",31,5,6,2042,2046,2050,1,0,},  
    [40] = {40,100009,"金3(2.2.0)",600080,"随机减怒，全体减防",32,5,6,2043,2047,2051,1,0,},  
    [41] = {41,100010,"第六期  金1-金5",600010,"真实伤害，群体冰冻",33,5,6,2052,2056,2056,2,501,},  
    [42] = {42,100010,"第六期  金1-金5",600040,"无限怒气，免疫控制",34,5,6,2053,2057,2057,2,502,},  
    [43] = {43,100010,"第六期  金1-金5",600060,"火神灼烧，群体眩晕",35,5,6,2054,2058,2058,2,503,},  
    [44] = {44,100010,"第六期  金1-金5",600070,"超强爆发，神勇无双",36,5,6,2055,2059,2059,2,504,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,
}

local __key_map = { 
    id = 1,
    open = 2,
    name = 3,
    knight_id = 4,
    touch = 5,
    reward_view = 6,
    cost_gain_1 = 7,
    cost_gain_10 = 8,
    recruit_knight_1 = 9,
    recruit_knight_10 = 10,
    recruit_knight_20 = 11,
    show_type = 12,
    show_value = 13,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_recruit_knight_show_info")

        return t._raw[__key_map[k]]
    end
}


function recruit_knight_show_info.getLength()
    return #recruit_knight_show_info._data
end



function recruit_knight_show_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_recruit_knight_show_info
function recruit_knight_show_info.indexOf(index)
    if index == nil or not recruit_knight_show_info._data[index] then
        return nil
    end
    return setmetatable({_raw = recruit_knight_show_info._data[index]}, m)
end



---
--@return @class record_recruit_knight_show_info
function recruit_knight_show_info.get(id)
    
    return recruit_knight_show_info.indexOf(__index_id[ id ])
     
end



function recruit_knight_show_info.set(id, key, value)
    local record = recruit_knight_show_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function recruit_knight_show_info.get_index_data()
    return __index_id 
end

return  recruit_knight_show_info 