---@classdef record_recruit_knight_show_info
local record_recruit_knight_show_info = {}


record_recruit_knight_show_info.id = 0--ID
record_recruit_knight_show_info.open = 0--活动id
record_recruit_knight_show_info.quality_type = 0--抽卡类型
record_recruit_knight_show_info.name =  ""--活动名称
record_recruit_knight_show_info.type = 0--大奖类型
record_recruit_knight_show_info.value = 0--大奖值
record_recruit_knight_show_info.touch =  ""--特点描述
record_recruit_knight_show_info.reward_view = 0--奖池预览
record_recruit_knight_show_info.cost_gain_1 = 0--购买类型（1次）
record_recruit_knight_show_info.cost_gain_10 = 0--购买类型（10次）
record_recruit_knight_show_info.recruit_knight_1 = 0--神将卡池
record_recruit_knight_show_info.recruit_knight_10 = 0--十连保底
record_recruit_knight_show_info.recruit_knight_20 = 0--20连保底
record_recruit_knight_show_info.show_type = 0--显示类型
record_recruit_knight_show_info.show_value = 0--显示类型值
record_recruit_knight_show_info.help_text = 0--帮助文本

local recruit_knight_show_info = {
   _data = {   
    [1] = {1,100000,1,"限时金将第一期",4,510020,"爆炸列伤，概率眩晕",1,5,6,19,23,27,1,0,38,},  
    [2] = {2,100000,1,"限时金将第一期",4,500110,"单体爆发，怒气回复",2,5,6,20,24,28,1,0,38,},  
    [3] = {3,100000,1,"限时金将第一期",4,510060,"后排减怒，削减免伤",3,5,6,21,25,29,1,0,38,},  
    [4] = {4,100000,1,"限时金将第一期",4,510080,"随机沉默，残敌秒杀",4,5,6,22,26,30,1,0,38,},  
    [5] = {5,100001,1,"限时金将第二期",4,510010,"全体减怒，全体增伤",5,5,6,33,37,41,1,0,38,},  
    [6] = {6,100001,1,"限时金将第二期",4,510030,"前排减怒，全体增伤",6,5,6,34,38,42,1,0,38,},  
    [7] = {7,100001,1,"限时金将第二期",4,510050,"全体灼烧，全体免伤",7,5,6,35,39,43,1,0,38,},  
    [8] = {8,100001,1,"限时金将第二期",4,510070,"范围中毒，全体增伤",8,5,6,36,40,44,1,0,38,},  
    [9] = {9,100002,1,"限时金将第三期",4,510010,"全体减怒，全体增伤",9,5,6,47,51,55,2,201,38,},  
    [10] = {10,100002,1,"限时金将第三期",4,510030,"前排减怒，全体增伤",10,5,6,48,52,56,2,202,38,},  
    [11] = {11,100002,1,"限时金将第三期",4,510050,"全体灼烧，全体免伤",11,5,6,49,53,57,2,203,38,},  
    [12] = {12,100002,1,"限时金将第三期",4,510070,"范围中毒，全体增伤",12,5,6,50,54,58,2,204,38,},  
    [13] = {13,100003,1,"第四期  金1-金3",4,600020,"随机减怒，爆炸输出",13,5,6,61,65,69,2,301,38,},  
    [14] = {14,100003,1,"第四期  金1-金3",4,600090,"增益回怒，全体增伤",14,5,6,62,66,70,2,302,38,},  
    [15] = {15,100003,1,"第四期  金1-金3",4,600100,"概率眩晕，前排伤害",15,5,6,63,67,71,2,303,38,},  
    [16] = {16,100003,1,"第四期  金1-金3",4,600080,"随机减怒，全体减防",16,5,6,64,68,72,2,304,38,},  
    [17] = {17,100004,1,"限时金将(开服金1)",4,510020,"爆炸列伤，概率眩晕",1,5,6,19,23,27,1,0,38,},  
    [18] = {18,100004,1,"限时金将(开服金1)",4,500110,"单体爆发，怒气回复",2,5,6,20,24,28,1,0,38,},  
    [19] = {19,100004,1,"限时金将(开服金1)",4,510060,"后排减怒，削减免伤",3,5,6,21,25,29,1,0,38,},  
    [20] = {20,100004,1,"限时金将(开服金1)",4,510080,"随机沉默，残敌秒杀",4,5,6,22,26,30,1,0,38,},  
    [21] = {21,100005,1,"限时金将(开服金2)",4,510010,"全体减怒，全体增伤",17,5,6,2001,2005,2009,1,0,38,},  
    [22] = {22,100005,1,"限时金将(开服金2)",4,510030,"前排减怒，全体增伤",18,5,6,2002,2006,2010,1,0,38,},  
    [23] = {23,100005,1,"限时金将(开服金2)",4,510050,"全体灼烧，全体免伤",19,5,6,2003,2007,2011,1,0,38,},  
    [24] = {24,100005,1,"限时金将(开服金2)",4,510070,"范围中毒，全体增伤",20,5,6,2004,2008,2012,1,0,38,},  
    [25] = {25,100006,1,"第五期  金1-金4",4,600110,"前排流血，强力输出",21,5,6,2020,2024,2024,2,401,38,},  
    [26] = {26,100006,1,"第五期  金1-金4",4,600030,"全体吸怒，强力控制",22,5,6,2021,2025,2025,2,402,38,},  
    [27] = {27,100006,1,"第五期  金1-金4",4,600050,"暴击破阵，强力输出",23,5,6,2022,2026,2026,2,403,38,},  
    [28] = {28,100006,1,"第五期  金1-金4",4,600120,"后排化身，强力控制",24,5,6,2023,2027,2027,2,404,38,},  
    [29] = {29,100007,1,"金1(2.2.0)",4,510020,"爆炸列伤，概率眩晕",1,5,6,19,23,27,1,0,38,},  
    [30] = {30,100007,1,"金1(2.2.0)",4,500110,"单体爆发，怒气回复",2,5,6,20,24,28,1,0,38,},  
    [31] = {31,100007,1,"金1(2.2.0)",4,510060,"后排减怒，削减免伤",3,5,6,21,25,29,1,0,38,},  
    [32] = {32,100007,1,"金1(2.2.0)",4,510080,"随机沉默，残敌秒杀",4,5,6,22,26,30,1,0,38,},  
    [33] = {33,100008,1,"金2(2.2.0)",4,510010,"全体减怒，全体增伤",25,5,6,2028,2032,2036,1,0,38,},  
    [34] = {34,100008,1,"金2(2.2.0)",4,510030,"前排减怒，全体增伤",26,5,6,2029,2033,2037,1,0,38,},  
    [35] = {35,100008,1,"金2(2.2.0)",4,510050,"全体灼烧，全体免伤",27,5,6,2030,2034,2038,1,0,38,},  
    [36] = {36,100008,1,"金2(2.2.0)",4,510070,"范围中毒，全体增伤",28,5,6,2031,2035,2039,1,0,38,},  
    [37] = {37,100009,1,"金3(2.2.0)",4,600020,"随机减怒，爆炸输出",29,5,6,2040,2044,2048,1,0,38,},  
    [38] = {38,100009,1,"金3(2.2.0)",4,600090,"增益回怒，全体增伤",30,5,6,2041,2045,2049,1,0,38,},  
    [39] = {39,100009,1,"金3(2.2.0)",4,600100,"概率眩晕，前排伤害",31,5,6,2042,2046,2050,1,0,38,},  
    [40] = {40,100009,1,"金3(2.2.0)",4,600080,"随机减怒，全体减防",32,5,6,2043,2047,2051,1,0,38,},  
    [41] = {41,100010,1,"第六期  金1-金5",4,600010,"真实伤害，群体冰冻",33,5,6,2052,2056,2056,2,501,38,},  
    [42] = {42,100010,1,"第六期  金1-金5",4,600040,"无限怒气，免疫控制",34,5,6,2053,2057,2057,2,502,38,},  
    [43] = {43,100010,1,"第六期  金1-金5",4,600060,"火神灼烧，群体眩晕",35,5,6,2054,2058,2058,2,503,38,},  
    [44] = {44,100010,1,"第六期  金1-金5",4,600070,"超强爆发，神勇无双",36,5,6,2055,2059,2059,2,504,38,},  
    [45] = {45,100011,1,"紫金1双卡池",3,2388,"真实伤害，群体冰冻",37,5,6,5001,5002,5002,2,505,101,},  
    [46] = {46,100011,2,"紫金1双卡池",3,2389,"无限怒气，免疫控制",38,21,22,5003,5004,5004,2,1001,101,},  
    [47] = {47,100012,1,"金5(2.6.0开服)",4,600010,"真实伤害，群体冰冻",39,5,6,2062,2066,2066,1,0,108,},  
    [48] = {48,100012,1,"金5(2.6.0开服)",4,600040,"无限怒气，免疫控制",40,5,6,2063,2067,2067,1,0,108,},  
    [49] = {49,100012,1,"金5(2.6.0开服)",4,600060,"火神灼烧，群体眩晕",41,5,6,2064,2068,2068,1,0,108,},  
    [50] = {50,100012,1,"金5(2.6.0开服)",4,600070,"超强爆发，神勇无双",42,5,6,2065,2069,2069,1,0,108,},  
    [51] = {51,100013,1,"金1-金4(2.6.0开服)",4,600110,"前排流血，强力输出",21,5,6,2072,2076,2076,2,401,108,},  
    [52] = {52,100013,1,"金1-金4(2.6.0开服)",4,600030,"全体吸怒，强力控制",22,5,6,2073,2077,2077,2,402,108,},  
    [53] = {53,100013,1,"金1-金4(2.6.0开服)",4,600050,"暴击破阵，强力输出",23,5,6,2074,2078,2078,2,403,108,},  
    [54] = {54,100013,1,"金1-金4(2.6.0开服)",4,600120,"后排化身，强力控制",24,5,6,2075,2079,2079,2,404,108,},  
    [55] = {55,100014,1,"金1-金5(2.6.0开服)",4,600010,"真实伤害，群体冰冻",33,5,6,2082,2086,2086,2,501,108,},  
    [56] = {56,100014,1,"金1-金5(2.6.0开服)",4,600040,"无限怒气，免疫控制",34,5,6,2083,2087,2087,2,502,108,},  
    [57] = {57,100014,1,"金1-金5(2.6.0开服)",4,600060,"火神灼烧，群体眩晕",35,5,6,2084,2088,2088,2,503,108,},  
    [58] = {58,100014,1,"金1-金5(2.6.0开服)",4,600070,"超强爆发，神勇无双",36,5,6,2085,2089,2089,2,504,108,},  
    [59] = {59,100015,1,"紫金2双卡池",3,2388,"真实伤害，群体冰冻",37,5,6,5001,5002,5002,2,505,101,},  
    [60] = {60,100015,2,"紫金2双卡池",3,2422,"前排输出，强力输出",43,21,22,5005,5006,5006,2,1001,101,},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,  
    [56] = 56,  
    [57] = 57,  
    [58] = 58,  
    [59] = 59,  
    [60] = 60,
}

local __key_map = { 
    id = 1,
    open = 2,
    quality_type = 3,
    name = 4,
    type = 5,
    value = 6,
    touch = 7,
    reward_view = 8,
    cost_gain_1 = 9,
    cost_gain_10 = 10,
    recruit_knight_1 = 11,
    recruit_knight_10 = 12,
    recruit_knight_20 = 13,
    show_type = 14,
    show_value = 15,
    help_text = 16,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_recruit_knight_show_info")

        return t._raw[__key_map[k]]
    end
}


function recruit_knight_show_info.getLength()
    return #recruit_knight_show_info._data
end



function recruit_knight_show_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_recruit_knight_show_info
function recruit_knight_show_info.indexOf(index)
    if index == nil or not recruit_knight_show_info._data[index] then
        return nil
    end
    return setmetatable({_raw = recruit_knight_show_info._data[index]}, m)
end



---
--@return @class record_recruit_knight_show_info
function recruit_knight_show_info.get(id)
    
    return recruit_knight_show_info.indexOf(__index_id[ id ])
     
end



function recruit_knight_show_info.set(id, key, value)
    local record = recruit_knight_show_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function recruit_knight_show_info.get_index_data()
    return __index_id 
end

return  recruit_knight_show_info 