---@classdef record_spacetime_dungeon_message_info
local record_spacetime_dungeon_message_info = {}


record_spacetime_dungeon_message_info.chapter = 0--归属章节
record_spacetime_dungeon_message_info.event_id = 0--触发事件
record_spacetime_dungeon_message_info.description =  ""--日志描述

local spacetime_dungeon_message_info = {
   _data = {   
    [1] = {1,5,"建安十二年十月廿九，急行军翻越白狼山，前往山顶的乌桓部落。狼头匕首，我势在必得。",},  
    [2] = {1,6,"呼，高山之上屡遭战斗，实在疲乏不堪。东北方有造化台，暂且去提升一番实力。",},  
    [3] = {2,1,"建兴七年五月初四，入上古离火阵第五天。火……遍地都是火，诸葛究竟把阵旗藏在哪里？找到四面阵旗，才能破阵而出。",},  
    [4] = {2,4,"火焰终于熄灭了，天字阵旗操控的天之离火全灭了。",},  
    [5] = {2,11,"火灭了……地字阵旗一倒，遍地大火只剩一半。",},  
    [6] = {2,14,"火又灭了，玄字阵旗的倒下，让玄之离火全部熄灭。",},  
    [7] = {2,17,"黄字阵旗折断，哈哈，遍地离火均已熄灭。八卦阵盘已现，此物必将落入我手中。",},  
    [8] = {3,28,"光和三年春二月，大疫，入山寻药。仙人无情，一旦选错道路，便会被困山中。",},  
    [9] = {3,19,"轰——山石翻转，地面震动。似乎触动了什么机关……这就是仙人的考验吗？",},  
    [10] = {3,20,"远处传来巨大的声响，似乎出现了一些隐蔽的道路。这漫山的森林，难道只是仙人的障眼法？！",},  
    [11] = {4,21,"初平三年春二月，攻入洛阳城。董卓老贼火烧洛阳，城中残破不堪。有祥瑞现世！宫中那道冲天的紫光必有异常，得立刻赶过去查看！",},  
    [12] = {4,1,"当心！陷阱暗藏玄机，防不胜防，不能急于行军。先去寻找机关，破解陷阱。",},  
    [13] = {4,2,"不好！董卓竟然派了西凉精锐把守皇宫正门。为今之计，只有寻找小路绕道了。",},  
    [14] = {4,18,"轰隆隆——成了！远处传来机关转动的轰鸣声，可以再去宫门那边看看。",},  
    [15] = {4,20,"紫气近在眼前！那是？一口枯井？！井底的宝物竟然是传国玉玺，难怪城里有这么多西凉兵！",},  
    [16] = {5,22,"建安十年腊月初八，航海，突遇飓风，被吹至无名小岛。",},  
    [17] = {5,26,"这座岛有点古怪，诡异的铃声又是怎么回事……看看能否跟着铃音走出小岛吧。",},  
    [18] = {6,30,"陈宫设下机关陷阱阻我游说郭贡，哼，如此伎俩怎能奈何得了我？",},  
    [19] = {6,1,"北面有一伙杀人不眨眼的山贼，前去剿灭他们！",},  
    [20] = {6,9,"虽然找到了山贼，不过好像另有隐情？",},  
    [21] = {6,16,"乱离人，不如太平犬。",},  
    [22] = {6,28,"阵法已破，可以见郭贡游说他了！",},  
    [23] = {7,82,"通过试炼，找到绝世神兵吧！",},  
    [24] = {7,13,"事有蹊跷，水镜先生居然出现了，说需要获得仙人的祝福才能通过试炼，我还是先去周围打听打听吧。",},  
    [25] = {7,21,"雪山深处居然有仙人隐居之所！可那里亦是危险之地，我最好做好万全打算再出发。",},  
    [26] = {7,33,"上天有好生之德，放走了这些逃兵，我也不知做的对不对，诶。。。",},  
    [27] = {7,39,"鲜卑的敌人，该杀！",},  
    [28] = {7,44,"终于获得了仙人祝福，不过……竟然已经过了半个月？",},  
    [29] = {1001,1,"灵槐树被修复以后，镇魂街似乎又恢复了平静。不对，镇魂街的结界再次不稳，是谁又对灵槐树出手？",},  
    [30] = {1001,20,"于禁被困，似乎有性命之忧。但灵槐枝又随时可能被恶灵吞食，必须尽快将它夺回。事情紧急，究竟该如何抉择……",},  
    [31] = {1001,6,"想要打通这些被烈火阻隔的道路，必须找到火符台。嗯？那群恶灵身后，好像有什么东西。",},  
    [32] = {1001,7,"恶灵不断变强，必须立刻夺回灵槐枝。不过，如果不想损失实力，要找到机关，解除陷阱。",},  
    [33] = {1001,21,"于禁的灵体消散了！黑衣人做了什么？击败黑衣人能消除大量恶灵，却会损失大量时空之力，我要……",},  
    [34] = {1002,38,"竟然有不明恶灵在袭击三国时代……",},  
    [35] = {1002,40,"可恶，曹操被恶灵困在了东南方的营寨之中，心神受损，必须先救他出来。",},  
    [36] = {1002,42,"草丛里埋伏着无数被恶灵附体的士兵，要时刻小心。不过，击败他们中的一些或许会有意外之喜。",},  
    [37] = {1002,43,"要挽救曹操必须收聚他散失的神识，也许他的佩剑孟德剑能帮上忙。孟德剑就在南边。",},  
    [38] = {1002,49,"果然孟德剑上藏着曹操的神识！曹操就有救了！",},  
    [39] = {1003,79,"到处都是恶灵，还是尽快带曹操离开这儿吧。不过路到底在哪啊？先调查下周围。",},  
    [40] = {1003,80,"没想到地上的司南可以开启传送阵，这些机关传送到底是谁留下的……",},  
    [41] = {1003,86,"我早该想到，除了那个古怪的黑衣人，还有谁会在三国作乱！想必这些司南也是他留下的！呵呵，那就借本大爷用用吧！",},  
    [42] = {1003,88,"黑衣人，总算找到你了！你这杂碎惹出这么多麻烦，别想跑！",},  
    [43] = {1003,90,"以清风化煞的威力，净化这里的阴气恶灵还是绰绰有余的，必须赶紧把它弄到手，三国时空可撑不了太久！",},  
    [44] = {1003,84,"靠！还是让他跑了！他好像说他要回镇魂街去？这杂碎到底想干什么！！",},  
    [45] = {1003,100,"眼皮一直跳，黑衣人那个杂碎一定还在谋划什么！还是尽快拿了清风化煞净化阴气，赶紧去找他吧！",},  
    [46] = {1004,25,"在三国的第十天，终于用清风化煞净化掉所有阴气，三国世界恢复正常。曹操竟然想把我留在三国？开什么玩笑，那个黑衣人夺走了转轮神珠，还不知道他要对镇魂街做什么。我必须尽快赶回镇魂街。",},  
    [47] = {1004,27,"返回镇魂街的道路地形错乱，阴气遮蔽，似乎就是个迷宫吗？幸好许褚谨慎，发现了潜藏在草丛里的恶灵。这些恶灵身上都有充沛的时空之力，看来后面要仔细搜索这种草丛了。",},  
    [48] = {1004,28,"通往镇魂街的路封闭了，究竟该怎么办？这个神神叨叨的老头说什么左边有传送阵，要不就去看看。",},  
    [49] = {1004,29,"这老头竟然是水镜先生。这人的话不能不听，三次传送才能返回镇魂街，看来得好好寻找传送阵了。",},  
    [50] = {1004,30,"黑衣人竟然用转轮神珠打开了阴界之门，镇魂街上现在遍地都是亡灵。我一定会夺回转轮神珠，关闭冥界阴门！小亮，等我回来！",},  
    [51] = {1005,5,"张邈似乎知道摧毁怪石之法，还是先找到他吧。",},  
    [52] = {1005,16,"路上发现条暗道，找到机关应该可以打开。看这机关的布置手法，这背后的人会是……？",},  
    [53] = {1005,17,"怪石已被炸毁，现在就能把几人救出来了！",},  
    [54] = {1005,26,"张邈竟敢在我面前耍滑头！呵，等我找到盟军叛徒，再来收拾你！",},  
    [55] = {1005,33,"擅使大弓，又擅机关异术，难道真的是他？",},  
    [56] = {1005,34,"奸细果然是堂兄袁遗，唉！",},  
    [57] = {1006,3,"韩馥占据冀州，我若能夺之，何愁兵粮？不妨先四处看看，寻找机会。",},  
    [58] = {1006,7,"遇到了韩馥大将鞠义，他似乎刚从韩馥那里叛出，正好为我所用！按鞠义所说解除机关，就可找到密径直取邺城。不知韩馥见到我会是怎样表情？",},  
    [59] = {1006,8,"终于打败了韩馥，冀州从此属于我袁绍了！",},  
    [60] = {1007,47,"黑山军张燕勾结一批黄巾军残部藏于深林中，想办法剿灭他们！",},  
    [61] = {1007,48,"气候寒冷，大半将士冻伤，不知前面可有地方治疗？",},  
    [62] = {1007,55,"一路上有不少游医在采摘药材，他们能治冻伤，谨慎安排路线吧！",},  
    [63] = {1007,49,"剿灭了一处黑山军营地。",},  
    [64] = {1007,50,"发现黄巾军营地，顺手灭了吧。",},  
    [65] = {1007,51,"又一处黑山军营，终点不远了吧？",},  
    [66] = {1007,52,"黄巾军营已全部剿灭，剩下的只有张燕老巢了！",},  
    [67] = {1007,54,"打败了张燕，从他遗落的物品里发现了飞燕战甲。",},  
    [68] = {1008,88,"公孙瓒摆无数拒马、筑十丈高楼，想办法攻破他！",},  
    [69] = {1008,89,"用火可以烧掉拒马，再找找看水龙来灭火吧。",},  
    [70] = {1008,90,"烧掉拒马、以水灭火，就这么前进吧！",},  
    [71] = {1008,91,"又烧掉一处拒马，继续前行吧！",},  
    [72] = {1008,92,"看来公孙瓒离得不远了！",},  
    [73] = {1008,93,"还差一口气！公孙瓒就在前面！",},  
    [74] = {1008,94,"终于剿灭了公孙瓒，从此冀青幽并皆入我手！天下何人再是我袁绍的敌手？",},  
    [75] = {1009,34,"打神鞭莫名失落、幽都山怨气缭绕……有必要仔细查探。",},  
    [76] = {1009,35,"引发幽都山异变的是……时空乱流？",},  
    [77] = {1009,41,"看到打神鞭了，小心寻路前进！",},  
    [78] = {1009,39,"那个名为三国的乱世时空……究竟发生了什么？",},  
    [79] = {1010,55,"这个生灵涂炭的时代竟是有人在幕后操纵？先想办法破了眼前的镜像大阵。",},  
    [80] = {1010,41,"造这大阵的灵宝是六通神鼓，还有……封神榜？",},  
    [81] = {1010,42,"救下赵云，快去会会他家军师。",},  
    [82] = {1010,43,"原来是诸葛亮以时空乱流之法引我前来。",},  
    [83] = {1010,45,"机关已破，赶紧出去吧。",},  
    [84] = {1011,21,"找到八卦金剑，破了这法阵，让诸葛亮顺利借到东风！",},  
    [85] = {1011,25,"这路怪怪的。",},  
    [86] = {1011,26,"这路有光芒。",},  
    [87] = {1011,27,"前面就是八卦金剑，破了这法阵，然后上昆仑找于吉吧！",},  
    [88] = {1012,24,"去吧，找到于吉，取走封神榜！",},  
    [89] = {1012,26,"找到类似机关，便能到达于吉那里。",},  
    [90] = {1012,27,"所谓天命，究竟为何？",},  
    [91] = {1012,28,"重建三国时空神的秩序，剩下的就靠他们了！",},
    }
}

local __index_chapter_event_id = {   
    ["1_5"] = 1,  
    ["1_6"] = 2,  
    ["2_1"] = 3,  
    ["2_4"] = 4,  
    ["2_11"] = 5,  
    ["2_14"] = 6,  
    ["2_17"] = 7,  
    ["3_28"] = 8,  
    ["3_19"] = 9,  
    ["3_20"] = 10,  
    ["4_21"] = 11,  
    ["4_1"] = 12,  
    ["4_2"] = 13,  
    ["4_18"] = 14,  
    ["4_20"] = 15,  
    ["5_22"] = 16,  
    ["5_26"] = 17,  
    ["6_30"] = 18,  
    ["6_1"] = 19,  
    ["6_9"] = 20,  
    ["6_16"] = 21,  
    ["6_28"] = 22,  
    ["7_82"] = 23,  
    ["7_13"] = 24,  
    ["7_21"] = 25,  
    ["7_33"] = 26,  
    ["7_39"] = 27,  
    ["7_44"] = 28,  
    ["1001_1"] = 29,  
    ["1001_20"] = 30,  
    ["1001_6"] = 31,  
    ["1001_7"] = 32,  
    ["1001_21"] = 33,  
    ["1002_38"] = 34,  
    ["1002_40"] = 35,  
    ["1002_42"] = 36,  
    ["1002_43"] = 37,  
    ["1002_49"] = 38,  
    ["1003_79"] = 39,  
    ["1003_80"] = 40,  
    ["1003_86"] = 41,  
    ["1003_88"] = 42,  
    ["1003_90"] = 43,  
    ["1003_84"] = 44,  
    ["1003_100"] = 45,  
    ["1004_25"] = 46,  
    ["1004_27"] = 47,  
    ["1004_28"] = 48,  
    ["1004_29"] = 49,  
    ["1004_30"] = 50,  
    ["1005_5"] = 51,  
    ["1005_16"] = 52,  
    ["1005_17"] = 53,  
    ["1005_26"] = 54,  
    ["1005_33"] = 55,  
    ["1005_34"] = 56,  
    ["1006_3"] = 57,  
    ["1006_7"] = 58,  
    ["1006_8"] = 59,  
    ["1007_47"] = 60,  
    ["1007_48"] = 61,  
    ["1007_55"] = 62,  
    ["1007_49"] = 63,  
    ["1007_50"] = 64,  
    ["1007_51"] = 65,  
    ["1007_52"] = 66,  
    ["1007_54"] = 67,  
    ["1008_88"] = 68,  
    ["1008_89"] = 69,  
    ["1008_90"] = 70,  
    ["1008_91"] = 71,  
    ["1008_92"] = 72,  
    ["1008_93"] = 73,  
    ["1008_94"] = 74,  
    ["1009_34"] = 75,  
    ["1009_35"] = 76,  
    ["1009_41"] = 77,  
    ["1009_39"] = 78,  
    ["1010_55"] = 79,  
    ["1010_41"] = 80,  
    ["1010_42"] = 81,  
    ["1010_43"] = 82,  
    ["1010_45"] = 83,  
    ["1011_21"] = 84,  
    ["1011_25"] = 85,  
    ["1011_26"] = 86,  
    ["1011_27"] = 87,  
    ["1012_24"] = 88,  
    ["1012_26"] = 89,  
    ["1012_27"] = 90,  
    ["1012_28"] = 91,
}

local __key_map = { 
    chapter = 1,
    event_id = 2,
    description = 3,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_spacetime_dungeon_message_info")

        return t._raw[__key_map[k]]
    end
}


function spacetime_dungeon_message_info.getLength()
    return #spacetime_dungeon_message_info._data
end



function spacetime_dungeon_message_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_spacetime_dungeon_message_info
function spacetime_dungeon_message_info.indexOf(index)
    if index == nil or not spacetime_dungeon_message_info._data[index] then
        return nil
    end
    return setmetatable({_raw = spacetime_dungeon_message_info._data[index]}, m)
end



---
--@return @class record_spacetime_dungeon_message_info
function spacetime_dungeon_message_info.get(chapter,event_id)
    
    local k = chapter .. '_' .. event_id
    return spacetime_dungeon_message_info.indexOf(__index_chapter_event_id[k])
     
end



function spacetime_dungeon_message_info.set(chapter,event_id, key, value)
    local record = spacetime_dungeon_message_info.get(chapter,event_id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function spacetime_dungeon_message_info.get_index_data()
    return __index_chapter_event_id 
end

return  spacetime_dungeon_message_info 