---@classdef record_spacetime_dungeon_monster_info
local record_spacetime_dungeon_monster_info = {}


record_spacetime_dungeon_monster_info.id = 0--ID
record_spacetime_dungeon_monster_info.monster_team_id = 0--怪物阵容
record_spacetime_dungeon_monster_info.power = 0--消耗体力
record_spacetime_dungeon_monster_info.monster_power = 0--推荐战力（作废）
record_spacetime_dungeon_monster_info.name =  ""--怪物名字
record_spacetime_dungeon_monster_info.monster_des =  ""--怪物描述
record_spacetime_dungeon_monster_info.reward_des =  ""--击败奖励描述
record_spacetime_dungeon_monster_info.line =  ""--气泡文本

local spacetime_dungeon_monster_info = {
   _data = {   
    [1] = {1,170001,5,1000,"白狼山贼","白狼山脚下的一伙山贼，不堪一击。","击败后可获得紫色品质的时空之力","回怒增伤",},  
    [2] = {2,170002,5,2000,"白狼强盗","白狼山中的强盗，实力参差不齐。","击败后可获得橙色品质的时空之力","前排控制",},  
    [3] = {3,170003,5,3000,"造化台化身","造化台幻化出的怪物，实力较为强力。","击败后可获得橙色品质的时空之力","前排控制",},  
    [4] = {4,170004,5,4000,"乌桓残部","乌桓部落外围的老弱残兵，战力低下。","击败后可获得紫色品质的时空之力","持续伤害",},  
    [5] = {5,170005,5,5000,"乌桓士兵","乌桓军营外围的士兵，似乎颇有实力。","击败后可获得红色品质的时空之力","持续伤害",},  
    [6] = {6,170006,5,6000,"乌桓精锐","乌桓部落真正的精锐，实力强劲。","击败后可获得红色品质的时空之力","回怒增伤",},  
    [7] = {7,170007,5,7000,"蜀军士兵","守护八卦图的蜀国士兵，实力参差不齐。","击败后可获得紫色品质的时空之力","回怒增伤",},  
    [8] = {8,170008,5,8000,"蜀军士兵","守护八卦图的蜀国士兵，实力较为强力。","击败后可获得橙色品质的时空之力","前排控制",},  
    [9] = {9,170009,5,9000,"蜀国谋士","守护八卦图的谋士，此阵型似乎颇有玄机。","击败后可获得橙色品质的时空之力","卧龙凤雏",},  
    [10] = {10,170010,5,10000,"蜀军士兵","守护八卦图的蜀国士兵，实力较为强力。","击败后可获得橙色品质的时空之力","前排控制",},  
    [11] = {11,170011,5,11000,"蜀军士兵","守护八卦图的蜀国士兵，实力较为强力。","击败后可获得橙色品质的时空之力","前排控制",},  
    [12] = {12,170012,5,12000,"蜀军士兵","守护八卦图的蜀国士兵，实力较为强力。","击败后可获得橙色品质的时空之力","回怒增伤",},  
    [13] = {13,170013,5,13000,"蜀军士兵","守护八卦图的蜀国士兵，实力参差不齐。","击败后可获得紫色品质的时空之力","持续伤害",},  
    [14] = {14,170014,5,14000,"蜀军士兵","守护八卦图的蜀国士兵，实力较为强力。","击败后可获得橙色品质的时空之力","前排控制",},  
    [15] = {15,170015,5,15000,"蜀军士兵","守护八卦图的蜀国士兵，实力参差不齐。","击败后可获得紫色品质的时空之力","快速恢复",},  
    [16] = {16,170016,5,16000,"蜀军伏兵","诸葛亮安排的伏兵，蜀军中的精锐，战力颇高。","击败后可获得红色品质的时空之力","列伤控制",},  
    [17] = {17,170017,5,17000,"蜀军士兵","守护八卦图的蜀国士兵，实力参差不齐。","击败后可获得紫色品质的时空之力","持续伤害",},  
    [18] = {18,170018,5,18000,"蜀军精锐","诸葛亮的亲卫，蜀军中的精锐，战力颇高。","击败后可获得红色品质的时空之力","木鸢乘风",},  
    [19] = {19,170019,5,19000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","前排控制",},  
    [20] = {20,170020,5,20000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","列伤回复",},  
    [21] = {21,170021,5,21000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","前排控制",},  
    [22] = {22,170022,5,22000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","列伤回复",},  
    [23] = {23,170023,5,23000,"山中异士","山中隐居之人，较为强力","迷雾笼罩，无法探查","前排控制",},  
    [24] = {24,170024,5,24000,"山中异士","山中隐居之人，较为强力","迷雾笼罩，无法探查","后排输出",},  
    [25] = {25,170025,5,25000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","列伤回复",},  
    [26] = {26,170026,5,26000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","列伤回复",},  
    [27] = {27,170027,5,27000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","前排控制",},  
    [28] = {28,170028,5,28000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","列伤回复",},  
    [29] = {29,170029,5,29000,"山中异士","山中隐居之人，较为强力","迷雾笼罩，无法探查","前排控制",},  
    [30] = {30,170030,5,30000,"山中异士","山中隐居之人，较为强力","迷雾笼罩，无法探查","前排控制",},  
    [31] = {31,170031,5,31000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","前排控制",},  
    [32] = {32,170032,5,32000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","持续回复",},  
    [33] = {33,170033,5,33000,"山中异士","山中隐居之人，实力不济","迷雾笼罩，无法探查","列伤回复",},  
    [34] = {34,170034,5,34000,"山中异士","山中隐居之人，较为强力","击败后可获得橙色品质的时空之力","列伤回复",},  
    [35] = {35,170035,5,35000,"山中异士","山中隐居之人，战力颇高","击败后可获得橙色品质的时空之力","前排控制",},  
    [36] = {36,170036,5,36000,"仙人幻象","仙人幻化的分身，似有玄机，不可小视","击败后可获得红色品质的时空之力","无限控制",},  
    [37] = {37,170037,5,37000,"山中异士","山中隐居之人，战力颇高","击败后可获得橙色品质的时空之力","持续伤害",},  
    [38] = {38,170038,5,38000,"山中异士","山中隐居之人，战力颇高","击败后可获得橙色品质的时空之力","列伤控制",},  
    [39] = {39,170039,5,39000,"西凉劫匪","西凉的劫匪，战力不堪直视","击败后可获得紫色品质的时空之力","列伤控制",},  
    [40] = {40,170040,5,40000,"西凉劫匪","西凉的劫匪，战力不堪直视","击败后可获得紫色品质的时空之力","列伤控制",},  
    [41] = {41,170041,5,41000,"西凉劫匪","西凉的劫匪，战力不堪直视","击败后可获得紫色品质的时空之力","列伤回复",},  
    [42] = {42,170042,5,42000,"西凉劫匪","西凉的劫匪，战力不堪直视","击败后可获得紫色品质的时空之力","持续伤害",},  
    [43] = {43,170043,5,43000,"西凉劫匪","西凉的劫匪，战力不堪直视","击败后可获得紫色品质的时空之力","列伤回复",},  
    [44] = {44,170044,5,44000,"西凉精锐","西凉叛军精锐，巡视皇城入口，实力雄厚","击败后无法获得时空之力","前排控制",},  
    [45] = {45,170045,5,45000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后无法获得时空之力","列伤控制",},  
    [46] = {46,170046,5,46000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后无法获得时空之力","列伤回复",},  
    [47] = {47,170047,5,47000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后无法获得时空之力","持续伤害",},  
    [48] = {48,170048,5,48000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后可获得紫色品质的时空之力","前排控制",},  
    [49] = {49,170049,5,49000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后可获得紫色品质的时空之力","回怒增伤",},  
    [50] = {50,170050,5,50000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后可获得紫色品质的时空之力","前排控制",},  
    [51] = {51,170051,5,51000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后可获得橙色品质的时空之力","持续伤害",},  
    [52] = {52,170052,5,52000,"西凉劫匪","西凉的劫匪，看起来军力较为雄厚","击败后可获得橙色品质的时空之力","持续伤害",},  
    [53] = {53,170053,5,53000,"西凉劫匪","西凉叛军精锐，实力强劲","击败后可获得红色品质的时空之力","前排控制",},  
    [54] = {54,170054,5,54000,"西凉劫匪","西凉叛军精锐，实力强劲","击败后可获得红色品质的时空之力","前排控制",},  
    [55] = {55,170055,5,55000,"西凉精锐","西凉叛军精锐，巡视皇城入口，实力雄厚","击败后无法获得时空之力","前排控制",},  
    [56] = {10101,180001,0,1000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","列伤输出",},  
    [57] = {10102,180002,0,2000,"游荡亡灵","游荡的亡灵，灵力低微，击败有意外收获","击败后可获得紫色品质的时空之力","持续回复",},  
    [58] = {10103,180003,0,3000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","持续回复",},  
    [59] = {10104,180004,0,4000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","持续回复",},  
    [60] = {10105,180005,0,5000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","前排控制",},  
    [61] = {10106,180006,0,6000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后可获得紫色品质的时空之力","持续伤害",},  
    [62] = {10107,180007,0,7000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","持续伤害",},  
    [63] = {10108,180008,0,8000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","持续输出",},  
    [64] = {10109,180009,0,9000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","前排眩晕",},  
    [65] = {10110,180010,0,10000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","前排眩晕",},  
    [66] = {10111,180011,0,11000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","前排控制",},  
    [67] = {10112,180012,0,12000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","前排控制",},  
    [68] = {10113,180013,0,13000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","持续伤害",},  
    [69] = {10114,180014,0,14000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后可获得紫色品质的时空之力","持续伤害",},  
    [70] = {10115,180015,0,15000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","前排控制",},  
    [71] = {10116,180016,0,16000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","持续伤害",},  
    [72] = {10117,180017,0,17000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后可获得紫色品质的时空之力","列伤输出",},  
    [73] = {10118,180018,0,18000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","持续伤害",},  
    [74] = {10119,180019,0,19000,"游荡亡灵","在人界和灵界游荡的亡灵，灵力低微","击败后无法获得时空之力","前排眩晕",},  
    [75] = {10120,180020,0,20000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","前排控制",},  
    [76] = {10121,180021,0,21000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","持续输出",},  
    [77] = {10122,180022,0,22000,"游荡亡灵","游荡的亡灵，灵力低微，击败有意外收获","击败后无法获得时空之力","持续回复",},  
    [78] = {10123,180023,0,23000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","持续伤害",},  
    [79] = {10124,180024,0,24000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","前排眩晕",},  
    [80] = {10125,180025,0,25000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后可获得橙色品质的时空之力","持续伤害",},  
    [81] = {10126,180026,0,26000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","持续伤害",},  
    [82] = {10127,180027,0,27000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","前排控制",},  
    [83] = {10128,180028,0,28000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","列伤输出",},  
    [84] = {10129,180029,0,29000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后可获得橙色品质的时空之力","前排控制",},  
    [85] = {10130,180030,0,30000,"地狱恶灵","从地狱逃出的恶灵之王，灵力堪称恐怖","击败后无法获得时空之力","前排眩晕",},  
    [86] = {10131,180031,0,31000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","持续伤害",},  
    [87] = {10132,180032,0,32000,"黑影化形","神秘黑影，灵力不俗，击败可清退些恶灵","击败后无法获得时空之力","持续回复",},  
    [88] = {10201,180033,0,33000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续输出",},  
    [89] = {10202,180034,0,34000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","前排控制",},  
    [90] = {10203,180035,0,35000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续输出",},  
    [91] = {10204,180036,0,36000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","前排眩晕",},  
    [92] = {10205,180037,0,37000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","列伤输出",},  
    [93] = {10206,180038,0,38000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","持续伤害",},  
    [94] = {10207,180039,0,39000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","持续伤害",},  
    [95] = {10208,180040,0,40000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","前排控制",},  
    [96] = {10209,180041,0,41000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","前排控制",},  
    [97] = {10210,180042,0,42000,"恶灵将军","藏在草丛中的将军，神智全失，实力雄厚","迷雾笼罩，无法探查","持续回复",},  
    [98] = {10211,180043,0,43000,"恶灵将军","藏在草丛中的将军，神智全失，实力雄厚","迷雾笼罩，无法探查","持续伤害",},  
    [99] = {10212,180044,0,44000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续伤害",},  
    [100] = {10213,180045,0,45000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","列伤输出",},  
    [101] = {10214,180046,0,46000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续伤害",},  
    [102] = {10215,180047,0,47000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","列伤输出",},  
    [103] = {10216,180048,0,48000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","前排控制",},  
    [104] = {10217,180049,0,49000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","持续回复",},  
    [105] = {10218,180050,0,50000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","持续回复",},  
    [106] = {10219,180051,0,51000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","持续伤害",},  
    [107] = {10220,180052,0,52000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","列伤输出",},  
    [108] = {10221,180053,0,53000,"恶灵将军","藏在草丛中的将军，神智全失，实力雄厚","迷雾笼罩，无法探查","持续输出",},  
    [109] = {10222,180054,0,54000,"恶灵将军","藏在草丛中的将军，神智全失，实力雄厚","迷雾笼罩，无法探查","持续伤害",},  
    [110] = {10223,180055,0,55000,"恶灵将军","藏在草丛中的将军，神智全失，实力雄厚","迷雾笼罩，无法探查","前排控制",},  
    [111] = {10224,180056,0,52000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","后排输出",},  
    [112] = {10225,180057,0,52000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","后排输出",},  
    [113] = {10226,180058,0,52000,"癫狂将领","藏在草丛中的将领，举止癫狂，实力不俗","迷雾笼罩，无法探查","前排控制",},  
    [114] = {10227,180059,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","强力收割",},  
    [115] = {10228,180060,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续伤害",},  
    [116] = {10229,180061,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续输出",},  
    [117] = {10230,180062,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续伤害",},  
    [118] = {10231,180063,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续输出",},  
    [119] = {10232,180064,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","持续回复",},  
    [120] = {10233,180065,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","前排眩晕",},  
    [121] = {10234,180066,0,52000,"痴狂士兵","藏在草丛中的士兵，陷入痴狂，不堪一击","迷雾笼罩，无法探查","前排控制",},  
    [122] = {10235,180067,0,52000,"狱府阴魂","杀气冲天的恶灵群，实力恐怖","击败后无法获得时空之力","前排控制",},  
    [123] = {10236,180068,0,52000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得橙色品质的时空之力","持续伤害",},  
    [124] = {10237,180069,0,52000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得橙色品质的时空之力","列伤输出",},  
    [125] = {10238,180070,0,52000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得红色品质的时空之力","持续输出",},  
    [126] = {10301,180071,0,1000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","前排控制",},  
    [127] = {10302,180072,0,2000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","持续伤害",},  
    [128] = {10303,180073,0,3000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","列伤输出",},  
    [129] = {10304,180074,0,4000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","前排控制",},  
    [130] = {10305,180075,0,5000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","列伤输出",},  
    [131] = {10306,180076,0,6000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","持续回复",},  
    [132] = {10307,180077,0,7000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","前排控制",},  
    [133] = {10308,180078,0,8000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","前排控制",},  
    [134] = {10309,180079,0,9000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","持续输出",},  
    [135] = {10310,180080,0,10000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","列伤输出",},  
    [136] = {10311,180081,0,11000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","持续回复",},  
    [137] = {10312,180082,0,12000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","持续伤害",},  
    [138] = {10313,180083,0,13000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","持续输出",},  
    [139] = {10314,180084,0,14000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","前排控制",},  
    [140] = {10315,180085,0,15000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","前排控制",},  
    [141] = {10316,180086,0,16000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","持续伤害",},  
    [142] = {10317,180087,0,17000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","列伤输出",},  
    [143] = {10318,180088,0,18000,"痴狂士兵","被恶灵袭击的士兵，陷入痴狂，不堪一击","击败后可获得紫色品质的时空之力","持续伤害",},  
    [144] = {10319,180089,0,19000,"癫狂将领","被恶灵附身的将领，举止癫狂，实力不俗","击败后无法获得时空之力","前排眩晕",},  
    [145] = {10320,180090,0,20000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得橙色品质的时空之力","后排输出",},  
    [146] = {10321,180091,0,21000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得橙色品质的时空之力","持续伤害",},  
    [147] = {10322,180092,0,22000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得橙色品质的时空之力","列伤输出",},  
    [148] = {10323,180093,0,23000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得橙色品质的时空之力","持续输出",},  
    [149] = {10324,180094,0,24000,"狱府阴魂","杀气冲天的恶灵群，实力恐怖","击败后无法获得时空之力","持续回复",},  
    [150] = {10325,180095,0,25000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得红色品质的时空之力","前排控制",},  
    [151] = {10326,180096,0,26000,"黑影化形","神秘的黑衣人，实力强大，要多加小心","击败后无法获得时空之力","单体伤害",},  
    [152] = {10327,180097,0,27000,"狱府阴魂","杀气冲天的恶灵群，实力恐怖","击败后可获得红色品质的时空之力","前排控制",},  
    [153] = {10328,180098,0,28000,"恶灵将军","被恶灵吞噬的将军，神智全失，实力雄厚","击败后可获得红色品质的时空之力","前排控制",},  
    [154] = {10401,180099,0,1000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","迷雾笼罩，无法探查","持续伤害",},  
    [155] = {10402,180100,0,2000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后可获得紫色品质的时空之力","前排控制",},  
    [156] = {10403,180101,0,3000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后可获得紫色品质的时空之力","前排控制",},  
    [157] = {10404,180102,0,4000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后无法获得时空之力","持续伤害",},  
    [158] = {10405,180103,0,5000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后无法获得时空之力","持续回复",},  
    [159] = {10406,180104,0,6000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后无法获得时空之力","持续伤害",},  
    [160] = {10407,180105,0,7000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后可获得紫色品质的时空之力","持续输出",},  
    [161] = {10408,180106,0,8000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后可获得紫色品质的时空之力","持续输出",},  
    [162] = {10409,180107,0,9000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后可获得紫色品质的时空之力","持续输出",},  
    [163] = {10410,180108,0,10000,"游荡亡灵","游荡在古战场遗址的亡灵士兵，灵力低微","击败后无法获得时空之力","前排控制",},  
    [164] = {10411,180109,0,11000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后无法获得时空之力","后排输出",},  
    [165] = {10412,180110,0,12000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后无法获得时空之力","前排眩晕",},  
    [166] = {10413,180111,0,13000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","前排控制",},  
    [167] = {10414,180112,0,14000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后无法获得时空之力","持续回复",},  
    [168] = {10415,180113,0,15000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","后排输出",},  
    [169] = {10416,180114,0,16000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后无法获得时空之力","前排控制",},  
    [170] = {10417,180115,0,17000,"异世恶灵","不知名异世中的恶灵，灵力不俗","击败后无法获得时空之力","前排眩晕",},  
    [171] = {10418,180116,0,18000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","持续回复",},  
    [172] = {10419,180117,0,19000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后无法获得时空之力","持续输出",},  
    [173] = {10420,180118,0,20000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","持续回复",},  
    [174] = {10421,180119,0,21000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","前排眩晕",},  
    [175] = {10422,180120,0,22000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后可获得紫色品质的时空之力","列伤输出",},  
    [176] = {10423,180121,0,23000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后可获得橙色品质的时空之力","前排控制",},  
    [177] = {10424,180122,0,24000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后可获得紫色品质的时空之力","前排控制",},  
    [178] = {10425,180123,0,25000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后可获得紫色品质的时空之力","持续回复",},  
    [179] = {10426,180124,0,26000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","持续伤害",},  
    [180] = {10427,180125,0,27000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","持续伤害",},  
    [181] = {10428,180126,0,28000,"镇魂恶灵","被困在镇魂街上的恶灵，灵力不俗","击败后无法获得时空之力","持续回复",},  
    [182] = {10429,180127,0,29000,"恶灵将军","古代将领所化的恶灵，灵力十分强劲","击败后可获得紫色品质的时空之力","列伤输出",},  
    [183] = {10430,180128,0,30000,"地狱恶灵","从地狱逃出的恶灵之王，灵力堪称恐怖","击败后无法获得时空之力","前排控制",},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,  
    [10101] = 56,  
    [10102] = 57,  
    [10103] = 58,  
    [10104] = 59,  
    [10105] = 60,  
    [10106] = 61,  
    [10107] = 62,  
    [10108] = 63,  
    [10109] = 64,  
    [10110] = 65,  
    [10111] = 66,  
    [10112] = 67,  
    [10113] = 68,  
    [10114] = 69,  
    [10115] = 70,  
    [10116] = 71,  
    [10117] = 72,  
    [10118] = 73,  
    [10119] = 74,  
    [10120] = 75,  
    [10121] = 76,  
    [10122] = 77,  
    [10123] = 78,  
    [10124] = 79,  
    [10125] = 80,  
    [10126] = 81,  
    [10127] = 82,  
    [10128] = 83,  
    [10129] = 84,  
    [10130] = 85,  
    [10131] = 86,  
    [10132] = 87,  
    [10201] = 88,  
    [10202] = 89,  
    [10203] = 90,  
    [10204] = 91,  
    [10205] = 92,  
    [10206] = 93,  
    [10207] = 94,  
    [10208] = 95,  
    [10209] = 96,  
    [10210] = 97,  
    [10211] = 98,  
    [10212] = 99,  
    [10213] = 100,  
    [10214] = 101,  
    [10215] = 102,  
    [10216] = 103,  
    [10217] = 104,  
    [10218] = 105,  
    [10219] = 106,  
    [10220] = 107,  
    [10221] = 108,  
    [10222] = 109,  
    [10223] = 110,  
    [10224] = 111,  
    [10225] = 112,  
    [10226] = 113,  
    [10227] = 114,  
    [10228] = 115,  
    [10229] = 116,  
    [10230] = 117,  
    [10231] = 118,  
    [10232] = 119,  
    [10233] = 120,  
    [10234] = 121,  
    [10235] = 122,  
    [10236] = 123,  
    [10237] = 124,  
    [10238] = 125,  
    [10301] = 126,  
    [10302] = 127,  
    [10303] = 128,  
    [10304] = 129,  
    [10305] = 130,  
    [10306] = 131,  
    [10307] = 132,  
    [10308] = 133,  
    [10309] = 134,  
    [10310] = 135,  
    [10311] = 136,  
    [10312] = 137,  
    [10313] = 138,  
    [10314] = 139,  
    [10315] = 140,  
    [10316] = 141,  
    [10317] = 142,  
    [10318] = 143,  
    [10319] = 144,  
    [10320] = 145,  
    [10321] = 146,  
    [10322] = 147,  
    [10323] = 148,  
    [10324] = 149,  
    [10325] = 150,  
    [10326] = 151,  
    [10327] = 152,  
    [10328] = 153,  
    [10401] = 154,  
    [10402] = 155,  
    [10403] = 156,  
    [10404] = 157,  
    [10405] = 158,  
    [10406] = 159,  
    [10407] = 160,  
    [10408] = 161,  
    [10409] = 162,  
    [10410] = 163,  
    [10411] = 164,  
    [10412] = 165,  
    [10413] = 166,  
    [10414] = 167,  
    [10415] = 168,  
    [10416] = 169,  
    [10417] = 170,  
    [10418] = 171,  
    [10419] = 172,  
    [10420] = 173,  
    [10421] = 174,  
    [10422] = 175,  
    [10423] = 176,  
    [10424] = 177,  
    [10425] = 178,  
    [10426] = 179,  
    [10427] = 180,  
    [10428] = 181,  
    [10429] = 182,  
    [10430] = 183,
}

local __key_map = { 
    id = 1,
    monster_team_id = 2,
    power = 3,
    monster_power = 4,
    name = 5,
    monster_des = 6,
    reward_des = 7,
    line = 8,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_spacetime_dungeon_monster_info")

        return t._raw[__key_map[k]]
    end
}


function spacetime_dungeon_monster_info.getLength()
    return #spacetime_dungeon_monster_info._data
end



function spacetime_dungeon_monster_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_spacetime_dungeon_monster_info
function spacetime_dungeon_monster_info.indexOf(index)
    if index == nil or not spacetime_dungeon_monster_info._data[index] then
        return nil
    end
    return setmetatable({_raw = spacetime_dungeon_monster_info._data[index]}, m)
end



---
--@return @class record_spacetime_dungeon_monster_info
function spacetime_dungeon_monster_info.get(id)
    
    return spacetime_dungeon_monster_info.indexOf(__index_id[ id ])
     
end



function spacetime_dungeon_monster_info.set(id, key, value)
    local record = spacetime_dungeon_monster_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function spacetime_dungeon_monster_info.get_index_data()
    return __index_id 
end

return  spacetime_dungeon_monster_info 