---@classdef record_spacetime_dungeon_item_info
local record_spacetime_dungeon_item_info = {}


record_spacetime_dungeon_item_info.id = 0--id
record_spacetime_dungeon_item_info.quality = 0--品质
record_spacetime_dungeon_item_info.name =  ""--道具名字
record_spacetime_dungeon_item_info.description =  ""--道具描述
record_spacetime_dungeon_item_info.passive_skill_id = 0--关联技能
record_spacetime_dungeon_item_info.icon =  ""--道具图标

local spacetime_dungeon_item_info = {
   _data = {   
    [1] = {1,1,"基础攻击","攻击力提升10%",200001,"1007",},  
    [2] = {2,2,"基础攻击","攻击力提升20%",200002,"1007",},  
    [3] = {3,3,"基础攻击","攻击力提升30%",200003,"1007",},  
    [4] = {4,1,"基础防御","防御力提升10%",200004,"1144",},  
    [5] = {5,2,"基础防御","防御力提升20%",200005,"1144",},  
    [6] = {6,3,"基础防御","防御力提升30%",200006,"1144",},  
    [7] = {7,1,"暴击几率","暴击率提升10%",200007,"1050",},  
    [8] = {8,2,"暴击几率","暴击率提升20%",200008,"1050",},  
    [9] = {9,1,"命中几率","命中率提升10%",200009,"1236",},  
    [10] = {10,2,"命中几率","命中率提升20%",200010,"1236",},  
    [11] = {11,1,"抗暴几率","抗暴率提升10%",200011,"1093",},  
    [12] = {12,2,"抗暴几率","抗暴率提升20%",200012,"1093",},  
    [13] = {13,1,"闪避几率","闪避率提升10%",200013,"103",},  
    [14] = {14,2,"闪避几率","闪避率提升20%",200014,"103",},  
    [15] = {15,1,"破击几率","破击率提升10%",200015,"1095",},  
    [16] = {16,2,"破击几率","破击率提升20%",200016,"1095",},  
    [17] = {17,1,"格挡几率","格挡率提升10%",200017,"1160",},  
    [18] = {18,2,"格挡几率","格挡率提升20%",200018,"1160",},  
    [19] = {19,1,"暴击强度","暴击强度提升10%",200019,"1073",},  
    [20] = {20,2,"暴击强度","暴击强度提升20%",200020,"1073",},  
    [21] = {21,1,"暴击减免","暴击减免提升10%",200021,"1115",},  
    [22] = {22,2,"暴击减免","暴击减免提升20%",200022,"1115",},  
    [23] = {23,1,"格挡强度","格挡强度提升10%",200023,"1069",},  
    [24] = {24,2,"格挡强度","格挡强度提升20%",200024,"1069",},  
    [25] = {25,1,"格挡减免","格挡强度减免10%",200025,"1092",},  
    [26] = {26,2,"格挡减免","格挡强度减免20%",200026,"1092",},  
    [27] = {27,1,"伤害加成","伤害增加提升10%",200027,"1214",},  
    [28] = {28,2,"伤害加成","伤害增加提升20%",200028,"1214",},  
    [29] = {29,1,"伤害减免","伤害减免提升10%",200029,"1042",},  
    [30] = {30,2,"伤害减免","伤害减免提升20%",200030,"1042",},  
    [31] = {31,1,"攻无不克","后排攻击力和暴击率提升10%",200031,"1194",},  
    [32] = {32,2,"攻无不克","后排攻击力和暴击率提升20%",200032,"1194",},  
    [33] = {33,1,"战无不胜","后排伤害增加和命中率提升10%",200033,"1193",},  
    [34] = {34,2,"战无不胜","后排伤害增加和命中率提升20%",200034,"1193",},  
    [35] = {35,1,"刀枪不入","前排防御力和抗暴率提升10%",200035,"1238",},  
    [36] = {36,2,"刀枪不入","前排防御力和抗暴率提升20%",200036,"1238",},  
    [37] = {37,1,"身轻如燕","前排伤害减免和闪避率提升10%",200037,"1237",},  
    [38] = {38,2,"身轻如燕","前排伤害减免和闪避率提升20%",200038,"1237",},  
    [39] = {39,1,"济弱扶倾","每回合结束时回复生命最低单位10%生命",200039,"50050",},  
    [40] = {40,2,"济弱扶倾","每回合结束时回复生命最低单位15%生命",200040,"50050",},  
    [41] = {41,3,"济弱扶倾","每回合结束时回复生命最低单位20%生命",200041,"50050",},  
    [42] = {42,1,"震慑八方","开场降低对方全体攻击力10%",200042,"1015",},  
    [43] = {43,2,"震慑八方","开场降低对方全体攻击力20%",200043,"1015",},  
    [44] = {44,3,"震慑八方","开场降低对方全体攻击力30%",200044,"1015",},  
    [45] = {45,1,"先发制人","开场随机眩晕敌方1个单位",200045,"1321",},  
    [46] = {46,2,"先发制人","开场随机眩晕敌方2个单位",200046,"1321",},  
    [47] = {47,3,"先发制人","开场随机眩晕敌方3个单位",200047,"1321",},  
    [48] = {48,4,"先发制人","开场随机眩晕敌方6个单位",200048,"1321",},  
    [49] = {49,3,"目眩神迷","每回合结束时随机眩晕1个敌人",200049,"1044",},  
    [50] = {50,4,"目眩神迷","每回合结束时随机眩晕2个敌人",200050,"1044",},  
    [51] = {51,1,"气涌如山","每回合结束时，随机回复己方1个单位2点怒气",200051,"1072",},  
    [52] = {52,2,"气涌如山","每回合结束时，随机回复己方2个单位2点怒气",200052,"1072",},  
    [53] = {53,3,"气涌如山","每回合结束时，随机回复己方3个单位2点怒气",200053,"1072",},  
    [54] = {54,3,"铁布金钟","开场时我方2个单位无敌1回合",200054,"1071",},  
    [55] = {55,4,"铁布金钟","开场时我方6个单位无敌1回合",200055,"1071",},  
    [56] = {56,2,"生死羁绊","我方每死亡一个单位，全体回复20%最大生命的血量",200056,"1112",},  
    [57] = {57,3,"生死羁绊","我方每死亡一个单位，全体回复40%最大生命的血量",200057,"1112",},  
    [58] = {58,2,"化悲为刃","我方每死亡一个单位，全体攻击力加15%",200058,"1047",},  
    [59] = {59,3,"化悲为刃","我方每死亡一个单位，全体攻击力加30%",200059,"1047",},  
    [60] = {60,2,"以杀止杀","敌方死亡时，回复我方10%生命",200060,"1088",},  
    [61] = {61,3,"以杀止杀","敌方死亡时，回复我方15%生命",200061,"1088",},  
    [62] = {62,4,"以杀止杀","敌方死亡时，回复我方20%生命",200062,"1088",},  
    [63] = {63,2,"承天之祐","当我方全体生命低于50%时，回复全体生命10%",200063,"1111",},  
    [64] = {64,3,"承天之祐","当我方全体生命低于70%时，回复全体生命15%",200064,"1111",},  
    [65] = {65,3,"同仇敌忾","开场己方武将额外获得2点怒气",200065,"1009",},  
    [66] = {66,4,"同仇敌忾","开场己方武将额外获得4点怒气",200066,"1009",},  
    [67] = {67,2,"势如破竹","敌方死亡时，我方攻击力和防御力属性提升10%",200067,"1049",},  
    [68] = {68,2,"背水一战","我方死亡时，我方攻击力和防御力属性提升10%",200068,"1049",},  
    [69] = {69,3,"人面化豕","开场前排单位变猪",200069,"1670",},  
    [70] = {70,4,"人面化豕","开场6个单位变猪",200070,"1670",},  
    [71] = {71,4,"如沐春风","己方单位第一次被控制时，全体净化并回复生命最低单位30%生命",200071,"1163",},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [22] = 22,  
    [23] = 23,  
    [24] = 24,  
    [25] = 25,  
    [26] = 26,  
    [27] = 27,  
    [28] = 28,  
    [29] = 29,  
    [30] = 30,  
    [31] = 31,  
    [32] = 32,  
    [33] = 33,  
    [34] = 34,  
    [35] = 35,  
    [36] = 36,  
    [37] = 37,  
    [38] = 38,  
    [39] = 39,  
    [40] = 40,  
    [41] = 41,  
    [42] = 42,  
    [43] = 43,  
    [44] = 44,  
    [45] = 45,  
    [46] = 46,  
    [47] = 47,  
    [48] = 48,  
    [49] = 49,  
    [50] = 50,  
    [51] = 51,  
    [52] = 52,  
    [53] = 53,  
    [54] = 54,  
    [55] = 55,  
    [56] = 56,  
    [57] = 57,  
    [58] = 58,  
    [59] = 59,  
    [60] = 60,  
    [61] = 61,  
    [62] = 62,  
    [63] = 63,  
    [64] = 64,  
    [65] = 65,  
    [66] = 66,  
    [67] = 67,  
    [68] = 68,  
    [69] = 69,  
    [70] = 70,  
    [71] = 71,
}

local __key_map = { 
    id = 1,
    quality = 2,
    name = 3,
    description = 4,
    passive_skill_id = 5,
    icon = 6,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_spacetime_dungeon_item_info")

        return t._raw[__key_map[k]]
    end
}


function spacetime_dungeon_item_info.getLength()
    return #spacetime_dungeon_item_info._data
end



function spacetime_dungeon_item_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_spacetime_dungeon_item_info
function spacetime_dungeon_item_info.indexOf(index)
    if index == nil or not spacetime_dungeon_item_info._data[index] then
        return nil
    end
    return setmetatable({_raw = spacetime_dungeon_item_info._data[index]}, m)
end



---
--@return @class record_spacetime_dungeon_item_info
function spacetime_dungeon_item_info.get(id)
    
    return spacetime_dungeon_item_info.indexOf(__index_id[ id ])
     
end



function spacetime_dungeon_item_info.set(id, key, value)
    local record = spacetime_dungeon_item_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function spacetime_dungeon_item_info.get_index_data()
    return __index_id 
end

return  spacetime_dungeon_item_info 