---@classdef record_storm_skill_info
local record_storm_skill_info = {}


record_storm_skill_info.id = 0--ID
record_storm_skill_info.level = 0--等级
record_storm_skill_info.name =  ""--技能名称
record_storm_skill_info.order1 = 0--显示顺序1
record_storm_skill_info.order2 = 0--显示顺序2
record_storm_skill_info.icon = 0--技能图标
record_storm_skill_info.talent_id = 0--关城技能
record_storm_skill_info.cost = 0--扣除技能点
record_storm_skill_info.preset_skill_1 = 0--前置技能1
record_storm_skill_info.preset_skill_level_1 = 0--前置技能1等级
record_storm_skill_info.preset_skill_2 = 0--前置技能2
record_storm_skill_info.preset_skill_level_2 = 0--前置技能2等级
record_storm_skill_info.preset_skill_3 = 0--前置技能3
record_storm_skill_info.preset_skill_level_3 = 0--前置技能3等级
record_storm_skill_info.preset_skill_4 = 0--前置技能4
record_storm_skill_info.preset_skill_level_4 = 0--前置技能等级4
record_storm_skill_info.preset_skill_level_sum = 0--前置技能等级之和

local storm_skill_info = {
   _data = {   
    [1] = {1,0,"全体防御",1,1,3,130011,1,0,0,0,0,0,0,0,0,0,},  
    [2] = {1,1,"全体防御",1,1,3,130011,2,0,0,0,0,0,0,0,0,0,},  
    [3] = {1,2,"全体防御",1,1,3,130012,3,0,0,0,0,0,0,0,0,0,},  
    [4] = {1,3,"全体防御",1,1,3,130013,5,0,0,0,0,0,0,0,0,0,},  
    [5] = {1,4,"全体防御",1,1,3,130014,8,0,0,0,0,0,0,0,0,0,},  
    [6] = {1,5,"全体防御",1,1,3,130015,0,0,0,0,0,0,0,0,0,0,},  
    [7] = {2,0,"全体生命",1,2,1,130021,1,0,0,0,0,0,0,0,0,0,},  
    [8] = {2,1,"全体生命",1,2,1,130021,2,0,0,0,0,0,0,0,0,0,},  
    [9] = {2,2,"全体生命",1,2,1,130022,3,0,0,0,0,0,0,0,0,0,},  
    [10] = {2,3,"全体生命",1,2,1,130023,5,0,0,0,0,0,0,0,0,0,},  
    [11] = {2,4,"全体生命",1,2,1,130024,8,0,0,0,0,0,0,0,0,0,},  
    [12] = {2,5,"全体生命",1,2,1,130025,0,0,0,0,0,0,0,0,0,0,},  
    [13] = {3,0,"全体攻击",1,3,2,130031,1,0,0,0,0,0,0,0,0,0,},  
    [14] = {3,1,"全体攻击",1,3,2,130031,2,0,0,0,0,0,0,0,0,0,},  
    [15] = {3,2,"全体攻击",1,3,2,130032,3,0,0,0,0,0,0,0,0,0,},  
    [16] = {3,3,"全体攻击",1,3,2,130033,5,0,0,0,0,0,0,0,0,0,},  
    [17] = {3,4,"全体攻击",1,3,2,130034,8,0,0,0,0,0,0,0,0,0,},  
    [18] = {3,5,"全体攻击",1,3,2,130035,0,0,0,0,0,0,0,0,0,0,},  
    [19] = {4,0,"全体抗暴",2,1,7,130041,2,1,3,0,0,0,0,0,0,1,},  
    [20] = {4,1,"全体抗暴",2,1,7,130041,3,1,3,0,0,0,0,0,0,1,},  
    [21] = {4,2,"全体抗暴",2,1,7,130042,5,1,3,0,0,0,0,0,0,1,},  
    [22] = {4,3,"全体抗暴",2,1,7,130043,7,1,3,0,0,0,0,0,0,1,},  
    [23] = {4,4,"全体抗暴",2,1,7,130044,10,1,3,0,0,0,0,0,0,1,},  
    [24] = {4,5,"全体抗暴",2,1,7,130045,0,1,3,0,0,0,0,0,0,1,},  
    [25] = {5,0,"全体格挡",2,2,8,130051,2,1,3,2,3,0,0,0,0,2,},  
    [26] = {5,1,"全体格挡",2,2,8,130051,3,1,3,2,3,0,0,0,0,2,},  
    [27] = {5,2,"全体格挡",2,2,8,130052,5,1,3,2,3,0,0,0,0,2,},  
    [28] = {5,3,"全体格挡",2,2,8,130053,7,1,3,2,3,0,0,0,0,2,},  
    [29] = {5,4,"全体格挡",2,2,8,130054,10,1,3,2,3,0,0,0,0,2,},  
    [30] = {5,5,"全体格挡",2,2,8,130055,0,1,3,2,3,0,0,0,0,2,},  
    [31] = {6,0,"全体暴击",2,3,6,130061,2,2,3,3,3,0,0,0,0,0,},  
    [32] = {6,1,"全体暴击",2,3,6,130061,3,2,3,3,3,0,0,0,0,0,},  
    [33] = {6,2,"全体暴击",2,3,6,130062,5,2,3,3,3,0,0,0,0,0,},  
    [34] = {6,3,"全体暴击",2,3,6,130063,7,2,3,3,3,0,0,0,0,0,},  
    [35] = {6,4,"全体暴击",2,3,6,130064,10,2,3,3,3,0,0,0,0,0,},  
    [36] = {6,5,"全体暴击",2,3,6,130065,0,2,3,3,3,0,0,0,0,0,},  
    [37] = {7,0,"全体破击",2,4,9,130071,2,3,3,0,0,0,0,0,0,0,},  
    [38] = {7,1,"全体破击",2,4,9,130071,3,3,3,0,0,0,0,0,0,0,},  
    [39] = {7,2,"全体破击",2,4,9,130072,5,3,3,0,0,0,0,0,0,0,},  
    [40] = {7,3,"全体破击",2,4,9,130073,7,3,3,0,0,0,0,0,0,0,},  
    [41] = {7,4,"全体破击",2,4,9,130074,10,3,3,0,0,0,0,0,0,0,},  
    [42] = {7,5,"全体破击",2,4,9,130075,0,3,3,0,0,0,0,0,0,0,},  
    [43] = {8,0,"全体免伤",3,1,15,130081,3,4,2,5,2,6,2,7,2,4,},  
    [44] = {8,1,"全体免伤",3,1,15,130081,4,4,2,5,2,6,2,7,2,4,},  
    [45] = {8,2,"全体免伤",3,1,15,130082,5,4,2,5,2,6,2,7,2,4,},  
    [46] = {8,3,"全体免伤",3,1,15,130083,7,4,2,5,2,6,2,7,2,4,},  
    [47] = {8,4,"全体免伤",3,1,15,130084,10,4,2,5,2,6,2,7,2,0,},  
    [48] = {8,5,"全体免伤",3,1,15,130085,0,4,2,5,2,6,2,7,2,0,},  
    [49] = {9,0,"全体灭蜀",4,1,202,130091,4,8,3,0,0,0,0,0,0,0,},  
    [50] = {9,1,"全体灭蜀",4,1,202,130091,5,8,3,0,0,0,0,0,0,0,},  
    [51] = {9,2,"全体灭蜀",4,1,202,130092,7,8,3,0,0,0,0,0,0,0,},  
    [52] = {9,3,"全体灭蜀",4,1,202,130093,0,8,3,0,0,0,0,0,0,0,},  
    [53] = {10,0,"全体灭魏",4,2,201,130103,4,8,3,0,0,0,0,0,0,0,},  
    [54] = {10,1,"全体灭魏",4,2,201,130103,5,8,3,0,0,0,0,0,0,0,},  
    [55] = {10,2,"全体灭魏",4,2,201,130105,7,8,3,0,0,0,0,0,0,0,},  
    [56] = {10,3,"全体灭魏",4,2,201,130107,0,8,3,0,0,0,0,0,0,0,},  
    [57] = {11,0,"全体灭吴",4,3,203,130117,4,8,3,0,0,0,0,0,0,0,},  
    [58] = {11,1,"全体灭吴",4,3,203,130117,5,8,3,0,0,0,0,0,0,0,},  
    [59] = {11,2,"全体灭吴",4,3,203,130119,7,8,3,0,0,0,0,0,0,0,},  
    [60] = {11,3,"全体灭吴",4,3,203,130121,0,8,3,0,0,0,0,0,0,0,},  
    [61] = {12,0,"全体灭群",4,4,204,130131,4,8,3,0,0,0,0,0,0,0,},  
    [62] = {12,1,"全体灭群",4,4,204,130131,5,8,3,0,0,0,0,0,0,0,},  
    [63] = {12,2,"全体灭群",4,4,204,130133,7,8,3,0,0,0,0,0,0,0,},  
    [64] = {12,3,"全体灭群",4,4,204,130135,0,8,3,0,0,0,0,0,0,0,},
    }
}

local __index_id_level = {   
    ["1_0"] = 1,  
    ["1_1"] = 2,  
    ["1_2"] = 3,  
    ["1_3"] = 4,  
    ["1_4"] = 5,  
    ["1_5"] = 6,  
    ["2_0"] = 7,  
    ["2_1"] = 8,  
    ["2_2"] = 9,  
    ["2_3"] = 10,  
    ["2_4"] = 11,  
    ["2_5"] = 12,  
    ["3_0"] = 13,  
    ["3_1"] = 14,  
    ["3_2"] = 15,  
    ["3_3"] = 16,  
    ["3_4"] = 17,  
    ["3_5"] = 18,  
    ["4_0"] = 19,  
    ["4_1"] = 20,  
    ["4_2"] = 21,  
    ["4_3"] = 22,  
    ["4_4"] = 23,  
    ["4_5"] = 24,  
    ["5_0"] = 25,  
    ["5_1"] = 26,  
    ["5_2"] = 27,  
    ["5_3"] = 28,  
    ["5_4"] = 29,  
    ["5_5"] = 30,  
    ["6_0"] = 31,  
    ["6_1"] = 32,  
    ["6_2"] = 33,  
    ["6_3"] = 34,  
    ["6_4"] = 35,  
    ["6_5"] = 36,  
    ["7_0"] = 37,  
    ["7_1"] = 38,  
    ["7_2"] = 39,  
    ["7_3"] = 40,  
    ["7_4"] = 41,  
    ["7_5"] = 42,  
    ["8_0"] = 43,  
    ["8_1"] = 44,  
    ["8_2"] = 45,  
    ["8_3"] = 46,  
    ["8_4"] = 47,  
    ["8_5"] = 48,  
    ["9_0"] = 49,  
    ["9_1"] = 50,  
    ["9_2"] = 51,  
    ["9_3"] = 52,  
    ["10_0"] = 53,  
    ["10_1"] = 54,  
    ["10_2"] = 55,  
    ["10_3"] = 56,  
    ["11_0"] = 57,  
    ["11_1"] = 58,  
    ["11_2"] = 59,  
    ["11_3"] = 60,  
    ["12_0"] = 61,  
    ["12_1"] = 62,  
    ["12_2"] = 63,  
    ["12_3"] = 64,
}

local __key_map = { 
    id = 1,
    level = 2,
    name = 3,
    order1 = 4,
    order2 = 5,
    icon = 6,
    talent_id = 7,
    cost = 8,
    preset_skill_1 = 9,
    preset_skill_level_1 = 10,
    preset_skill_2 = 11,
    preset_skill_level_2 = 12,
    preset_skill_3 = 13,
    preset_skill_level_3 = 14,
    preset_skill_4 = 15,
    preset_skill_level_4 = 16,
    preset_skill_level_sum = 17,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_storm_skill_info")

        return t._raw[__key_map[k]]
    end
}


function storm_skill_info.getLength()
    return #storm_skill_info._data
end



function storm_skill_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_storm_skill_info
function storm_skill_info.indexOf(index)
    if index == nil or not storm_skill_info._data[index] then
        return nil
    end
    return setmetatable({_raw = storm_skill_info._data[index]}, m)
end



---
--@return @class record_storm_skill_info
function storm_skill_info.get(id,level)
    
    local k = id .. '_' .. level
    return storm_skill_info.indexOf(__index_id_level[k])
     
end



function storm_skill_info.set(id,level, key, value)
    local record = storm_skill_info.get(id,level)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function storm_skill_info.get_index_data()
    return __index_id_level 
end

return  storm_skill_info 