---@classdef record_strong_way_info
local record_strong_way_info = {}


record_strong_way_info.id = 0--ID
record_strong_way_info.function_id = 0--功能id
record_strong_way_info.type = 0--类型
record_strong_way_info.icon =  ""--icon
record_strong_way_info.name =  ""--名称
record_strong_way_info.txt =  ""--描述文字
record_strong_way_info.use_txt =  ""--用途描述
record_strong_way_info.star = 0--星级
record_strong_way_info.order = 0--排序
record_strong_way_info.route = 0--跳转
record_strong_way_info.source_type = 0--资源类型
record_strong_way_info.source_value = 0--资源类型值
record_strong_way_info.knight_1 = 0--推荐武将1
record_strong_way_info.knight_2 = 0--推荐武将2
record_strong_way_info.knight_3 = 0--推荐武将3
record_strong_way_info.knight_4 = 0--推荐武将4
record_strong_way_info.knight_5 = 0--推荐武将5
record_strong_way_info.knight_6 = 0--推荐武将6
record_strong_way_info.group =  ""--所属阵营
record_strong_way_info.group_name =  ""--阵容名称
record_strong_way_info.group_trait =  ""--阵容特点
record_strong_way_info.group_way =  ""--布阵思路
record_strong_way_info.group_knight =  ""--武将分析

local strong_way_info = {
   _data = {   
    [1] = {1,1001,1,"icon/item/12.png","主角升级","消耗体力可提升主角等级，主角等级不但决定了其他养成的等级上限，而且还关联着很多功能的开启！","无",5,1,115,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [2] = {2,1001,1,"icon/item/63.png","武将升级","消耗经验书可提升武将等级，提升等级可获得基础属性。","无",2,2,21,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [3] = {3,1002,1,"icon/item/25.png","武将升星","消耗同名武将碎片（或武将万能碎片），可提升武将星级，提升武将的技能伤害系数和技能效果并获得天赋加成。","无",5,3,21,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [4] = {4,1003,1,"icon/item/11.png","武将进阶","消耗进阶材料，可增加武将初始怒气以及大量基础属性和高级属性。","无",4,4,21,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [5] = {5,1004,1,"icon/item/22.png","武将培养","消耗培养丹，提升大量基础属性，激活将星可获得基础属性百分比加成。","无",3,5,21,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [6] = {6,1006,1,"icon/item/34.png","武将图鉴","拥有武将即可激活对应图鉴，提升武将星级可消耗图鉴升级石升级图鉴，图鉴值达到所需值可获得大量属性。","无",5,6,62,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [7] = {7,1101,1,"icon/item/19.png","兵符升级","消耗兵符精华强化兵符，可获得全体基础属性，消耗兵符铸造石阶段性提升可获得大量全体基础属性","无",3,7,27,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [8] = {8,1102,1,"icon/item/28.png","兵符升星","消耗同名兵符碎片（或兵符万能碎片）可提升对应兵符的技能效果以及获得大量全体基础属性","无",5,8,27,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [9] = {9,1103,1,"icon/function/icon_heji1.png","兵符觉醒","拥有兵符对应的合击武将可觉醒兵符，获得兵符的合击技能并获得大量全体基础属性","无",5,9,27,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [10] = {10,1201,1,"icon/function/icon_zhuangbei.png","装备强化","消耗银币，可获得基础属性，全身装备强化至一定等级可获得强化大师效果：增加基础属性","无",3,10,23,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [11] = {11,1202,1,"icon/item/18.png","装备精炼","消耗装备精炼石，获得基础属性和基础属性百分比加成，全身装备精炼至一定等级可获得强化大师效果。","无",4,11,23,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [12] = {12,1204,1,"icon/glyph_suit/12.png","装备雕纹","消耗装备雕纹石，获得基础属性，武将穿戴一定数量的雕纹装备可激活装备雕纹套装效果。","无",5,12,23,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [13] = {13,1401,1,"icon/function/icon_baowu.png","宝物强化","消耗经验宝物，可获得基础属性和高级属性，全身宝物强化至一定等级可额外增加基础属性","无",3,13,25,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [14] = {14,1402,1,"icon/item/37.png","宝物精炼","消耗宝物精炼石和同名宝物，可获得大量基础属性和高级属性，全身宝物精炼至一定等级可额外增加基础属性","无",4,14,25,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [15] = {15,1404,1,"icon/glyph_suit/16.png","宝物雕纹","消耗宝物雕纹石，获得基础属性，武将穿戴两件雕纹宝物可激活宝物雕纹套装效果。","无",5,15,25,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [16] = {16,1600,1,"icon/function/icon_chenghao.png","称号系统","首次激活称号可获得称号的激活属性，佩戴称号可获得所佩戴称号的佩戴属性","无",3,16,42,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [17] = {17,1701,1,"icon/item/38.png","时装强化","改变主角技能效果并获得全体基础属性","无",4,17,41,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [18] = {18,1901,1,"icon/item/56.png","神兵强化","消耗神兵锻造石，可获得基础属性：增加基础属性","无",3,18,163,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [19] = {19,1902,1,"icon/function/icon_hd_sq1.png","神兵升星","消耗同名神兵碎片，可提升神兵星级，提升神兵基础属性和技能效果，并获得新的天赋","无",4,19,163,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [20] = {20,2201,1,"icon/function/icon_shenshou.png","神兽升级","消耗灵兽丹，可获得基础属性：增加基础属性","无",1,20,205,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [21] = {21,2202,1,"icon/function/icon_shenshou.png","神兽升星","消耗同名神兽，可提升神兽星级，提升神兽基础属性和技能效果，并获得新的天赋","无",1,21,205,0,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [22] = {1001,0,2,"icon/item/10000.png","元宝","元宝，通用的流通货币，可用于购买各种资源，充值和玩法内可获得。","主要用途：招将、商城购买、商店购买",0,1,0,999,0,0,0,0,0,0,0,"0","0","0","0","0",},  
    [23] = {1002,0,2,"icon/item/10003.png","银币","银币，通用的资源，用于各种养成中的基础消耗资源，商城内可购买。","主要用途：养成消耗",0,2,0,1,3,0,0,0,0,0,0,"0","0","0","0","0",},  
    [24] = {1003,0,2,"icon/item/10018.png","将魂","将魂，珍贵的货币资源，用于将魂商店中购买武将和兵符等珍贵资源，神将列传-传记和招将可获得。","主要用途：将魂商店",0,3,0,1,16,0,0,0,0,0,0,"0","0","0","0","0",},  
    [25] = {1004,0,2,"icon/item/10006.png","威名","威名，无双试炼玩法货币，用于神装商店中购买装备等资源，无双试炼和分解装备可获得。","主要用途：神装商店",0,10,0,1,6,0,0,0,0,0,0,"0","0","0","0","0",},  
    [26] = {1005,0,2,"icon/item/10008.png","声望","声望，竞技场玩法货币，用于竞技场商店中购买武将碎片和培养丹等资源，竞技场可获得。","主要用途：竞技场商店",0,11,0,1,8,0,0,0,0,0,0,"0","0","0","0","0",},  
    [27] = {1006,0,2,"icon/item/10020.png","灵玉","灵玉，秘境寻宝玩法货币，用于宝物商店中购买武将碎片和宝物养成资源，寻宝可获得。","主要用途：宝物商店",0,12,0,1,10,0,0,0,0,0,0,"0","0","0","0","0",},  
    [28] = {1007,0,2,"icon/item/10017.png","战功","战功，讨伐巨兽玩法货币，用于巨兽商店中购买兵符碎片和兵符养成资源，讨伐巨兽可获得。","主要用途：巨兽商店",0,13,0,1,13,0,0,0,0,0,0,"0","0","0","0","0",},  
    [29] = {1008,0,2,"icon/item/10011.png","军团贡献","军团贡献，军团系统货币，用于军团商店中购买武将碎片和时装等资源，军团内玩法可获得。","主要用途：军团商店",0,14,0,1,11,0,0,0,0,0,0,"0","0","0","0","0",},  
    [30] = {1009,0,2,"icon/item/10005.png","进阶材料魂","进阶材料魂，用于购买武将进阶材料，进阶武将，活动内可获得。","主要用途：购买进阶材料",0,15,0,1,17,0,0,0,0,0,0,"0","0","0","0","0",},  
    [31] = {1010,0,2,"icon/function/icon_wjiang1.png","武将","武将，可上阵进行战斗且进行武将养成，提升武将属性，招将可获得。","主要用途：战斗",0,4,0,1,2002,0,0,0,0,0,0,"0","0","0","0","0",},  
    [32] = {1011,0,2,"icon/function/icon_heji1.png","合击兵符","合击兵符，觉醒后可上阵释放援助合击，兵符养成可提升全体属性，将魂商店可购买获得。","主要用途：释放合击",0,5,0,1,2003,0,0,0,0,0,0,"0","0","0","0","0",},  
    [33] = {1012,0,2,"icon/function/icon_zhuangbei.png","装备","装备，用于上阵武将穿戴和装备养成，增加武将属性，无双试炼可获得。","主要用途：增加武将属性",0,6,0,1,2004,0,0,0,0,0,0,"0","0","0","0","0",},  
    [34] = {1013,0,2,"icon/function/icon_baowu.png","宝物","宝物，用于上阵武将穿戴和宝物养成，增加武将属性，秘境寻宝可获得。","主要用途：增加武将属性",0,7,0,1,2005,0,0,0,0,0,0,"0","0","0","0","0",},  
    [35] = {1014,0,2,"icon/function/icon_chenghao.png","称号","称号，用于主角穿戴，激活和穿戴可增加全体武将属性，军团红包、成就和贵族礼包可获得。","主要用途：增加全体武将属性",0,8,0,1,2006,0,0,0,0,0,0,"0","0","0","0","0",},  
    [36] = {1015,0,2,"icon/function/icon_hongbao.png","红包","军团红包，可发放给军团成员领取，获得元宝、银币等资源，军团商店和无双试炼排行奖励中获得。","主要用途：发放红包",0,16,0,1,2007,0,0,0,0,0,0,"0","0","0","0","0",},  
    [37] = {1016,0,2,"icon/function/icon_shizhuang.png","时装","时装，用于主角穿戴和强化，可改变主角形象和主角技能，增加全体属性，军团商店和活动中可获得","主要用途：改变主角形象和技能",0,9,0,1,2008,0,0,0,0,0,0,"0","0","0","0","0",},  
    [38] = {1017,0,2,"icon/item/10031.png","神兵精魄","神兵精魄，珍贵的货币资源，用于神兵商店中购买神兵锻造石和神兵碎片等珍贵资源，神兵宝库可获得。","主要用途：神兵商店",0,17,0,1,28,0,0,0,0,0,0,"0","0","0","0","0",},  
    [39] = {2001,0,3,"tj_wei","魏国","减怒控制，削减免伤","无",0,1,0,0,0,500020,500040,500030,500050,500060,210000,"魏","减怒控制流","减怒可以让对面的输出瞬间哑火，取得巨大的先手优势。\n降低对面的伤害免疫，使敌人脆皮如纸，配合高输出，秒杀敌将。","先手位布置减怒和控制英雄，控制对手，保护己方武将输出。\n使用削减免伤的英雄削弱敌方防护，使输出位的伤害可以最大化。","一号位：张辽前排减怒的同时还能削减伤害免疫\n二号位：夏侯惇控制一列，伤害可观，使对手迅速残血\n三号位：许褚技能高暴击、高命中且无视防御，具有强大的单点秒杀能力。\n四号位：夏侯渊攻击后排，作用与张辽类似，使敌方后排失去威胁。\n五号位：张郃技能提升暴击率，范围攻击收割敌方残血。",},  
    [40] = {2002,0,3,"tj_shu","蜀国","回复怒气，持续输出","无",0,2,0,0,0,500100,510040,500120,500090,500080,210000,"蜀","回怒技能流","释放技能时，有额外的怒气回复。技能爆发源源不断，永动机直接推平敌方。","先手位置以控制为主，同时限制敌方回复。\n依靠快速的怒气回复，击溃敌方阵容。","一号位：魏延控制前排，同时降低敌方回复。\n二号位：赵云技能高额的怒气回复，放到二号位可以更快的打出第二套技能。\n三号位：姜维具有较高的单体伤害，打残敌方。\n四号位：黄忠降低敌方怒气和各种增益，营造输出环境。\n五号位：张飞高暴击、高爆伤，做为输出核心，与赵云配置能迅速击杀对手一列。",},  
    [41] = {2003,0,3,"tj_wu","吴国","后排灼烧，残血秒杀","无",0,3,0,0,0,500140,500150,210000,500170,500180,500160,"吴","灼烧收割流","灼烧效果使敌方每回合不断扣血，精准蚕食躲在后排的武将。\n搭配收割武将，残血一套带走。","先手控制延缓敌方的爆发，延长回合数，增加灼烧回合。\n带有灼烧和收割特性的武将放到后排，增加存活时间。","一号位：孙权技能大概率的控制敌方单体，同时伤害可观，使对方残血。\n二号位：孙坚降低一列怒气，同时配合队友后排灼烧，更快击杀对方五号位。\n四号位：太史慈攻击敌方后排，造成灼伤，蚕食敌方后排。\n五号位：鲁肃带有灼烧，同时减怒也可以更好的限制敌方输出。\n六号位：吕蒙做为东吴杀手，配合队友，收割敌方残血。",},  
    [42] = {2004,0,3,"tj_qun","群雄","集火前排，暴击输出","无",0,4,0,0,0,500200,500220,500240,500210,500230,210000,"群","暴击秒杀流","群雄武将恐怖的攻击范围和极高的暴击使得他们能快速击杀敌方前排。\n阵容中搭配一些降低敌方抗暴率的武将，真正的一刀秒杀。","暴击爆发是群雄的核心，优先将高输出武将布置在前排，快速使敌方减员。\n配合一定的持续输出和控制，结束残局。","一号位：袁绍本身具有高额的暴击率，同时为队友提供攻击加成。\n二号位：华雄控制敌方前排，在攻击加成下进一步摧残敌方阵容。\n三号位：公孙瓒高爆发、高命中，同时自带额外伤害，快速击杀敌方三号位。\n四号位：于吉降低敌方抗暴率，辅助队友，同时毒伤补足阵容的持续伤害能力\n五号位：董卓减少敌方怒气，同时增加自身格挡，在残局中能肉能控能打。",},
    }
}

local __index_id = {   
    [1] = 1,  
    [2] = 2,  
    [3] = 3,  
    [4] = 4,  
    [5] = 5,  
    [6] = 6,  
    [7] = 7,  
    [8] = 8,  
    [9] = 9,  
    [10] = 10,  
    [11] = 11,  
    [12] = 12,  
    [13] = 13,  
    [14] = 14,  
    [15] = 15,  
    [16] = 16,  
    [17] = 17,  
    [18] = 18,  
    [19] = 19,  
    [20] = 20,  
    [21] = 21,  
    [1001] = 22,  
    [1002] = 23,  
    [1003] = 24,  
    [1004] = 25,  
    [1005] = 26,  
    [1006] = 27,  
    [1007] = 28,  
    [1008] = 29,  
    [1009] = 30,  
    [1010] = 31,  
    [1011] = 32,  
    [1012] = 33,  
    [1013] = 34,  
    [1014] = 35,  
    [1015] = 36,  
    [1016] = 37,  
    [1017] = 38,  
    [2001] = 39,  
    [2002] = 40,  
    [2003] = 41,  
    [2004] = 42,
}

local __key_map = { 
    id = 1,
    function_id = 2,
    type = 3,
    icon = 4,
    name = 5,
    txt = 6,
    use_txt = 7,
    star = 8,
    order = 9,
    route = 10,
    source_type = 11,
    source_value = 12,
    knight_1 = 13,
    knight_2 = 14,
    knight_3 = 15,
    knight_4 = 16,
    knight_5 = 17,
    knight_6 = 18,
    group = 19,
    group_name = 20,
    group_trait = 21,
    group_way = 22,
    group_knight = 23,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_strong_way_info")

        return t._raw[__key_map[k]]
    end
}


function strong_way_info.getLength()
    return #strong_way_info._data
end



function strong_way_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_strong_way_info
function strong_way_info.indexOf(index)
    if index == nil or not strong_way_info._data[index] then
        return nil
    end
    return setmetatable({_raw = strong_way_info._data[index]}, m)
end



---
--@return @class record_strong_way_info
function strong_way_info.get(id)
    
    return strong_way_info.indexOf(__index_id[ id ])
     
end



function strong_way_info.set(id, key, value)
    local record = strong_way_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function strong_way_info.get_index_data()
    return __index_id 
end

return  strong_way_info 