---@classdef record_title_info
local record_title_info = {}


record_title_info.id = 0--编号
record_title_info.name =  ""--名称
record_title_info.seen_icon = 0--称号图标
record_title_info.description =  ""--描述
record_title_info.title_desc =  ""--称号描述
record_title_info.put = 0--投放
record_title_info.quality = 0--品质
record_title_info.rare = 0--稀有
record_title_info.title_type = 0--称号类型
record_title_info.title_tab = 0--二级分组
record_title_info.tab_name =  ""--页签名称
record_title_info.activate_talent = 0--激活天赋
record_title_info.wear_talent = 0--佩戴天赋
record_title_info.time_type = 0--称号时效类型
record_title_info.time_value = 0--称号时效
record_title_info.item_icon = 0--称号图标
record_title_info.sort = 0--排序值
record_title_info.remind_size = 0--GM后台数量提示
record_title_info.op_game_id = 0--可见运营平台
record_title_info.game_type = 0--显示包体

local title_info = {
   _data = {   
    [1] = {38,"世家子弟",101,"贵族2礼包购买","世家大多传承已久，颇具实力。世家的子弟天生就是贵族，与众不同，遗世独立。",1,4,0,2,0,"0",100001,100013,1,0,11006,102,2,0,0,},  
    [2] = {39,"名门望族",102,"贵族7礼包购买","名门望族，声名赫赫，其身份就足以名满天下。名门之后，六艺精通，皆是人中龙凤。",1,5,0,2,0,"0",100002,100013,1,0,11007,102,2,0,0,},  
    [3] = {40,"皇室贵胄",103,"贵族9礼包购买","皇室贵胄是皇家之后，拥有天下最尊贵的血脉，所到之处，无不万人敬仰。相传皇室贵胄中的一小部分能感受时空之力，可以闪回一些未来的片段。",1,6,0,2,0,"0",100003,100013,1,0,11008,102,2,0,0,},  
    [4] = {41,"天命之子",104,"贵族14礼包购买","百年间必有天命之子出世，天命之子身负天地气运，注定留名青史，传诵百年。相传天命之子掌握时空之力，因为可以左右时代，推动历史前行。",1,7,0,2,0,"0",100004,100013,1,0,11009,102,2,0,0,},  
    [5] = {42,"一掷千金",201,"暂未投放","暂未投放",0,4,0,1,0,"0",100013,100013,1,0,11006,103,2,0,0,},  
    [6] = {43,"乐善好施",202,"暂未投放","暂未投放",0,5,0,1,0,"0",100013,100013,1,0,11007,103,2,0,0,},  
    [7] = {44,"博施济众",203,"暂未投放","暂未投放",0,6,0,1,0,"0",100013,100013,1,0,11008,103,2,0,0,},  
    [8] = {45,"兼济天下",204,"暂未投放","暂未投放",0,7,0,1,0,"0",100013,100013,1,0,11009,103,2,0,0,},  
    [9] = {46,"少年得志",301,"暂未投放","暂未投放",0,4,0,1,0,"0",100013,100013,1,0,11006,104,2,0,0,},  
    [10] = {47,"中流砥柱",302,"暂未投放","暂未投放",0,5,0,1,0,"0",100013,100013,1,0,11007,104,2,0,0,},  
    [11] = {48,"运筹帷幄",303,"暂未投放","暂未投放",0,6,0,1,0,"0",100013,100013,1,0,11008,104,2,0,0,},  
    [12] = {49,"功成名就",304,"暂未投放","暂未投放",0,7,0,1,0,"0",100013,100013,1,0,11009,104,2,0,0,},  
    [13] = {50,"骁骑之团",401,"攻城略地占领普通郡城","攻城略地中骁勇善战的军团被冠以骁骑之名，他们团结一致，奋勇争先。",1,3,0,1,101,"攻城略地",100025,100013,2,604800,11005,108,2,0,0,},  
    [14] = {51,"虎狼之旅",402,"攻城略地占领丰产郡城","攻城略地中作战勇猛，闻者色变的军团被冠以虎狼之旅的称号，正如他们的名字一样，对手就像碰到猛兽一样丧胆。",1,4,0,1,101,"攻城略地",100026,100013,2,604800,11006,107,2,0,0,},  
    [15] = {52,"百战之师",403,"攻城略地占领普通州城","攻城略地中百战百胜，无往不利的军团被冠以百战之师的称号，他们身经百战，横扫沙场，不愧此名。",1,5,0,1,101,"攻城略地",100027,100013,2,604800,11007,106,2,0,0,},  
    [16] = {53,"王者之军",404,"攻城略地占领丰产州城","攻城略地中真正的王者军团才能获得的称号，他们携王者之气，荡平四方。天下闻王者之名而伏首。",1,6,0,1,101,"攻城略地",100028,100013,2,604800,11008,105,2,0,0,},  
    [17] = {54,"一方诸侯",405,"城池争霸宏图霸业获取","乱世争霸，总有英雄脱颖而出，称雄一方。",1,6,0,1,102,"城池争霸",102001,100013,1,0,11008,101,2,0,0,},  
    [18] = {55,"四海霸王",406,"城池争霸宏图霸业获取","以霸道君临四海，以王道令天下臣服。",1,7,0,1,102,"城池争霸",102002,100013,1,0,11009,101,2,0,0,},  
    [19] = {56,"富甲天下",105,"通过活动获得","腰缠万贯，富甲天下！",1,6,0,3,301,"福利赠送",101010,100013,1,0,11009,101,2,0,0,},  
    [20] = {57,"新年气象",408,"通过元旦活动获得","新年新气象，祝各位少年新的一年万事如意，一帆风顺！",1,5,0,3,302,"节日活动",101011,100013,1,0,11007,103,2,0,0,},  
    [21] = {58,"玉鼠迎春",409,"通过玉鼠迎春活动获得","玉鼠迎春之际，恭祝各位少年一帆风顺，万事如意，鼠年大吉！",1,6,0,3,302,"节日活动",101014,100013,1,0,11008,104,2,0,0,},  
    [22] = {59,"新春福到",410,"通过玉鼠迎春活动获得","新春迎福，福到家门，恭祝各位少年春节快乐，平安幸福！",1,5,0,3,302,"节日活动",101015,100013,1,0,11007,104,2,0,0,},  
    [23] = {60,"天若有情",411,"通过情定今生活动获得","天若有情，定不负世间有情人。情意是琴瑟在御，莫不静好的恬静；情意是执子之手，与子偕老的愿景；情意是山无棱天地合，乃敢与君绝的坚定。愿天下有情人终成眷属！",1,5,0,3,302,"节日活动",101016,100013,1,0,11007,105,2,0,0,},  
    [24] = {61,"红颜芳华",412,"通过红颜芳华活动获得","北方有佳人，绝世而独立，一顾倾人城。再顾倾人国。红颜至此，芳华绝代。",1,5,0,3,302,"节日活动",101017,100013,1,0,11007,106,2,0,0,},  
    [25] = {62,"寒食踏青",413,"通过游园踏青活动获得","一日踏春一百回,朝朝没脚走芳埃。",1,5,0,3,302,"节日活动",101019,100013,1,0,11007,107,2,0,0,},  
    [26] = {63,"耕云播雨",414,"通过劳动快乐活动获得","春耕夏播，云升雨济。劳劳其民，兴兴其业。云动百里，春风化雨。桑枝繁新，耕种满园。",1,5,0,3,302,"节日活动",101023,100013,1,0,11007,108,2,0,0,},  
    [27] = {64,"无忧少年",420,"通过童心童趣活动获得","稚童未有世俗虑，无忧最是少年时。",1,6,0,3,302,"节日活动",101025,100013,1,0,11007,109,2,0,0,},  
    [28] = {65,"幻紫神金",421,"通过盛夏战姬活动获得","神金七月流火日，幻紫世代破晓时",1,6,0,3,302,"节日活动",101026,100013,1,0,11007,115,2,0,0,},  
    [29] = {70,"精锐之伍",415,"攻城略地占领橙色城池获得","世之精锐，意气风发，杀敌制胜，只在顷刻之间，得之则得天下也。",1,4,0,1,101,"攻城略地",102007,100013,2,1209600,11006,110,2,0,0,},  
    [30] = {71,"悍勇之旅",416,"攻城略地占领红色城池获得","驰骋沙场，有凌云意气，风姿傲骨，冠绝三军。一战成名，世称之为悍勇之旅。",1,5,0,1,101,"攻城略地",102008,100013,2,1209600,11007,111,2,0,0,},  
    [31] = {72,"铁血之团",417,"攻城略地皇城第三名获得","铁血之士，赤胆忠心。挥刀斩敌，则血流成河；镇守一方，则贼寇除尽。",1,6,0,1,101,"攻城略地",102009,100013,2,1209600,11008,112,2,0,0,},  
    [32] = {73,"不败之军",418,"攻城略地皇城第二名获得","百战百胜，立于不败之地。神鬼见之纷纷绕行，日月星辰皆为其叹服。",1,6,0,1,101,"攻城略地",102010,100013,2,1209600,11008,113,2,0,0,},  
    [33] = {74,"无敌雄师",419,"攻城略地皇城第一名获得","雄师百万，无敌于天地万古之间。气焰有风雷之势，足以撼天动地，威震九霄。",1,7,0,1,101,"攻城略地",102011,100013,2,1209600,11009,114,2,0,0,},  
    [34] = {101,"一骑霸服",1001,"通过霸服活动获得","一骑当先，称霸本服！",1,5,0,3,301,"福利活动",101001,100013,1,0,11007,1001,2,1716,0,},  
    [35] = {102,"荣耀少年",1004,"通过官网公测预约获得","荣耀一生，归来仍是少年！",1,5,0,3,301,"福利活动",101002,100013,1,0,11007,1002,2,0,0,},  
    [36] = {103,"内测元勋",1005,"破晓测试参与返利活动","感谢您的一路陪伴，愿您永远少年！",1,4,0,3,301,"福利活动",101003,100013,1,0,11006,1003,2,0,0,},  
    [37] = {104,"九州神游",1006,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,4,0,3,301,"福利活动",101004,100013,1,0,11006,1004,2,1718,0,},  
    [38] = {105,"少年壮志",1007,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,4,0,3,301,"福利活动",101005,100013,1,0,11006,1005,2,1715,0,},  
    [39] = {106,"文曲星",1008,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,4,0,3,301,"福利活动",101006,100013,1,0,11006,1006,2,1716,0,},  
    [40] = {107,"三国之志",1009,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,6,0,3,301,"福利活动",101007,100013,1,0,11008,1007,2,0,0,},  
    [41] = {108,"闪耀登场",1012,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,6,0,3,301,"福利活动",101008,100013,1,0,11008,1008,2,1716,0,},  
    [42] = {109,"聚米为谷",1011,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,4,0,3,301,"福利活动",101009,100013,1,0,11006,1009,2,1717,0,},  
    [43] = {110,"明星玩家",1013,"通过活动获得","感谢您的一路陪伴，愿您永远少年！",1,4,0,3,301,"福利活动",101012,100013,1,0,11006,1010,2,1717,0,},  
    [44] = {111,"砥砺前行",1014,"感恩少年，砥砺前行","感谢少年的宽容和支持，是你们的不离不弃砥砺着我们，让我们像宝剑一样，经历磨砺而锐不可当。愿我们今后能一路相伴，砥砺前行！",1,6,0,3,301,"福利活动",102003,100013,1,0,11008,1011,2,0,0,},  
    [45] = {112,"兵强马壮",1015,"号令天下军团兵力等级奖励","兵强马壮才有资格参与天下争霸，这是一个军团强大的象征。",1,5,0,3,303,"号令天下",102004,100013,2,1296000,11007,1012,2,0,0,},  
    [46] = {113,"佣兵天下",1016,"号令天下本服排行奖励","为将者，拥兵一方，麾下精兵良将，不计其数；盔甲兵刃，囤积于府。只待天下有变，便可提兵征战四方，一统江山。",1,6,0,3,303,"号令天下",102005,100013,2,1296000,11008,1013,2,0,0,},  
    [47] = {114,"号令天下",1017,"号令天下跨服排行奖励","为王者，拥兵百万，麾下猛将如云，谋臣似雨。举手间，天下皆俯首；拄剑殿前，诸侯叩拜，此为人间帝王，号令天下。",1,7,0,3,303,"号令天下",102006,100013,2,1296000,11009,1014,2,0,0,},  
    [48] = {115,"战火重燃",1018,"通过少年归来活动获得","感谢您的一路陪伴，愿您永远少年！",1,6,0,3,301,"福利活动",101018,100013,1,0,11007,107,2,0,0,},  
    [49] = {116,"风华正茂",1019,"通过活动获得","恰少年，风华正茂。正如少年将军，指点江山，挥斥方遒！",1,6,0,3,301,"福利活动",101020,100013,1,0,11008,1015,2,1717,0,},  
    [50] = {117,"年少有为",1020,"通过活动获得","少年将军，荡四海，破万敌，年少而有为。宣父犹能畏后生， 丈夫未可轻年少！",1,6,0,3,301,"福利活动",101021,100013,1,0,11008,1016,2,1717,0,},  
    [51] = {118,"万丈荣耀",1021,"通过活动获得","普天之下，莫非王土，令行禁止，无敢不从。此为天下帝王，尽显万丈荣耀！",1,6,0,3,301,"福利活动",101022,100013,1,0,11008,1017,2,1717,0,},  
    [52] = {119,"潮玩少年",1022,"通过活动获得","艺术邂逅娱乐，少年彰显自我！",1,5,0,3,301,"福利活动",101024,100013,1,0,11007,1018,2,0,0,},  
    [53] = {120,"镇魂少年",1023,"通过活动获得","天命少年，无双盖世。威镇亡魂，刀斩罗刹。身旁有守护灵五人，惩恶扬善，守护灵域安宁。天下恶灵，无不惧之。",1,7,0,3,301,"福利活动",102012,100013,1,0,11007,1001,2,0,1,},  
    [54] = {121,"夏花绚烂",1024,"通过活动获得","愿所有少年，都如同夏花般绚烂夺目！",1,7,0,3,301,"福利活动",102013,100013,1,0,11007,1001,2,0,0,},
    }
}

local __index_id = {   
    [38] = 1,  
    [39] = 2,  
    [40] = 3,  
    [41] = 4,  
    [42] = 5,  
    [43] = 6,  
    [44] = 7,  
    [45] = 8,  
    [46] = 9,  
    [47] = 10,  
    [48] = 11,  
    [49] = 12,  
    [50] = 13,  
    [51] = 14,  
    [52] = 15,  
    [53] = 16,  
    [54] = 17,  
    [55] = 18,  
    [56] = 19,  
    [57] = 20,  
    [58] = 21,  
    [59] = 22,  
    [60] = 23,  
    [61] = 24,  
    [62] = 25,  
    [63] = 26,  
    [64] = 27,  
    [65] = 28,  
    [70] = 29,  
    [71] = 30,  
    [72] = 31,  
    [73] = 32,  
    [74] = 33,  
    [101] = 34,  
    [102] = 35,  
    [103] = 36,  
    [104] = 37,  
    [105] = 38,  
    [106] = 39,  
    [107] = 40,  
    [108] = 41,  
    [109] = 42,  
    [110] = 43,  
    [111] = 44,  
    [112] = 45,  
    [113] = 46,  
    [114] = 47,  
    [115] = 48,  
    [116] = 49,  
    [117] = 50,  
    [118] = 51,  
    [119] = 52,  
    [120] = 53,  
    [121] = 54,
}

local __key_map = { 
    id = 1,
    name = 2,
    seen_icon = 3,
    description = 4,
    title_desc = 5,
    put = 6,
    quality = 7,
    rare = 8,
    title_type = 9,
    title_tab = 10,
    tab_name = 11,
    activate_talent = 12,
    wear_talent = 13,
    time_type = 14,
    time_value = 15,
    item_icon = 16,
    sort = 17,
    remind_size = 18,
    op_game_id = 19,
    game_type = 20,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_title_info")

        return t._raw[__key_map[k]]
    end
}


function title_info.getLength()
    return #title_info._data
end



function title_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_title_info
function title_info.indexOf(index)
    if index == nil or not title_info._data[index] then
        return nil
    end
    return setmetatable({_raw = title_info._data[index]}, m)
end



---
--@return @class record_title_info
function title_info.get(id)
    
    return title_info.indexOf(__index_id[ id ])
     
end



function title_info.set(id, key, value)
    local record = title_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function title_info.get_index_data()
    return __index_id 
end

return  title_info 