---@classdef record_transformation_card_info
local record_transformation_card_info = {}


record_transformation_card_info.id = 0--id
record_transformation_card_info.advance_id = 0--关联的武将id
record_transformation_card_info.quality = 0--品质
record_transformation_card_info.name =  ""--名称
record_transformation_card_info.describe =  ""--描述
record_transformation_card_info.recovery_value = 0--转化元宝
record_transformation_card_info.attribute_type_1 = 0--属性类型1
record_transformation_card_info.attribute_value_1 = 0--属性值1
record_transformation_card_info.attribute_type_2 = 0--属性类型2
record_transformation_card_info.attribute_value_2 = 0--属性值2
record_transformation_card_info.attribute_type_3 = 0--属性类型3
record_transformation_card_info.attribute_value_3 = 0--属性值3
record_transformation_card_info.attribute_type_4 = 0--属性类型4
record_transformation_card_info.attribute_value_4 = 0--属性值4
record_transformation_card_info.original_star = 0--初始技能星级
record_transformation_card_info.dress_num_1 = 0--时装个数1
record_transformation_card_info.skill_star_1 = 0--化身卡星级1
record_transformation_card_info.dress_num_2 = 0--时装个数2
record_transformation_card_info.skill_star_2 = 0--化身卡星级2
record_transformation_card_info.dress_num_3 = 0--时装个数3
record_transformation_card_info.skill_star_3 = 0--化身卡星级3

local transformation_card_info = {
   _data = {   
    [1] = {400060,400060,4,"孟获化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成孟获",400,1,26700,3,1100,0,0,0,0,0,0,0,0,0,0,0,},  
    [2] = {400070,400070,4,"祝融化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成祝融",400,2,1400,4,1100,0,0,0,0,0,0,0,0,0,0,0,},  
    [3] = {400130,400130,4,"孙尚香化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成孙尚香",400,1,26700,4,1100,0,0,0,0,0,0,0,0,0,0,0,},  
    [4] = {400010,400010,5,"于禁化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成于禁",1000,2,3500,4,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [5] = {400040,400040,5,"庞德化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成庞德",1000,1,66700,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [6] = {400020,400020,5,"曹丕化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成曹丕",1000,2,3500,4,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [7] = {400030,400030,5,"乐进化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成乐进",1000,1,66700,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [8] = {400050,400050,5,"步练师化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成步练师",1000,1,66700,4,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [9] = {400080,400080,5,"法正化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成法正",1000,2,3500,4,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [10] = {400090,400090,5,"程普化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成程普",1000,1,66700,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [11] = {400100,400100,5,"周泰化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成周泰",1000,2,3500,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [12] = {400110,400110,5,"黄盖化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成黄盖",1000,1,66700,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [13] = {400120,400120,5,"徐盛化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成徐盛",1000,2,3500,4,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [14] = {400140,400140,5,"颜良化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成颜良",1000,2,3500,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [15] = {400150,400150,5,"文丑化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成文丑",1000,1,66700,3,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [16] = {400160,400160,5,"陈宫化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成陈宫",1000,1,66700,4,2600,0,0,0,0,0,1,3,2,5,3,7,},  
    [17] = {500010,500010,6,"甄姬化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成甄姬",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [18] = {500020,500020,6,"张辽化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成张辽",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [19] = {500030,500030,6,"许褚化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成许褚",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [20] = {500040,500040,6,"夏侯惇化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成夏侯惇",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [21] = {500050,500050,6,"夏侯渊化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成夏侯渊",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [22] = {500060,500060,6,"张郃化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成张郃",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [23] = {500070,500070,6,"庞统化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成庞统",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [24] = {500080,500080,6,"张飞化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成张飞",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [25] = {500100,500100,6,"魏延化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成魏延",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [26] = {500090,500090,6,"黄忠化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成黄忠",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [27] = {510040,510040,6,"赵云化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成赵云",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [28] = {500120,500120,6,"姜维化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成姜维",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [29] = {500130,500130,6,"大乔化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成大乔",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [30] = {500140,500140,6,"孙权化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成孙权",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [31] = {500150,500150,6,"孙坚化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成孙坚",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [32] = {500160,500160,6,"吕蒙化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成吕蒙",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [33] = {500170,500170,6,"太史慈化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成太史慈",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [34] = {500180,500180,6,"鲁肃化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成鲁肃",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [35] = {500190,500190,6,"华佗化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成华佗",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [36] = {500200,500200,6,"袁绍化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成袁绍",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [37] = {500240,500240,6,"公孙瓒化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成公孙瓒",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [38] = {500220,500220,6,"华雄化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成华雄",8000,1,333000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [39] = {500230,500230,6,"董卓化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成董卓",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [40] = {500210,500210,6,"于吉化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成于吉",8000,2,18000,3,13000,4,13000,0,0,0,1,3,2,5,3,7,},  
    [41] = {510010,510010,7,"郭嘉化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成郭嘉",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [42] = {510020,510020,7,"典韦化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成典韦",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [43] = {510030,510030,7,"刘备化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成刘备",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [44] = {500110,500110,7,"马超化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成马超",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [45] = {510050,510050,7,"陆逊化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成陆逊",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [46] = {510060,510060,7,"小乔化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成小乔",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [47] = {510070,510070,7,"贾诩化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成贾诩",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [48] = {510080,510080,7,"貂蝉化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成貂蝉",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [49] = {600020,600020,7,"司马懿化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成司马懿",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [50] = {600080,600080,7,"张角化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成张角",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [51] = {600090,600090,7,"黄月英化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成黄月英",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [52] = {600100,600100,7,"甘宁化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成甘宁",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [53] = {600110,600110,7,"荀彧化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成荀彧",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [54] = {600120,600120,7,"左慈化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成左慈",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [55] = {600030,600030,7,"诸葛亮化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成诸葛亮",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [56] = {600050,600050,7,"孙策化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成孙策",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [57] = {600010,600010,7,"曹操化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成曹操",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [58] = {600040,600040,7,"关羽化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成关羽",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [59] = {600060,600060,7,"周瑜化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成周瑜",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [60] = {600070,600070,7,"吕布化身符","相传是左慈登仙前留下的符咒，使用后可以参悟身外化身之道，幻化成吕布",40000,2,60000,1,2220000,3,40000,4,40000,0,1,3,2,5,3,7,},  
    [61] = {700010,700010,8,"曹节化身符","相传是左慈登仙前留下的符咒,使用后可以参悟身外化身之道,幻化成曹节",50000,2,290000,1,11110000,5,220000,207,50,0,1,3,2,5,3,7,},  
    [62] = {700020,700020,8,"诸葛果化身符","相传是左慈登仙前留下的符咒,使用后可以参悟身外化身之道,幻化成诸葛果",50000,2,290000,1,11110000,5,220000,208,50,0,1,3,2,5,3,7,},  
    [63] = {700030,700030,8,"孙鲁班化身符","相传是左慈登仙前留下的符咒,使用后可以参悟身外化身之道,幻化成孙鲁班",50000,2,290000,1,11110000,5,220000,207,50,0,1,3,2,5,3,7,},  
    [64] = {700040,700040,8,"吕玲绮化身符","相传是左慈登仙前留下的符咒,使用后可以参悟身外化身之道,幻化成吕玲绮",50000,2,290000,1,11110000,5,220000,208,50,0,1,3,2,5,3,7,},
    }
}

local __index_id = {   
    [400010] = 4,  
    [400020] = 6,  
    [400030] = 7,  
    [400040] = 5,  
    [400050] = 8,  
    [400060] = 1,  
    [400070] = 2,  
    [400080] = 9,  
    [400090] = 10,  
    [400100] = 11,  
    [400110] = 12,  
    [400120] = 13,  
    [400130] = 3,  
    [400140] = 14,  
    [400150] = 15,  
    [400160] = 16,  
    [500010] = 17,  
    [500020] = 18,  
    [500030] = 19,  
    [500040] = 20,  
    [500050] = 21,  
    [500060] = 22,  
    [500070] = 23,  
    [500080] = 24,  
    [500090] = 26,  
    [500100] = 25,  
    [500110] = 44,  
    [500120] = 28,  
    [500130] = 29,  
    [500140] = 30,  
    [500150] = 31,  
    [500160] = 32,  
    [500170] = 33,  
    [500180] = 34,  
    [500190] = 35,  
    [500200] = 36,  
    [500210] = 40,  
    [500220] = 38,  
    [500230] = 39,  
    [500240] = 37,  
    [510010] = 41,  
    [510020] = 42,  
    [510030] = 43,  
    [510040] = 27,  
    [510050] = 45,  
    [510060] = 46,  
    [510070] = 47,  
    [510080] = 48,  
    [600010] = 57,  
    [600020] = 49,  
    [600030] = 55,  
    [600040] = 58,  
    [600050] = 56,  
    [600060] = 59,  
    [600070] = 60,  
    [600080] = 50,  
    [600090] = 51,  
    [600100] = 52,  
    [600110] = 53,  
    [600120] = 54,  
    [700010] = 61,  
    [700020] = 62,  
    [700030] = 63,  
    [700040] = 64,
}

local __key_map = { 
    id = 1,
    advance_id = 2,
    quality = 3,
    name = 4,
    describe = 5,
    recovery_value = 6,
    attribute_type_1 = 7,
    attribute_value_1 = 8,
    attribute_type_2 = 9,
    attribute_value_2 = 10,
    attribute_type_3 = 11,
    attribute_value_3 = 12,
    attribute_type_4 = 13,
    attribute_value_4 = 14,
    original_star = 15,
    dress_num_1 = 16,
    skill_star_1 = 17,
    dress_num_2 = 18,
    skill_star_2 = 19,
    dress_num_3 = 20,
    skill_star_3 = 21,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_transformation_card_info")

        return t._raw[__key_map[k]]
    end
}


function transformation_card_info.getLength()
    return #transformation_card_info._data
end



function transformation_card_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_transformation_card_info
function transformation_card_info.indexOf(index)
    if index == nil or not transformation_card_info._data[index] then
        return nil
    end
    return setmetatable({_raw = transformation_card_info._data[index]}, m)
end



---
--@return @class record_transformation_card_info
function transformation_card_info.get(id)
    
    return transformation_card_info.indexOf(__index_id[ id ])
     
end



function transformation_card_info.set(id, key, value)
    local record = transformation_card_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function transformation_card_info.get_index_data()
    return __index_id 
end

return  transformation_card_info 