---@classdef record_unite_token_rune_info
local record_unite_token_rune_info = {}


record_unite_token_rune_info.id = 0--ID
record_unite_token_rune_info.num = 0--符石数量
record_unite_token_rune_info.item_type = 0--材料类型
record_unite_token_rune_info.item_value = 0--材料类型值
record_unite_token_rune_info.image_1 = 0--孔1图标
record_unite_token_rune_info.hole_1_cost = 0--孔1消耗
record_unite_token_rune_info.hole_1_affect_type_1 = 0--孔1属性1
record_unite_token_rune_info.hole_1_affect_value_1 = 0--孔1属性值1
record_unite_token_rune_info.hole_1_affect_type_2 = 0--孔1属性2
record_unite_token_rune_info.hole_1_affect_value_2 = 0--孔1属性值2
record_unite_token_rune_info.image_2 = 0--孔2图标
record_unite_token_rune_info.hole_2_cost = 0--孔2消耗
record_unite_token_rune_info.hole_2_affect_type_1 = 0--孔2属性1
record_unite_token_rune_info.hole_2_affect_value_1 = 0--孔2属性值1
record_unite_token_rune_info.hole_2_affect_type_2 = 0--孔2属性2
record_unite_token_rune_info.hole_2_affect_value_2 = 0--孔2属性值2
record_unite_token_rune_info.image_3 = 0--孔3图标
record_unite_token_rune_info.hole_3_cost = 0--孔3消耗
record_unite_token_rune_info.hole_3_affect_type_1 = 0--孔3属性1
record_unite_token_rune_info.hole_3_affect_value_1 = 0--孔3属性值1
record_unite_token_rune_info.hole_3_affect_type_2 = 0--孔3属性2
record_unite_token_rune_info.hole_3_affect_value_2 = 0--孔3属性值2
record_unite_token_rune_info.image_4 = 0--孔4图标
record_unite_token_rune_info.hole_4_cost = 0--孔4消耗
record_unite_token_rune_info.hole_4_affect_type_1 = 0--孔4属性1
record_unite_token_rune_info.hole_4_affect_value_1 = 0--孔4属性值1
record_unite_token_rune_info.hole_4_affect_type_2 = 0--孔4属性2
record_unite_token_rune_info.hole_4_affect_value_2 = 0--孔4属性值2
record_unite_token_rune_info.image_5 = 0--孔5图标
record_unite_token_rune_info.hole_5_cost = 0--孔5消耗
record_unite_token_rune_info.hole_5_affect_type_1 = 0--孔5属性1
record_unite_token_rune_info.hole_5_affect_value_1 = 0--孔5属性值1
record_unite_token_rune_info.hole_5_affect_type_2 = 0--孔5属性2
record_unite_token_rune_info.hole_5_affect_value_2 = 0--孔5属性值2
record_unite_token_rune_info.image_6 = 0--孔6图标
record_unite_token_rune_info.hole_6_cost = 0--孔6消耗
record_unite_token_rune_info.hole_6_affect_type_1 = 0--孔6属性1
record_unite_token_rune_info.hole_6_affect_value_1 = 0--孔6属性值1
record_unite_token_rune_info.hole_6_affect_type_2 = 0--孔6属性2
record_unite_token_rune_info.hole_6_affect_value_2 = 0--孔6属性值2
record_unite_token_rune_info.image_7 = 0--孔7图标
record_unite_token_rune_info.hole_7_cost = 0--孔7消耗
record_unite_token_rune_info.hole_7_affect_type_1 = 0--孔7属性1
record_unite_token_rune_info.hole_7_affect_value_1 = 0--孔7属性值1
record_unite_token_rune_info.hole_7_affect_type_2 = 0--孔7属性2
record_unite_token_rune_info.hole_7_affect_value_2 = 0--孔7属性值2
record_unite_token_rune_info.image_8 = 0--孔8图标
record_unite_token_rune_info.hole_8_cost = 0--孔8消耗
record_unite_token_rune_info.hole_8_affect_type_1 = 0--孔8属性1
record_unite_token_rune_info.hole_8_affect_value_1 = 0--孔8属性值1
record_unite_token_rune_info.hole_8_affect_type_2 = 0--孔8属性2
record_unite_token_rune_info.hole_8_affect_value_2 = 0--孔8属性值2
record_unite_token_rune_info.talent_id_1 = 0--天赋id1
record_unite_token_rune_info.talent_id_2 = 0--天赋id2
record_unite_token_rune_info.talent_id_3 = 0--天赋id3
record_unite_token_rune_info.talent_id_4 = 0--天赋id4
record_unite_token_rune_info.talent_id_5 = 0--天赋id5

local unite_token_rune_info = {
   _data = {   
    [1] = {40010,4,3,61,1,1,1,20000,11,5,1,1,4,500,14,5,1,1,3,500,13,5,1,1,2,1100,12,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,160101,0,0,0,0,},  
    [2] = {40020,4,3,61,1,1,1,20000,11,5,1,1,4,500,14,5,1,1,3,500,13,5,1,1,2,1100,12,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,160102,0,0,0,0,},  
    [3] = {40030,4,3,61,1,1,1,20000,11,5,1,1,4,500,14,5,1,1,3,500,13,5,1,1,2,1100,12,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,160103,0,0,0,0,},  
    [4] = {40040,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,104,10,5,1100,2,1,103,10,2,2100,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160104,160105,0,0,0,},  
    [5] = {40050,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,106,10,5,1100,2,1,105,10,1,40000,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160106,160107,0,0,0,},  
    [6] = {40060,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,102,10,1,40000,2,1,101,10,2,2100,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160108,160109,0,0,0,},  
    [7] = {40070,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,106,10,5,1100,2,1,105,10,1,40000,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160110,160111,0,0,0,},  
    [8] = {40080,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,104,10,5,1100,2,1,103,10,2,2100,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160112,160113,0,0,0,},  
    [9] = {40090,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,104,10,5,1100,2,1,103,10,2,2100,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160114,160115,0,0,0,},  
    [10] = {40100,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,102,10,1,40000,2,1,101,10,2,2100,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160116,160117,0,0,0,},  
    [11] = {40110,6,3,62,2,1,1,40000,11,10,2,1,4,1100,14,10,2,1,106,10,5,1100,2,1,105,10,1,40000,2,1,3,1100,13,10,2,1,2,2100,12,10,0,0,0,0,0,0,0,0,0,0,0,0,160118,160119,0,0,0,},  
    [12] = {50010,8,3,63,3,1,3,2100,13,20,3,1,105,20,1,80000,3,1,103,20,2,4200,3,1,104,20,5,2100,3,1,106,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160120,160121,160122,0,0,},  
    [13] = {50020,8,3,63,3,1,3,2100,13,20,3,1,103,20,2,4200,3,1,101,20,2,4200,3,1,102,20,1,80000,3,1,104,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160123,160124,160125,0,0,},  
    [14] = {50030,8,3,63,3,1,3,2100,13,20,3,1,101,20,2,4200,3,1,105,20,1,80000,3,1,106,20,5,2100,3,1,102,20,1,80000,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160126,160127,160128,0,0,},  
    [15] = {50040,8,3,63,3,1,3,2100,13,20,3,1,103,20,2,4200,3,1,105,20,1,80000,3,1,106,20,5,2100,3,1,104,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160129,160130,160131,0,0,},  
    [16] = {50050,8,3,63,3,1,3,2100,13,20,3,1,105,20,1,80000,3,1,101,20,2,4200,3,1,102,20,1,80000,3,1,106,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160132,160133,160134,0,0,},  
    [17] = {50060,8,3,63,3,1,3,2100,13,20,3,1,103,20,2,4200,3,1,101,20,2,4200,3,1,102,20,1,80000,3,1,104,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160135,160136,160137,0,0,},  
    [18] = {50070,8,3,63,3,1,3,2100,13,20,3,1,105,20,1,80000,3,1,103,20,2,4200,3,1,104,20,5,2100,3,1,106,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160138,160139,160140,0,0,},  
    [19] = {50080,8,3,63,3,1,3,2100,13,20,3,1,103,20,2,4200,3,1,101,20,2,4200,3,1,102,20,1,80000,3,1,104,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160141,160142,160143,0,0,},  
    [20] = {50090,8,3,63,3,1,3,2100,13,20,3,1,101,20,2,4200,3,1,103,20,2,4200,3,1,104,20,5,2100,3,1,102,20,1,80000,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160144,160145,160146,0,0,},  
    [21] = {50100,8,3,63,3,1,3,2100,13,20,3,1,105,20,1,80000,3,1,101,20,2,4200,3,1,102,20,1,80000,3,1,106,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160147,160148,160149,0,0,},  
    [22] = {50110,8,3,63,3,1,3,2100,13,20,3,1,105,20,1,80000,3,1,103,20,2,4200,3,1,104,20,5,2100,3,1,106,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160150,160151,160152,0,0,},  
    [23] = {50120,8,3,63,3,1,3,2100,13,20,3,1,105,20,1,80000,3,1,103,20,2,4200,3,1,104,20,5,2100,3,1,106,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160153,160154,160155,0,0,},  
    [24] = {50130,8,3,63,3,1,3,2100,13,20,3,1,103,20,2,4200,3,1,101,20,2,4200,3,1,102,20,1,80000,3,1,104,20,5,2100,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160156,160157,160158,0,0,},  
    [25] = {50140,8,3,63,3,1,3,2100,13,20,3,1,101,20,2,4200,3,1,105,20,1,80000,3,1,106,20,5,2100,3,1,102,20,1,80000,3,1,4,2100,14,20,3,1,1,80000,11,20,3,1,2,4200,12,20,160159,160160,160161,0,0,},  
    [26] = {50150,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,101,30,2,6300,4,1,102,30,1,120000,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160162,160163,160164,0,0,},  
    [27] = {50160,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,103,30,2,6300,4,1,104,30,5,3200,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160165,160166,160167,0,0,},  
    [28] = {50170,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,101,30,2,6300,4,1,102,30,1,120000,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160168,160169,160170,0,0,},  
    [29] = {50180,8,3,64,4,1,3,3200,13,30,4,1,103,30,2,6300,4,1,101,30,2,6300,4,1,102,30,1,120000,4,1,104,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160171,160172,160173,0,0,},  
    [30] = {50190,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,103,30,2,6300,4,1,104,30,1,120000,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160174,160175,160176,0,0,},  
    [31] = {50200,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,101,30,2,6300,4,1,102,30,1,120000,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160177,160178,160179,0,0,},  
    [32] = {50210,8,3,64,4,1,3,3200,13,30,4,1,101,30,2,6300,4,1,103,30,2,6300,4,1,104,30,1,120000,4,1,102,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160180,160181,160182,0,0,},  
    [33] = {50220,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,103,30,2,6300,4,1,104,30,1,120000,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160183,160184,160185,0,0,},  
    [34] = {50230,8,3,64,4,1,3,3200,13,30,4,1,101,30,2,6300,4,1,103,30,2,6300,4,1,104,30,1,120000,4,1,102,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160186,160187,160188,0,0,},  
    [35] = {50240,8,3,64,4,1,3,3200,13,30,4,1,105,30,1,120000,4,1,103,30,2,6300,4,1,104,30,1,120000,4,1,106,30,5,3200,4,1,4,3200,14,30,4,1,1,120000,11,30,4,1,2,6300,12,30,160189,160190,160191,0,0,},  
    [36] = {60010,8,3,219,5,1,3,3900,13,40,5,1,105,40,1,150000,5,1,101,40,2,7900,5,1,102,40,1,150000,5,1,106,40,5,3900,5,1,4,3900,14,40,5,1,1,150000,11,40,5,1,2,7900,12,40,160192,160193,160194,0,0,},  
    [37] = {60020,8,3,219,5,1,3,3900,13,40,5,1,105,40,1,150000,5,1,103,40,2,7900,5,1,104,40,5,3900,5,1,106,40,5,3900,5,1,4,3900,14,40,5,1,1,150000,11,40,5,1,2,7900,12,40,160195,160196,160197,0,0,},
    }
}

local __index_id = {   
    [40010] = 1,  
    [40020] = 2,  
    [40030] = 3,  
    [40040] = 4,  
    [40050] = 5,  
    [40060] = 6,  
    [40070] = 7,  
    [40080] = 8,  
    [40090] = 9,  
    [40100] = 10,  
    [40110] = 11,  
    [50010] = 12,  
    [50020] = 13,  
    [50030] = 14,  
    [50040] = 15,  
    [50050] = 16,  
    [50060] = 17,  
    [50070] = 18,  
    [50080] = 19,  
    [50090] = 20,  
    [50100] = 21,  
    [50110] = 22,  
    [50120] = 23,  
    [50130] = 24,  
    [50140] = 25,  
    [50150] = 26,  
    [50160] = 27,  
    [50170] = 28,  
    [50180] = 29,  
    [50190] = 30,  
    [50200] = 31,  
    [50210] = 32,  
    [50220] = 33,  
    [50230] = 34,  
    [50240] = 35,  
    [60010] = 36,  
    [60020] = 37,
}

local __key_map = { 
    id = 1,
    num = 2,
    item_type = 3,
    item_value = 4,
    image_1 = 5,
    hole_1_cost = 6,
    hole_1_affect_type_1 = 7,
    hole_1_affect_value_1 = 8,
    hole_1_affect_type_2 = 9,
    hole_1_affect_value_2 = 10,
    image_2 = 11,
    hole_2_cost = 12,
    hole_2_affect_type_1 = 13,
    hole_2_affect_value_1 = 14,
    hole_2_affect_type_2 = 15,
    hole_2_affect_value_2 = 16,
    image_3 = 17,
    hole_3_cost = 18,
    hole_3_affect_type_1 = 19,
    hole_3_affect_value_1 = 20,
    hole_3_affect_type_2 = 21,
    hole_3_affect_value_2 = 22,
    image_4 = 23,
    hole_4_cost = 24,
    hole_4_affect_type_1 = 25,
    hole_4_affect_value_1 = 26,
    hole_4_affect_type_2 = 27,
    hole_4_affect_value_2 = 28,
    image_5 = 29,
    hole_5_cost = 30,
    hole_5_affect_type_1 = 31,
    hole_5_affect_value_1 = 32,
    hole_5_affect_type_2 = 33,
    hole_5_affect_value_2 = 34,
    image_6 = 35,
    hole_6_cost = 36,
    hole_6_affect_type_1 = 37,
    hole_6_affect_value_1 = 38,
    hole_6_affect_type_2 = 39,
    hole_6_affect_value_2 = 40,
    image_7 = 41,
    hole_7_cost = 42,
    hole_7_affect_type_1 = 43,
    hole_7_affect_value_1 = 44,
    hole_7_affect_type_2 = 45,
    hole_7_affect_value_2 = 46,
    image_8 = 47,
    hole_8_cost = 48,
    hole_8_affect_type_1 = 49,
    hole_8_affect_value_1 = 50,
    hole_8_affect_type_2 = 51,
    hole_8_affect_value_2 = 52,
    talent_id_1 = 53,
    talent_id_2 = 54,
    talent_id_3 = 55,
    talent_id_4 = 56,
    talent_id_5 = 57,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_unite_token_rune_info")

        return t._raw[__key_map[k]]
    end
}


function unite_token_rune_info.getLength()
    return #unite_token_rune_info._data
end



function unite_token_rune_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_unite_token_rune_info
function unite_token_rune_info.indexOf(index)
    if index == nil or not unite_token_rune_info._data[index] then
        return nil
    end
    return setmetatable({_raw = unite_token_rune_info._data[index]}, m)
end



---
--@return @class record_unite_token_rune_info
function unite_token_rune_info.get(id)
    
    return unite_token_rune_info.indexOf(__index_id[ id ])
     
end



function unite_token_rune_info.set(id, key, value)
    local record = unite_token_rune_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function unite_token_rune_info.get_index_data()
    return __index_id 
end

return  unite_token_rune_info 