---@classdef record_vip_level_info
local record_vip_level_info = {}


record_vip_level_info.id = 0--等级id
record_vip_level_info.level = 0--VIP等级
record_vip_level_info.show_exp = 0--显示提醒所需经验
record_vip_level_info.need_vip_exp = 0--所需vip经验
record_vip_level_info.vip_packs = 0--VIP等级礼包
record_vip_level_info.frame = 0--VIP头像框
record_vip_level_info.privilege_id_1 = 0--VIP特权1
record_vip_level_info.privilege_id_2 = 0--VIP特权2
record_vip_level_info.privilege_id_3 = 0--VIP特权3
record_vip_level_info.privilege_id_4 = 0--VIP特权4
record_vip_level_info.privilege_id_5 = 0--VIP特权5
record_vip_level_info.privilege_id_6 = 0--VIP特权6
record_vip_level_info.privilege_id_7 = 0--VIP特权7
record_vip_level_info.privilege_id_8 = 0--VIP特权8
record_vip_level_info.privilege_id_9 = 0--VIP特权9
record_vip_level_info.privilege_id_10 = 0--VIP特权10
record_vip_level_info.privilege_id_11 = 0--VIP特权11
record_vip_level_info.privilege_id_12 = 0--VIP特权12
record_vip_level_info.privilege_id_13 = 0--VIP特权13
record_vip_level_info.privilege_id_14 = 0--VIP特权14
record_vip_level_info.privilege_id_15 = 0--VIP特权15
record_vip_level_info.privilege_id_16 = 0--VIP特权16
record_vip_level_info.privilege_id_17 = 0--VIP特权17
record_vip_level_info.privilege_id_18 = 0--VIP特权18
record_vip_level_info.privilege_id_19 = 0--VIP特权19
record_vip_level_info.privilege_id_20 = 0--VIP特权20
record_vip_level_info.vip_show = 0--是否展示当前VIP
record_vip_level_info.show_type = 0--展示类型
record_vip_level_info.show_value = 0--展示物品
record_vip_level_info.vip_packs_name =  ""--物品名称
record_vip_level_info.vip_packs_quality = 0--展示物品品质
record_vip_level_info.vip_packs_txt_1 =  ""--礼包描述1
record_vip_level_info.vip_packs_txt_2 =  ""--礼包描述2
record_vip_level_info.vip_pic_scaling = 0--缩放比例
record_vip_level_info.vip_pic_turn = 0--是否翻转
record_vip_level_info.function_direction =  ""--特权描述

local vip_level_info = {
   _data = {   
    [1] = {1,0,0,60,528,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11,100,"剑客",5,"橙色时装","购买贵3礼包获得",830,1,"1.每日可购买&<12>4&次体力丹\n2.每日可购买&<12>10&次寻宝令\n3.每日可购买&<12>10&次竞技场挑战令\n4.每日可购买&<12>20&次巨兽讨伐令\n5.每日可购买&<12>4&次特级装备随机箱\n6.每日可购买&<12>4&次特级宝物随机箱\n7.每日可购买&<12>50&次进阶丹\n8.每日可购买&<12>50&次兵符铸造石\n9.每日可购买&<12>10&次兵符精华\n10.每日可购买&<12>10&次时装精华\n11.每日可购买&<12>10&次宝物精炼石\n12.每日可购买&<12>10&次培养丹\n13.每日可购买&<12>10&次顶级精炼石\n14.每日可购买&<12>20&次极品经验书\n15.每日可购买&<12>10&次经验虎符\n16.每日可购买&<12>5&次进阶饰品魂\n17.每日可购买&<12>15&次图鉴升级石\n18.每日可购买&<12>3&次列传次数\n19.每日可重置&<12>1&次列传关卡\n20.每日可封地平定动乱&<12>10&次\n21.每日将魂商店可刷新&<12>20&次\n22.每日可购买&<12>4&次军团副本挑战次数",},  
    [2] = {2,1,0,240,529,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11,100,"剑客",5,"橙色时装","购买贵3礼包获得",830,1,"1.每日可购买&<12>8&次体力丹\n2.每日可购买&<12>6&次特级装备随机箱\n3.每日可购买&<12>6&次特级宝物随机箱\n4.每日可购买&<12>60&次进阶丹\n5.每日可购买&<12>60&次兵符铸造石\n6.每日可购买&<12>20&次兵符精华\n7.每日可购买&<12>20&次时装精华\n8.每日可购买&<12>20&次宝物精炼石\n9.每日可购买&<12>20&次培养丹\n10.每日可购买&<12>20&次顶级精炼石\n11.每日可购买&<12>30&次极品经验书\n12.每日可购买&<12>20&次经验虎符\n13.每日可购买&<12>10&次进阶饰品魂\n14.每日可购买&<12>20&次图鉴升级石\n15.每日可购买&<12>5&次列传次数\n16.每日将魂商店可刷新&<12>25&次\n17.每日可购买&<12>6&次军团副本挑战次数\n",},  
    [3] = {3,2,0,700,530,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11,100,"剑客",5,"橙色时装","购买贵3礼包获得",830,1,"1.每日可购买&<12>12&次体力丹\n2.每日可购买&<12>15&次寻宝令\n3.每日可购买&<12>15&次竞技场挑战令\n4.每日可购买&<12>8&次特级装备随机箱\n5.每日可购买&<12>8&次特级宝物随机箱\n6.每日可购买&<12>70&次进阶丹\n7.每日可购买&<12>70&次兵符铸造石\n8.每日可购买&<12>30&次兵符精华\n9.每日可购买&<12>30&次时装精华\n10.每日可购买&<12>30&次宝物精炼石\n11.每日可购买&<12>30&次培养丹\n12.每日可购买&<12>30&次顶级精炼石\n13.每日可购买&<12>40&次极品经验书\n14.每日可购买&<12>30&次经验虎符\n15.每日可重置&<12>2&次列传关卡\n16.每日将魂商店可刷新&<12>30&次\n17.每日可购买&<12>8&次军团副本挑战次数\n",},  
    [4] = {4,3,0,2000,531,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11,100,"剑客",5,"橙色时装","购买贵3礼包获得",830,1,"1.每日可购买&<12>16&次体力丹\n2.每日可购买&<12>10&次特级装备随机箱\n3.每日可购买&<12>10&次特级宝物随机箱\n4.每日可购买&<12>80&次进阶丹\n5.每日可购买&<12>80&次兵符铸造石\n6.每日可购买&<12>40&次兵符精华\n7.每日可购买&<12>40&次时装精华\n8.每日可购买&<12>40&次宝物精炼石\n9.每日可购买&<12>40&次培养丹\n10.每日可购买&<12>40&次顶级精炼石\n11.每日可购买&<12>50&次极品经验书\n12.每日可购买&<12>40&次经验虎符\n13.每日可购买&<12>25&次图鉴升级石\n14.每日将魂商店可刷新&<12>35&次\n15.每日可购买&<12>10&次军团副本挑战次数\n",},  
    [5] = {5,4,0,2000,532,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,411,"霸王神剑",6,"红色装备","",1100,1,"1.每日可购买&<12>18&次体力丹\n2.每日可购买&<12>12&次特级装备随机箱\n3.每日可购买&<12>12&次特级宝物随机箱\n4.每日可购买&<12>90&次进阶丹\n5.每日可购买&<12>90&次兵符铸造石\n6.每日可购买&<12>50&次兵符精华\n7.每日可购买&<12>50&次时装精华\n8.每日可购买&<12>50&次宝物精炼石\n9.每日可购买&<12>50&次培养丹\n10.每日可购买&<12>50&次顶级精炼石\n11.每日可购买&<12>60&次极品经验书\n12.每日可购买&<12>50&次经验虎符\n13.每日可购买&<12>15&次进阶饰品魂\n14.每日可重置&<12>3&次列传关卡\n15.每日可购买&<12>1&次列传-组队战役次数\n16.每日将魂商店可刷新&<12>40&次\n17.每日可购买&<12>12&次军团副本挑战次数\n",},  
    [6] = {6,5,0,4000,533,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,413,"霸王重甲",6,"红色装备","",1100,1,"1.每日可购买&<12>20&次体力丹\n2.每日可购买&<12>25&次巨兽讨伐令\n3.每日可购买&<12>14&次特级装备随机箱\n4.每日可购买&<12>14&次特级宝物随机箱\n5.每日可购买&<12>100&次进阶丹\n6.每日可购买&<12>100&次兵符铸造石\n7.每日可购买&<12>60&次兵符精华\n8.每日可购买&<12>60&次时装精华\n9.每日可购买&<12>60&次宝物精炼石\n10.每日可购买&<12>60&次培养丹\n11.每日可购买&<12>60&次顶级精炼石\n12.每日可购买&<12>70&次极品经验书\n13.每日可购买&<12>60&次经验虎符\n14.每日可购买&<12>30&次图鉴升级石\n15.每日将魂商店可刷新&<12>45&次\n16.每日可购买&<12>14&次军团副本挑战次数\n",},  
    [7] = {7,6,4500,6000,534,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,421,"无双画戟",7,"金色装备","",1100,1,"&<12>1.封地开启高级巡逻&\n2.每日可购买&<12>22&次体力丹\n3.每日可购买&<12>16&次特级装备随机箱\n4.每日可购买&<12>16&次特级宝物随机箱\n5.每日可购买&<12>110&次进阶丹\n6.每日可购买&<12>110&次兵符铸造石\n7.每日可购买&<12>70&次兵符精华\n8.每日可购买&<12>70&次时装精华\n9.每日可购买&<12>70&次宝物精炼石\n10.每日可购买&<12>70&次培养丹\n11.每日可购买&<12>70&次顶级精炼石\n12.每日可购买&<12>80&次极品经验书\n13.每日可购买&<12>70&次经验虎符\n14.每日可购买&<12>20&次进阶饰品魂\n15.每日可重置&<12>4&次列传关卡\n16.每日将魂商店可刷新&<12>50&次\n17.每日可购买&<12>16&次军团副本挑战次数\n",},  
    [8] = {8,7,8000,10000,535,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,422,"无双战靴",7,"金色装备","",1100,-1,"1.每日可购买&<12>25&次体力丹\n2.每日可购买&<12>20&次寻宝令\n3.每日可购买&<12>20&次竞技场挑战令\n4.每日可购买&<12>18&次特级装备随机箱\n5.每日可购买&<12>18&次特级宝物随机箱\n6.每日可购买&<12>120&次进阶丹\n7.每日可购买&<12>120&次兵符铸造石\n8.每日可购买&<12>80&次兵符精华\n9.每日可购买&<12>80&次时装精华\n10.每日可购买&<12>80&次宝物精炼石\n11.每日可购买&<12>80&次培养丹\n12.每日可购买&<12>80&次顶级精炼石\n13.每日可购买&<12>90&次极品经验书\n14.每日可购买&<12>80&次经验虎符\n15.每日可购买&<12>35&次图鉴升级石\n16.每日可购买&<12>10&次列传次数\n17.每日将魂商店可刷新&<12>60&次\n18.每日可购买&<12>18&次军团副本挑战次数\n",},  
    [9] = {9,8,12750,15000,536,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,423,"无双宝铠",7,"金色装备","",1100,1,"1.每日可购买&<12>30&次体力丹\n2.每日可购买&<12>20&次特级装备随机箱\n3.每日可购买&<12>20&次特级宝物随机箱\n4.每日可购买&<12>130&次进阶丹\n5.每日可购买&<12>130&次兵符铸造石\n6.每日可购买&<12>90&次兵符精华\n7.每日可购买&<12>90&次时装精华\n8.每日可购买&<12>90&次宝物精炼石\n9.每日可购买&<12>90&次培养丹\n10.每日可购买&<12>90&次顶级精炼石\n11.每日可购买&<12>100&次极品经验书\n12.每日可购买&<12>90&次经验虎符\n13.每日可购买&<12>25&次进阶饰品魂\n14.每日将魂商店可刷新&<12>70&次\n15.每日可购买&<12>20&次军团副本挑战次数\n",},  
    [10] = {10,9,22000,25000,537,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,4,600030,"诸葛亮",7,"金色武将","全体吸怒、持续输出",1100,-1,"&<12>1.无双试炼开启扫荡功能&\n2.每日可购买&<12>35&次体力丹\n3.每日可购买&<12>30&次巨兽讨伐令\n4.每日可购买&<12>22&次特级装备随机箱\n5.每日可购买&<12>22&次特级宝物随机箱\n6.每日可购买&<12>140&次进阶丹\n7.每日可购买&<12>140&次兵符铸造石\n8.每日可购买&<12>100&次兵符精华\n9.每日可购买&<12>100&次时装精华\n10.每日可购买&<12>100&次宝物精炼石\n11.每日可购买&<12>100&次培养丹\n12.每日可购买&<12>100&次顶级精炼石\n13.每日可购买&<12>110&次极品经验书\n14.每日可购买&<12>100&次经验虎符\n15.每日可购买&<12>40&次图鉴升级石\n16.每日将魂商店可刷新&<12>80&次\n17.每日可购买&<12>22&次军团副本挑战次数\n",},  
    [11] = {11,10,31500,35000,538,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,11,400,"夜叉",6,"红色时装","范围攻击、怒气控制",830,-1,"1.每日可购买&<12>40&次体力丹\n2.每日可购买&<12>25&次寻宝令\n3.每日可购买&<12>25&次竞技场挑战令\n4.每日可购买&<12>24&次特级装备随机箱\n5.每日可购买&<12>24&次特级宝物随机箱\n6.每日可购买&<12>150&次进阶丹\n7.每日可购买&<12>150&次兵符铸造石\n8.每日可购买&<12>110&次兵符精华\n9.每日可购买&<12>110&次时装精华\n10.每日可购买&<12>110&次宝物精炼石\n11.每日可购买&<12>110&次培养丹\n12.每日可购买&<12>110&次顶级精炼石\n13.每日可购买&<12>120&次极品经验书\n14.每日可购买&<12>110&次经验虎符\n15.每日可购买&<12>30&次进阶饰品魂\n16.每日将魂商店可刷新&<12>100&次\n17.每日可购买&<12>2&次列传-组队战役次数\n18.每日可购买&<12>24&次军团副本挑战次数\n",},  
    [12] = {12,11,92000,100000,539,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,5,50210,"霸王横江",7,"金色兵符","定点输出、暴击提升",830,-1,"1.每日可购买&<12>42&次体力丹\n2.每日可购买&<12>26&次特级装备随机箱\n3.每日可购买&<12>26&次特级宝物随机箱\n4.每日可购买&<12>160&次进阶丹\n5.每日可购买&<12>160&次兵符铸造石\n6.每日可购买&<12>120&次兵符精华\n7.每日可购买&<12>120&次时装精华\n8.每日可购买&<12>120&次宝物精炼石\n9.每日可购买&<12>120&次培养丹\n10.每日可购买&<12>120&次顶级精炼石\n11.每日可购买&<12>130&次极品经验书\n12.每日可购买&<12>120&次经验虎符\n13.每日可购买&<12>45&次图鉴升级石\n14.每日将魂商店可刷新&<12>120&次\n15.每日可购买&<12>26&次军团副本挑战次数\n",},  
    [13] = {13,12,142500,150000,540,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,5000,"不灭神镰",8,"紫金装备","",950,1,"1.每日可购买&<12>44&次体力丹\n2.每日可购买&<12>30&次寻宝令\n3.每日可购买&<12>30&次竞技场挑战令\n4.每日可购买&<12>28&次特级装备随机箱\n5.每日可购买&<12>28&次特级宝物随机箱\n6.每日可购买&<12>170&次进阶丹\n7.每日可购买&<12>170&次兵符铸造石\n8.每日可购买&<12>130&次兵符精华\n9.每日可购买&<12>130&次时装精华\n10.每日可购买&<12>130&次宝物精炼石\n11.每日可购买&<12>130&次培养丹\n12.每日可购买&<12>130&次顶级精炼石\n13.每日可购买&<12>140&次极品经验书\n14.每日可购买&<12>130&次经验虎符\n15.每日可购买&<12>35&次进阶饰品魂\n16.每日可购买&<12>15&次列传次数\n17.每日将魂商店可刷新&<12>140&次\n18.每日可购买&<12>28&次军团副本挑战次数\n",},  
    [14] = {14,13,237500,250000,541,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,5010,"不灭飞履",8,"紫金装备","",830,1,"1.每日可购买&<12>46&次体力丹\n2.每日可购买&<12>30&次特级装备随机箱\n3.每日可购买&<12>30&次特级宝物随机箱\n4.每日可购买&<12>180&次进阶丹\n5.每日可购买&<12>180&次兵符铸造石\n6.每日可购买&<12>140&次兵符精华\n7.每日可购买&<12>140&次时装精华\n8.每日可购买&<12>140&次宝物精炼石\n9.每日可购买&<12>140&次培养丹\n10.每日可购买&<12>140&次顶级精炼石\n11.每日可购买&<12>150&次极品经验书\n12.每日可购买&<12>140&次经验虎符\n13.每日可购买&<12>50&次图鉴升级石\n14.每日将魂商店可刷新&<12>160&次\n15.每日可购买&<12>30&次军团副本挑战次数\n",},  
    [15] = {15,14,380000,400000,542,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,7,5020,"不灭玄铠",8,"紫金装备","",600,-1,"1.每日可购买&<12>48&次体力丹\n2.每日可购买&<12>32&次特级装备随机箱\n3.每日可购买&<12>32&次特级宝物随机箱\n4.每日可购买&<12>190&次进阶丹\n5.每日可购买&<12>190&次兵符铸造石\n6.每日可购买&<12>150&次兵符精华\n7.每日可购买&<12>150&次时装精华\n8.每日可购买&<12>150&次宝物精炼石\n9.每日可购买&<12>150&次培养丹\n10.每日可购买&<12>150&次顶级精炼石\n11.每日可购买&<12>160&次极品经验书\n12.每日可购买&<12>150&次经验虎符\n13.每日可购买&<12>40&次进阶饰品魂\n14.每日将魂商店可刷新&<12>180&次\n15.每日可购买&<12>32&次军团副本挑战次数\n",},  
    [16] = {16,15,0,0,543,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,11,700,"天师",7,"金色时装","全体攻击、沉默增伤",830,-1,"1.每日可购买&<12>50&次体力丹\n2.每日可购买&<12>35&次特级装备随机箱\n3.每日可购买&<12>35&次特级宝物随机箱\n4.每日可购买&<12>200&次进阶丹\n5.每日可购买&<12>200&次兵符铸造石\n6.每日可购买&<12>160&次兵符精华\n7.每日可购买&<12>160&次时装精华\n8.每日可购买&<12>160&次宝物精炼石\n9.每日可购买&<12>160&次培养丹\n10.每日可购买&<12>160&次顶级精炼石\n11.每日可购买&<12>170&次极品经验书\n12.每日可购买&<12>160&次经验虎符\n13.每日将魂商店可刷新&<12>200&次\n14.每日可购买&<12>34&次军团副本挑战次数\n",},
    }
}

local __index_level = {   
    [0] = 1,  
    [1] = 2,  
    [2] = 3,  
    [3] = 4,  
    [4] = 5,  
    [5] = 6,  
    [6] = 7,  
    [7] = 8,  
    [8] = 9,  
    [9] = 10,  
    [10] = 11,  
    [11] = 12,  
    [12] = 13,  
    [13] = 14,  
    [14] = 15,  
    [15] = 16,
}

local __key_map = { 
    id = 1,
    level = 2,
    show_exp = 3,
    need_vip_exp = 4,
    vip_packs = 5,
    frame = 6,
    privilege_id_1 = 7,
    privilege_id_2 = 8,
    privilege_id_3 = 9,
    privilege_id_4 = 10,
    privilege_id_5 = 11,
    privilege_id_6 = 12,
    privilege_id_7 = 13,
    privilege_id_8 = 14,
    privilege_id_9 = 15,
    privilege_id_10 = 16,
    privilege_id_11 = 17,
    privilege_id_12 = 18,
    privilege_id_13 = 19,
    privilege_id_14 = 20,
    privilege_id_15 = 21,
    privilege_id_16 = 22,
    privilege_id_17 = 23,
    privilege_id_18 = 24,
    privilege_id_19 = 25,
    privilege_id_20 = 26,
    vip_show = 27,
    show_type = 28,
    show_value = 29,
    vip_packs_name = 30,
    vip_packs_quality = 31,
    vip_packs_txt_1 = 32,
    vip_packs_txt_2 = 33,
    vip_pic_scaling = 34,
    vip_pic_turn = 35,
    function_direction = 36,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_vip_level_info")

        return t._raw[__key_map[k]]
    end
}


function vip_level_info.getLength()
    return #vip_level_info._data
end



function vip_level_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_vip_level_info
function vip_level_info.indexOf(index)
    if index == nil or not vip_level_info._data[index] then
        return nil
    end
    return setmetatable({_raw = vip_level_info._data[index]}, m)
end



---
--@return @class record_vip_level_info
function vip_level_info.get(level)
    
    return vip_level_info.indexOf(__index_level[ level ])
     
end



function vip_level_info.set(level, key, value)
    local record = vip_level_info.get(level)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function vip_level_info.get_index_data()
    return __index_level 
end

return  vip_level_info 