---@classdef record_wing_info
local record_wing_info = {}


record_wing_info.id = 0--翅膀ID
record_wing_info.name =  ""--名称
record_wing_info.name_res = 0--翅膀名称切字
record_wing_info.icon_res = 0--icon资源
record_wing_info.res = 0--spine资源
record_wing_info.effect_res =  ""--特效资源
record_wing_info.put = 0--是否投放
record_wing_info.class = 0--阶数
record_wing_info.grade = 0--段位
record_wing_info.quality = 0--品质
record_wing_info.pre_id = 0--前置翅膀ID
record_wing_info.compose_type_1 = 0--合成材料1类型
record_wing_info.compose_value_1 = 0--合成材料1类型值
record_wing_info.compose_size_1 = 0--合成材料1数量
record_wing_info.affect_type_1 = 0--加成属性1
record_wing_info.affect_value_1 = 0--加成类型值1
record_wing_info.affect_type_2 = 0--加成属性2
record_wing_info.affect_value_2 = 0--加成类型值2
record_wing_info.affect_type_3 = 0--加成属性3
record_wing_info.affect_value_3 = 0--加成类型值3
record_wing_info.affect_type_4 = 0--加成属性4
record_wing_info.affect_value_4 = 0--加成类型值4
record_wing_info.affect_type_5 = 0--加成属性5
record_wing_info.affect_value_5 = 0--加成类型值5
record_wing_info.gm = 0--是否GM后台发送
record_wing_info.des =  ""--翅膀描述

local wing_info = {
   _data = {   
    [1] = {1001,"蝶影",1001,1001,1001,"effect_wing_1001",1,1,0,5,0,3,103,1,1,150000,2,8000,5,7000,0,0,0,0,1,"蝶是自然的精灵，齐物论中有庄子梦而化蝶的故事。蝶也是古时的人们对自由飞翔的渴望。蝶翼轻薄如纸，却可以承载数十倍于己身的重量。以万蝶炼化而成的蝶影之翼可以托载人们的飞翔之梦。",},  
    [2] = {2001,"幽翼",2001,2001,2001,"effect_wing_2001",1,2,0,5,1001,3,103,1,1,310000,2,16000,5,15000,0,0,0,0,1,"九幽之下是为冥，这是人们畏惧未知的领域，传说中的鬼神便是出自于此。九幽倒悬万里，即便找到入口，没有翅膀的力量，常人也会跌入万丈深渊下的冥府。而能横渡九幽的翅膀便被成为幽翼。",},  
    [3] = {3001,"百炼剑翼",3001,3001,3002,"effect_wing_3002",1,3,0,6,2001,3,104,1,1,1230000,2,65000,5,58000,209,100,0,0,1,"古战场中，煞气与英气百年不散，仿佛记录着当年的英雄在战场中无敌的身姿。兵刃交锋的声音常常也在古战场回响。传说中，将万把神兵在古战场熔炼，期间浸润战争的气息，可得一双百炼剑翼，它是武器，更是翅膀，可以打败所有阻止它冲上九天的敌人。",},  
    [4] = {3002,"冰晶霓羽",3002,3002,3001,"effect_wing_3001",1,4,0,6,3001,3,104,1,1,2100000,2,110000,5,100000,209,100,210,100,1,"极北之地，冰封千里，漫天风雪下只有灵物的踪迹。传说中，循着这些灵物踪迹，可以到达极北神窟。神窟中万年冰雪不化，在神窟中央，冰封着一双霓羽。这双翅膀的历史久远到无法可考，传说中只是描述了它寒气逼人，晶莹剔透，是人间不可拥有的奇物。",},  
    [5] = {4001,"弧光雷鸣",4001,4001,4002,"effect_wing_4002",1,5,0,7,3002,3,105,1,1,6000000,2,310000,5,280000,209,200,210,150,1,"九天之上有苍穹，而欲渡九天达到苍穹，需要跨越万雷之界。苍穹非是凡人可以奢望的，就是因为万雷之界，天雷滚滚而下，可以撕碎世间的一切。而渡过雷劫的唯一办法，就是取得雷鸣之翼。雷鸣之翼是九天雷劫留在人间的残影，可以与天雷共鸣，无需承担它的暴怒。传说中，雷鸣之翼现世，会有弧光划破天空。",},  
    [6] = {4002,"炽焰火凤",4002,4002,4001,"effect_wing_4001",1,6,1,7,4001,3,105,1,1,9500000,2,500000,5,450000,209,250,210,250,1,"西域深处有火焰山，终年烈火蔓延连绵的大山，常人根本无法接近。传说中在火焰山的中央生活着一只千年凤凰，它寿元百载，浴火重生，终而复始，不知其数。这只凤凰有一双炽焰羽翼。扇动时，整片火焰山的熊熊烈火会愈发疯狂，仿佛要吞噬世间的一切；火凤收敛羽翼，火焰便也收回爪牙，期待下一次的燃烧。",},  
    [7] = {40021,"炽焰火凤",4002,4002,4001,"effect_wing_4001",1,6,2,7,4002,3,105,1,1,11400000,2,600000,5,540000,209,300,210,250,1,"西域深处有火焰山，终年烈火蔓延连绵的大山，常人根本无法接近。传说中在火焰山的中央生活着一只千年凤凰，它寿元百载，浴火重生，终而复始，不知其数。这只凤凰有一双炽焰羽翼。扇动时，整片火焰山的熊熊烈火会愈发疯狂，仿佛要吞噬世间的一切；火凤收敛羽翼，火焰便也收回爪牙，期待下一次的燃烧。",},  
    [8] = {4003,"九幽冥神",4003,4003,4003,"effect_wing_4003",1,7,1,7,40021,3,105,1,1,14400000,2,760000,5,680000,209,350,210,300,1,"九幽之下的冥府是世人望而却步的领域。冥府中有神统御黑暗中的万物。冥界之神拥有九幽中最大的神翼，双翼展开可以遮蔽来自人间的所有光亮。冥神的大部分时间都在沉睡，双翼收敛，这时九幽中贪婪的恶鬼便可以攫食从人间误闯而来的倒霉之人。而冥神苏醒时，双翼展开，九幽中的恶鬼就会藏匿于黑暗中，聆听冥神的低语。",},  
    [9] = {40031,"九幽冥神",4003,4003,4003,"effect_wing_4003",1,7,2,7,4003,3,105,1,1,17500000,2,920000,5,830000,209,350,210,350,1,"九幽之下的冥府是世人望而却步的领域。冥府中有神统御黑暗中的万物。冥界之神拥有九幽中最大的神翼，双翼展开可以遮蔽来自人间的所有光亮。冥神的大部分时间都在沉睡，双翼收敛，这时九幽中贪婪的恶鬼便可以攫食从人间误闯而来的倒霉之人。而冥神苏醒时，双翼展开，九幽中的恶鬼就会藏匿于黑暗中，聆听冥神的低语。",},  
    [10] = {4004,"日曜明光",4004,4004,4004,"effect_wing_4004",1,8,1,7,40031,3,105,1,1,20600000,2,1080000,5,970000,209,400,210,400,1,"地之东极，旸谷之中，有神木名为扶桑，传说是连接神界、人间和冥府的大门。太阳之神取扶桑神木并旸谷初升的日光做成了一双日曜神翼。当这双神翼舒展之时，有万丈明光从期间穿过，阴云扫尽，烈日清辉；当这双神翼收敛之时，万物幽寂，百魅丛生。传闻佩戴此翼，可以上达九霄下至九幽。",},  
    [11] = {40041,"日曜明光",4004,4004,4004,"effect_wing_4004",1,8,2,7,4004,3,105,1,1,23600000,2,1240000,5,1120000,209,450,210,400,1,"地之东极，旸谷之中，有神木名为扶桑，传说是连接神界、人间和冥府的大门。太阳之神取扶桑神木并旸谷初升的日光做成了一双日曜神翼。当这双神翼舒展之时，有万丈明光从期间穿过，阴云扫尽，烈日清辉；当这双神翼收敛之时，万物幽寂，百魅丛生。传闻佩戴此翼，可以上达九霄下至九幽。",},  
    [12] = {40051,"青霜凰彩",4005,4005,4005,"effect_wing_4005",1,9,1,7,40041,3,105,1,1,26700000,2,1410000,5,1270000,209,500,210,450,1,"东海之东，天地的尽头，有一座在海天相接时才会显现的小岛。岛上冰霜遍布，万物寂灭，仅有一棵参天大树长于小岛的中心。传说有只神鸟生活在大树的树冠之上，名曰蓝凰。其性柔和，与天地同寿。若它扇动羽翼，能使天地变色，瞬间降下暴雨，洗涤万物。若它合拢羽翼，则能驱散狂风暴雨，护佑出航之人。",},  
    [13] = {40052,"青霜凰彩",4005,4005,4005,"effect_wing_4005",1,9,2,7,40051,3,105,1,1,29800000,2,1570000,5,1410000,209,500,210,500,1,"东海之东，天地的尽头，有一座在海天相接时才会显现的小岛。岛上冰霜遍布，万物寂灭，仅有一棵参天大树长于小岛的中心。传说有只神鸟生活在大树的树冠之上，名曰蓝凰。其性柔和，与天地同寿。若它扇动羽翼，能使天地变色，瞬间降下暴雨，洗涤万物。若它合拢羽翼，则能驱散狂风暴雨，护佑出航之人。",},  
    [14] = {40061,"玄冰千刃",4006,4006,4006,"effect_wing_4006",1,10,1,7,40052,3,105,1,1,35000000,2,1840000,5,1660000,209,550,210,550,1,"极北之地有皑皑雪山，雪山绝顶之处寒气凛冽，为仙人淬炼肉身、磨砺神识之地。万载轮回，寒气凝聚于山顶凌霄之处，化为万年玄冰。仙人羽化登仙之时，取万年玄冰，锻造成千万支极寒极坚之刃，以刃为羽翼，从雪山绝顶之处飞升。羽翼展开，如万千冰刃刺破苍穹，时空为之停滞，即使是明明日光、九霄神雷，也要避其锋芒。",},  
    [15] = {40062,"玄冰千刃",4006,4006,4006,"effect_wing_4006",1,10,2,7,40061,3,105,1,1,40300000,2,2120000,5,1910000,209,600,210,550,1,"极北之地有皑皑雪山，雪山绝顶之处寒气凛冽，为仙人淬炼肉身、磨砺神识之地。万载轮回，寒气凝聚于山顶凌霄之处，化为万年玄冰。仙人羽化登仙之时，取万年玄冰，锻造成千万支极寒极坚之刃，以刃为羽翼，从雪山绝顶之处飞升。羽翼展开，如万千冰刃刺破苍穹，时空为之停滞，即使是明明日光、九霄神雷，也要避其锋芒。",},  
    [16] = {50011,"炼狱寒天",5001,5001,5001,"effect_wing_5001",1,11,1,8,40062,3,211,1,1,52900000,2,2790000,5,2510000,209,650,210,600,1,"上古之纪，玄冥、祝融二神因理念不合而发生争斗。霎时间大地寒如冥府、天空灼似熔炉。黄帝为阻止二神争斗，取祝融炼天之火与玄冥结地之冰，将二物结合炼制出一对冰火相容的神翼。黄帝凭此神翼登入天庭，怒斥二神胡作非为。二神羞愧难当，遂把手言和。黄帝亦将此神翼悬于天庭，时刻警醒天庭诸神毋要霍乱人间。",},  
    [17] = {50012,"炼狱寒天",5001,5001,5001,"effect_wing_5001",1,11,2,8,50011,3,211,1,1,65600000,2,3450000,5,3110000,209,650,210,650,1,"上古之纪，玄冥、祝融二神因理念不合而发生争斗。霎时间大地寒如冥府、天空灼似熔炉。黄帝为阻止二神争斗，取祝融炼天之火与玄冥结地之冰，将二物结合炼制出一对冰火相容的神翼。黄帝凭此神翼登入天庭，怒斥二神胡作非为。二神羞愧难当，遂把手言和。黄帝亦将此神翼悬于天庭，时刻警醒天庭诸神毋要霍乱人间。",},  
    [18] = {50013,"炼狱寒天",5001,5001,5001,"effect_wing_5001",1,11,3,8,50012,3,211,1,1,78200000,2,4120000,5,3700000,209,700,210,650,1,"上古之纪，玄冥、祝融二神因理念不合而发生争斗。霎时间大地寒如冥府、天空灼似熔炉。黄帝为阻止二神争斗，取祝融炼天之火与玄冥结地之冰，将二物结合炼制出一对冰火相容的神翼。黄帝凭此神翼登入天庭，怒斥二神胡作非为。二神羞愧难当，遂把手言和。黄帝亦将此神翼悬于天庭，时刻警醒天庭诸神毋要霍乱人间。",},  
    [19] = {50021,"幻夜千星",5002,5002,5002,"effect_wing_5002",1,12,1,8,50013,3,211,1,1,90800000,2,4780000,5,4300000,209,750,210,700,1,"据古籍记载，极北严寒之地有一异兽，其形体样貌已无从考究，但其双翼却有遮天蔽日之能。相传此异兽曾凭借双翼遮住太阳，使极北寒地陷入了长达半年的弥天幻夜。在此期间异兽吞噬天空万千星辰，将星辰之力凝聚于双翼之中，直至双翼漆黑如夜，挥动间有无数星光闪烁，宛若灿烂星夜。以翼化夜后，异兽振翅高飞，冲破云霄，于宇宙中纵横翱翔。",},  
    [20] = {50022,"幻夜千星",5002,5002,5002,"effect_wing_5002",1,12,2,8,50021,3,211,1,1,103500000,2,5450000,5,4900000,209,750,210,750,1,"据古籍记载，极北严寒之地有一异兽，其形体样貌已无从考究，但其双翼却有遮天蔽日之能。相传此异兽曾凭借双翼遮住太阳，使极北寒地陷入了长达半年的弥天幻夜。在此期间异兽吞噬天空万千星辰，将星辰之力凝聚于双翼之中，直至双翼漆黑如夜，挥动间有无数星光闪烁，宛若灿烂星夜。以翼化夜后，异兽振翅高飞，冲破云霄，于宇宙中纵横翱翔。",},  
    [21] = {50023,"幻夜千星",5002,5002,5002,"effect_wing_5002",1,12,3,8,50022,3,211,1,1,116100000,2,6110000,5,5500000,209,800,210,750,1,"据古籍记载，极北严寒之地有一异兽，其形体样貌已无从考究，但其双翼却有遮天蔽日之能。相传此异兽曾凭借双翼遮住太阳，使极北寒地陷入了长达半年的弥天幻夜。在此期间异兽吞噬天空万千星辰，将星辰之力凝聚于双翼之中，直至双翼漆黑如夜，挥动间有无数星光闪烁，宛若灿烂星夜。以翼化夜后，异兽振翅高飞，冲破云霄，于宇宙中纵横翱翔。",},
    }
}

local __index_id = {   
    [1001] = 1,  
    [2001] = 2,  
    [3001] = 3,  
    [3002] = 4,  
    [4001] = 5,  
    [4002] = 6,  
    [4003] = 8,  
    [4004] = 10,  
    [40021] = 7,  
    [40031] = 9,  
    [40041] = 11,  
    [40051] = 12,  
    [40052] = 13,  
    [40061] = 14,  
    [40062] = 15,  
    [50011] = 16,  
    [50012] = 17,  
    [50013] = 18,  
    [50021] = 19,  
    [50022] = 20,  
    [50023] = 21,
}

local __key_map = { 
    id = 1,
    name = 2,
    name_res = 3,
    icon_res = 4,
    res = 5,
    effect_res = 6,
    put = 7,
    class = 8,
    grade = 9,
    quality = 10,
    pre_id = 11,
    compose_type_1 = 12,
    compose_value_1 = 13,
    compose_size_1 = 14,
    affect_type_1 = 15,
    affect_value_1 = 16,
    affect_type_2 = 17,
    affect_value_2 = 18,
    affect_type_3 = 19,
    affect_value_3 = 20,
    affect_type_4 = 21,
    affect_value_4 = 22,
    affect_type_5 = 23,
    affect_value_5 = 24,
    gm = 25,
    des = 26,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_wing_info")

        return t._raw[__key_map[k]]
    end
}


function wing_info.getLength()
    return #wing_info._data
end



function wing_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_wing_info
function wing_info.indexOf(index)
    if index == nil or not wing_info._data[index] then
        return nil
    end
    return setmetatable({_raw = wing_info._data[index]}, m)
end



---
--@return @class record_wing_info
function wing_info.get(id)
    
    return wing_info.indexOf(__index_id[ id ])
     
end



function wing_info.set(id, key, value)
    local record = wing_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function wing_info.get_index_data()
    return __index_id 
end

return  wing_info 